Repository: amery/clip-angelo
Catalog: doc/po/doc/sql.sgml/*.po
Languages: ru

source: Working with SQL servers
ru: Работа с SQL серверами

source: Rushad
ru: Рушад

source: Nabiullin
ru: Набиуллин

source: CLIP provides simple but powerful tools for access to the various SQL servers. The underlying principles of this tools are considered in this chapter. Some features and possibilities and related classes and functions are described below.
ru: CLIP предоставляет простой, но мощный инструмент для доступа к различным SQL серверам. В этой главе рассматриваются концепции, лежащие в основе этого инструмента. Также описываются основные возможности и классы и функции для для работы с SQL серверами.

source: Features
ru: Возможности

source: Some of the features and possibilities are listed below.
ru: Ниже перечислены некоторые возможности инструмента.

source: CLIP unifies use of the various SQL servers thus hiding individual peculiarities of their APIs from developers as many as possible. Nevertheless you should know SQL dialect of desired RDBMS.
ru: CLIP унифицирует использование различных SQL серверов, таким образом скрывая особенности их API от разработчика, настолько, насколько это возможно. Тем не менее, вы должны знать диалект языка SQL, используемый в выбранном СУБД.

source: Transactions are supported. By default each SQL statement works in it's own transaction (each statement is enclosed in pair of START/COMMIT implicitly). Nevertheless it is possible to accomplish a sequence of the statements in one transaction by calling explicitly START and COMMIT or ROLLBACK functions in appropriate points.
ru: Поддерживаются транзакции. По умолчанию каждый оператор SQL работает в своей собственной транзакции (после выполнения каждого оператора неявно производится COMMIT). Тем не менее, возможно выполнение нескольких операторов в одной транзакции, путем ручного старта транзакции, с последующим его завершением (COMMIT или ROLLBACK).

source: Local ordering allow change the order of rows locally, no more need to charge the server by almost the same query with different ORDER BY clause. Also, local orders allow fast seek for desired row in huge the result set.
ru: Локальные индексы позволяют менять логический порядок записей. Больше не нужно загружать сервер почти одинаковыми запросами, отличающимися лишь предложением ORDER BY. Локальные индексы позволяют также производить быстрый поиск по ключу в большом наборе записей.

source: Automation of mirroring updates in database. You may provide appropriate UPDATE, DELETE, INSERT statements which will be executed automaticly after update of the local set of the selected rows.
ru: Автоматизация отражения изменений в базе данных. Можно снабдить набор записей соответствующими операторами UPDATE, DELETE, INSERT, которые будут автоматически выполняться на сервере при изменении набора выбранных записей.

source: Two fetch modes - full fetch and fetch on demand. In first mode all result rows are fetched after execution of SELECT statement. The fetching process can be observed and cancelled by user defined function. In second mode the fetching is accomplished as far as particular row has been addressed. Such kind of execution is helpful when amount of result rows can't be estimated.
ru: Два режима загрузки (выборки) записей - полная выборка и выборка по требованию. В первом режиме все выбранные записи полностью загружаются сразу после выполнения запроса SELECT. За процессом загрузки можно наблюдать и его можно досрочно прекращать при помощи функции определяемой пользователем. Во втором режиме загрузка записей осуществляется по мере обращения к ним. Такой режим загрузки полезен, когда невозможно оценить заранее количество записей, удовлетворяющих запросу SELECT.

source: Quick start
ru: Краткий курс

source: Building an application
ru: Сборка приложения

source: To build an application working with desired SQL server you have to install appropriate <![CDATA[clip-<rdbms>]]> package. The following packages are available currently:
ru: Чтобы построить приложение работающее с каким-нибудь SQL сервером, необходимо установить соответствующий пакет <![CDATA[clip-<rdbms>]]>. На данный момент доступны пакеты для следующих СУБД:

source: DBTCP proxy server for ODBC connections
ru: Прокси сервер DBTCP для использования источников данных ODBC

source: Once installed desired package you can build an application like this:
ru: Установив пакет для выбранного SQL сервера можно собирать приложение примерно так:

source: Step by step
ru: Шаг за шагом

source: Before you will be able to make something you should create a connect to the server. The function <link linkend="sqlconnectnew">ConnectNew()</link> is intended for that purpose. ConnectNew() - is a constructor of the class <link linkend="sqltconnect">TConnect</link>, i.e. it returns a TConnect object on success. Once obtained that object can be used to execute SQL statements, to select a set of desired rows, to start and end transactions. For example:
ru: Прежде всего приложение должно произвести подключение к серверу. Для этого предназначена функция <link linkend="sqlconnectnew">ConnectNew()</link> ConnectNew() - это конструктор класса <link linkend="sqltconnect">TConnect</link>, т.е. он возвращает объект класса TConnect. Этот объект может использоваться для выполнения операторов SQL; для выборки набора записей, возвращаемых запросом SELECT; а также для старта и завершения транзакций. Например:

source: Several connections can be made simultaneously. Moreover, it is possible to connect to several various servers simultaneously.
ru: Одновременно может быть произведено несколько несколько подключений. Более того, возможно одновременное подключение к нескольким различным серверам.

source: SQL statements and queries can have parameters. Parameter names must be preceded with ':'. Parameter values are passed in the bidimensional array - one row per parameter. First column contains parameter name, second - the value. For example:
ru: В операторах и запросах SQL могут использоваться параметры. Именам параметров в строке, содержащей оператор или запрос, должен предшествовать символ ':'. Значения параметров передаются в двумерном массиве, одна строка на параметр. Первый столбец каждой строки должен содержать имя параметра, второй - его значение. Например:

source: TConnect member function <link linkend="sqlcreaterowset">CreateRowset()</link> is used to obtain a set of rows - result of SELECT statement. It returns an object of TRowset class. For example:
ru: Для получения набора записей - результата запроса SELECT используется метод класса TConnect <link linkend="sqlcreaterowset">CreateRowset()</link>. Он возвращает объект класса TRowset. Например:

source: TRowset member functions allow you to navigate through the set of result rows. Here they are: <link linkend="sqlbof">Bof()</link>, <link linkend="sqleof">Eof()</link>, <link linkend="sqlskip">Skip()</link>, <link linkend="sqlgoto">Goto()</link>, <link linkend="sqlgotop">GoTop()</link>, <link linkend="sqlgobottom">GoBottom()</link>, <link linkend="sqllastrec">Lastrec()</link>, <link linkend="sqlrecno">Recno()</link>.
ru: Несколько методов класса TRowset позволяют производить навигацию по наборузаписей: <link linkend="sqlbof">Bof()</link>, <link linkend="sqleof">Eof()</link>, <link linkend="sqlskip">Skip()</link>, <link linkend="sqlgoto">Goto()</link>, <link linkend="sqlgotop">GoTop()</link>, <link linkend="sqlgobottom">GoBottom()</link>, <link linkend="sqllastrec">Lastrec()</link>, <link linkend="sqlrecno">Recno()</link>.

source: Two functions are intended to read/write the current row: <link linkend="sqlread">Read()</link> and <link linkend="sqlwrite">Write()</link>. Read() returns an object whose structure is the same as the structure of the row. For example:
ru: Две функции предназначены для чтения/записи текущей записи набора: <link linkend="sqlread">Read()</link> и <link linkend="sqlwrite">Write()</link>. Read() возвращает объект с такой же структурой, что и структура записи. Например:

source: Write() function receives an object and sets the values of fields whose names are in compliance with the attribute names of that object. For example:
ru: Метод Write() получает в качестве параметра объект с несколькими атрибутами, и устанавливает значения соответствующих полей. Например:

source: You can add row to the set (<link linkend="sqlappend">Append()</link>) and delete (<link linkend="sqldelete">Delete()</link>). Append() receives parameter - obj. For example:
ru: Можно добавлять записи к набору ((<link linkend="sqlappend">Append()</link>) и удалять (<link linkend="sqldelete">Delete()</link>). Append() получает параметр - объект. Например:

source: All changes performed by Write(), Append(), Delete() are applied to the set only. However, three additional parameters (<![CDATA[<cInsertSQL>, <cDeleteSQL>, <cUpdateSQL>]]>) can be passed to CreateRowset(). If passed, <![CDATA[<cInsertSQL>]]> will be executed implicitly by invoking Append() method. Likewise, <![CDATA[<cDeleteSQL>]]> and <![CDATA[<cUpdateSQL>]]> will be used when Delete() and Write() have been invoked. An unique ID of the row should be SELECTed in the case of Write() and Delete(). (Read about this issue documentation on the driver of desired <link linkend="sqlrdbms">RDBMS</link>.) For example:
ru: Все изменения набора записей, производимые методами Write(), Append(), Delete() - локальны. Но конструктору TRowset могут быть переданы три дополнительных параметра (<![CDATA[<cInsertSQL>, <cDeleteSQL>,<cUpdateSQL>]]>). Если передан, оператор <![CDATA[<cInsertSQL>]]> будет неявно выполнен на сервере методом Append(). Точно так же <![CDATA[<cDeleteSQL>]]> и <![CDATA[<cUpdateSQL>]]> будут выполнены методами Delete() и Write(). В случае Write() и Delete() в наборе должно присутствовать поле с уникальными идентификаторами записей. См. подробности о путях решения этой проблемы драйверами разных <link linkend="sqlrdbms">СУБД</link>. Например:

source: If amount of matched rows can't be estimated two parameters <![CDATA[ <bEval> and <nEvery>]]> will be helpful. Code block <![CDATA[<bEval>]]> will be executed during fetching process after each fetched <![CDATA[<nEvery>]]> rows. If it returns .F. the process breaks. Thus you could make a progressbar for huge result sets and cancel fetching. This example prints '.' per 100 rows and can be cancelled by pressing ESC.
ru: В случаях когда количество возвращаемых записей невозможно предугадать будут полезны параметры <![CDATA[<bEval> и <nEvery>]]>. Блок кода <![CDATA[<bEval>]]> исполняется в процессе выборки через каждые <![CDATA[<nEvery>]]> записи. Если он возвращает .F. - процесс прекращается. Таким образом можно сделать индикатор процесса для больших результирующих наборов и прекращать выборку по требованию пользователя. Нижеследующий пример печатает точку через каждые 100 загруженных записей и может быть остановлен нажатием ESC.

source: For the same reason (when amount of matched rows can't be estimated) you may direct TRowset to not fetch all found rows immediately, but fetch them on demand. There is another one parameter <![CDATA[<lNoFetch>]]> for this purpose. If passed .T., CreateRowset() terminates at once. But number of matched rows can't be obtained while not fetched rows are remained. To fetch the rest of them <link linkend="sqlfetchall">TRowset:FetchAll()</link> function could be used. <link linkend="sqlfetched">TRowset:Fetched()</link> returns number of rows fetched at the moment. For example:
ru: В подобных же случаях (когда невозможно предугадать размер результирующего набора) было бы полезно иметь возможность не загружать все записи сразу, а только тогда когда они потребуются. Для этого предназначен параметр <![CDATA[<lNoFetch>]]>. Если этот параметр .T., CreateRowset() завершается сразу после выполнения оператора SQL сервером, без загрузки записей. Загрузка производится позже, в процессе навигации по набору записей. Но в этом случае невозможно сразу определить количество выбранных записей, до тех пор пока остается хотя бы одна незагруженная запись. Для довыборки незагруженных записей существует функция <link linkend="sqlfetchall">TRowset:FetchAll()</link>. Для определения количества загруженных на данный момент записей - <link linkend="sqlfetched">TRowset:Fetched()</link>. Например:

source: TRowset supports so-called 'local orders'. 'Local order' is an index created on the client side and it allows to change an order of rows in the set. It is mostly the same as standard RDD indices, but it's time life is limited by row set's life time, i.e. it is located in the memory and does not occupy any files. <link linkend="sqlcreateorder">TRowset:CreateOrder()</link> creates an order with given name, <link linkend="sqlsetorder">TRowset:SetOrder()</link> activates an order. For example:
ru: TRowset поддерживает так называемые "локальные индексы". "Локальный индекс" - это индекс, создаваемый на клиентской стороне и используемый для изменения логического порядка записей в наборе. Это практически то же самое, что и обычные индексы в RDD, но время их жизни ограничено временем жизни набора записей. Т.е. они располгаются в памяти клиентской машины, а не в файлах. Функция <link linkend="sqlcreateorder">TRowset:CreateOrder()</link> создает индекс с заданным именем. Функция <link linkend="sqlsetorder">TRowset:SetOrder()</link> активирует индекс, после чего он начинает управлять логическим порядком записей. Например:

source: Now we shall proceed to the description of SQL related classes and functons.
ru: Теперь перейдем к описанию функций и классов предназначенных для работы с SQL серверами.

source: SQL API reference
ru: Описание API SQL

source: Return value
ru: Возвращаемое значение

source: An array of drivers as series of subarrays, one per available driver. The first element of subarray contains short ID of driver; the second - the name of RDBMS accessed by driver; the third - driver description.
ru: Двухмерный массив с описаниями доступных драйверов, по одной строке на драйвер. Первый столбец содержит краткую строку - идентификатор драйвера; второй - имя СУБД с которой работает драйвер; третий - описание драйвера.

source: Description
ru: Описание

source: <command>SQLList()</command> is used to obtain the list of available SQL drivers. The driver is available when it's library is linked with an application. If there are no linked SQL drivers an empty array is returned.
ru: <command>SQLList()</command> используется для получения списка доступных приложению драйверов для доступа к SQL серверам. Драйвер доступен, когда приложение слинковано с соответствующей библиотекой. Если ни один драйвер не прилинкован возвращается пустой массив.

source: The first element of subarray representing a driver contains RDBMS's ID (short CHARACTER value associated with driver), which is used as <![CDATA[<cRDBMS>]]> parameter of TConnect constructor <link linkend="sqlconnectnew">ConnectNew()</link>.
ru: Первый элемент строки возвращаемого массива содержит строку-идентификатор (ID) СУБД, с которым работает драйвер, используемый в качестве значения параметра <![CDATA[<cRDBMS>]]> конструктора класса TConnect <link linkend="sqlconnectnew">ConnectNew()</link>.

source: Example
ru: Пример

source: Parameters
ru: Параметры

source: RDBMS identifier; see desired <link linkend="sqlrdbms">RDBMS</link> information
ru: идентификатор СУБД; см. информацию о специфике использования конкретной <link linkend="sqlrdbms">СУБД</link>

source: a number of RDBMS specific parameters; see desired <link linkend="sqlrdbms">RDBMS</link> information
ru: несколько специфичных для используемой СУБД параметров; см. информацию о специфике использования конкретной <link linkend="sqlrdbms">СУБД</link>

source: (9th parameter) backend charset
ru: (9-й параметр) кодировка, используемая сервером

source: (10th parameter) default transaction isolation level; see desired <link linkend="sqlrdbms">RDBMS</link> information
ru: (10-й параметр) уровень изоляции по умолчанию; см. информацию о специфике использования конкретной <link linkend="sqlrdbms">СУБД</link>

source: TConnect object.
ru: Объект класса TConnect.

source: <command>ConnectNew()</command> connects to a SQL server, constructs and returns TConnect object. That object can be used to start/stop transactions, to execute SQL statements, and to obtain a set of rows by SELECT statement.
ru: <command>ConnectNew()</command> подключается к серверу, создает и возвращает объект класса TConnect. Этот объект может использоваться для старта/завершения транзакций, выполнения операторов SQL и для получения наборов записей - результата оператора SELECT.

source: Optional parameter <command><![CDATA[<cCharset>]]></command> is used to indicate that server uses different from client charset. All string transformations are made then automatically. If not passed, SET("SQL_CHARSET") is used. Note, that changing SET("SQL_CHARSET") after connection to the server has no effect for this connection.
ru: Дополнительный параметр <command><![CDATA[<cCharset>]]></command> используется в случаях, когда кодировки сервера и клиента не совпадают. Все перекодировки строк, получаемых с сервера и передаваемых обратно производятся автоматически. Если этот параметр не передан используется SET("SQL_CHARSET"). Обратите внимание, что изменение SET("SQL_CHARSET") после подключения к серверу не имеет эффекта для этого подключения.

source: If optional parameter <command><![CDATA[<cIsolation>]]></command> is not passed, an appropriate SET variable is used, for example SET("OR_ISOLATION_LEVEL") for Oracle. If there is no such SET variable, the SET("SQL_ISOLATION_LEVEL") is used.
ru: Если дополнительный параметр <command><![CDATA[<cIsolation>]]></command> не передан, используется соответствующая переменная SET, например SET("OR_ISOLATION_LEVEL") для Oracle. Если такой переменной SET нет, используется SET("SQL_ISOLATION_LEVEL").

source: Default isolation level can be overrided by <link linkend="sqlstart">TConnect:Start()</link> parameters. Changing value of an appropriate SET variable after connect wouldn't help.
ru: Вместо уровня изоляции по умолчанию может быть использоваться другой, определяемый соответствующим параметром функции <link linkend="sqlstart">TConnect:Start()</link>. Изменение значения соответствующей переменной SET после того как подключение произведено не влияет на умалчиваемый уровень изоляции этого подключения.

source: When an application completes access to the SQL server it should disconnect from the server and release system resources by calling <link linkend="sqlconndestroy">TConnect:Destroy()</link>.
ru: Когда приложению больше не требуется SQL сервер, оно должно отключиться от сервера и освободить занимаемые подключением ресурсы при помощи вызова функции-деструктора <link linkend="sqlconndestroy">TConnect:Destroy()</link>.

source: In this example the connection to the local PostgreSQL server is performed.
ru: В этом примере производится подключение к локальному серверу PostgreSQL.

source: TConnect class
ru: Класс TConnect

source: TConnect class constructor and member functions are listed below:
ru: Ниже перечислены конструктор и методы класса TConnect:

source: TConnect constructor
ru: Конструктор TConnect

source: execute SQL statement
ru: выполнение оператора SQL

source: commit transaction
ru: завершение успешной транзакции

source: disconnect from the server and destroy TConnect object
ru: отключение от сервера и деструктор TConnect

source: TRowset constructor
ru: Конструктор TRowset

source: rollback transaction
ru: откат транзакции

source: start transaction
ru: старт транзакции

source: a string containing SQL statement to be executed
ru: строка содержащая оператор SQL для выполнения

source: an array contaning SQL parameters as a series of subarrays, one per parameter. Each subarray must contain at least two elements. The first is parameter name, the second is the parameter value. Third element is used only with <link linkend="sqloracle">Oracle</link> (and is required), and contains a numeric data type identifier. Optional fourth element is used to indicate a binary value; if passed .T. no charset transformations take place
ru: двухмерный массив с параметрами SQL, по одной строке на параметр. Каждая строка должна содержать как минимум два элемента. В первом - имя параметра, во втором - его значение. Третий элемент используется только с <link linkend="sqloracle">Oracle</link> (обязателен), и содержит числовое значение - идентификатор типа данных Oracle. Дополнительный четвертый элемент служит для индикации бинарного значения; если .T. перекодировки не производятся

source: A number of affected rows.
ru: Количество затронутых записей.

source: <command>Command()</command> is used to execute non-SELECT statements. 'Non-SELECT' means any SQL statement that does not return rows. To execute a statement that returns rows use <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> even if you are not interested in the results.
ru: <command>Command()</command> используется для выполнения операторов SQL,кроме запросов SELECT (в т.ч. операторов, возвращающих результирующие строки). Для выполнения запроса, возвращающего строки, используйте <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> даже если вы не заинтересованы в получении результатов.

source: SQL statement may have parameters. Parameter names in <command><![CDATA[<cSQL>]]></command> must be preceded with ':' character. Parameter values are passed in two dimensional array <command><![CDATA[<aParameters>]]></command>.
ru: Оператор SQL может получать параметры. Имени параметра в <command><![CDATA[<cSQL>]]></command> должен предшествовать символ ':'. Значения параметров передаются в двухмерном массиве <command><![CDATA[<aParameters>]]></command>.

source: If there is no active transaction, changes made by executing <command><![CDATA[<cSQL>]]></command> are committed implicitly. If you need another behavior you have to start transaction explicitly by invoking <link linkend="sqlstart">TConnect:Start()</link>.
ru: Если нет активной транзакции, изменения, сделанные оператором <command><![CDATA[<cSQL>]]></command> коммитятся (вступают в силу) сразу. Если нужно другое поведение вызывайте <link linkend="sqlstart">TConnect:Start()</link> явно.

source: Return value is a number of affected rows, for example number of deleted rows in the case of DELETE statement.
ru: Возвращаемое значение - количество затронутых записей, например количество удаленных записей в случае оператора DELETE.

source: <command>Commit()</command> commit all changes made after invoking <link linkend="sqlstart">TConnect:Start()</link> and ends transaction. If there is no active transaction an error is generated.
ru: <command>Commit()</command> подтверждает все изменения, сделанные в транзакции, запущенной функцией <link linkend="sqlstart">TConnect:Start()</link>,и завершает транзакцию. Если нет активных транзакций, генерируется ошибка.

source: When an application completes access to the SQL server it should disconnect from the server and release system resources by calling <command>Destroy()</command>.
ru: Когда приложению больше не требуется доступ к SQLсерверу, следует отсоединитьсяот него и освободить занимавшиеся системные ресурсы при помощи вызова деструктора <command>Destroy()</command>.

source: a string containing SQL query to be executed
ru: строка содержащая SQL запрос, который следует выполнить
