Repository: amery/clip-angelo
Catalog: doc/po/doc/sql.sgml/*.po
Languages: ru

source: an array contaning SQL parameters as a series of subarrays, one per parameter. Each subarray must contain at least two elements. The first is parameter name, the second is the parameter value. Third element is used only with <link linkend="sqloracle">Oracle</link> (and is required), and contains a numeric data type identifier. Optional fourth element is used to indicate a binary value; if passed .T. no charset transformations take place. Parameters and their values passed in <![CDATA[<aParameters>]]> can be used in any of SQL statements described below
ru: двухмерный массив с параметрами SQL, по одной строке на параметр. Каждая строка должна содержать как минимум два элемента. В первом - имя параметра, во втором - его значение. Третий элемент используется только с <link linkend="sqloracle">Oracle</link> (обязателен), и содержит числовое значение - идентификатор типа данных Oracle. Дополнительный четвертый элемент служит для индикации бинарного значения; если .T. перекодировки не производятся. Переданные параметры могут использоваться в SQL операторах, описываемых ниже

source: SQL statement to be executed when a new row is added to the set
ru: оператор SQL, который следует выполнить при добавлении новой строки к набору

source: SQL statement to be executed when a row is deleted from the set
ru: оператор SQL, который следует выполнить при удалении строки из набора

source: SQL statement to be executed when a row is changed
ru: оператор SQL, который следует выполнить при изменении строки набора

source: SQL query to be executed to refresh the current row in the set
ru: запрос SQL, который следует выполнить для обновления текущей строки набора

source: name of the 'row ID' field (only for <link linkend="sqlinterbase">Interbase</link>, <link linkend="sqlodbc">ODBC</link> and <link linkend="sqldbtcp">DBTCP</link>)
ru: имя поля-идентификатора (только для <link linkend="sqlinterbase">Interbase</link>, <link linkend="sqlodbc">ODBC</link> и <link linkend="sqldbtcp">DBTCP</link>)

source: an array with definitions of the local orders to be created as a series of subarrays, one per order. First element of subarray defines the name of the order, second - a field name or code block to be evaluated to get the key value. Third element is required only for character keys and defines the length of the key.
ru: массив с определениями локальных индексов в виде серии подмассивов, по одному на индекс. Первый элемент подмассива определяет имя индекса, второй имя поля или блок кода возвращающий значения ключа. Третий элемент требуется только для символьных ключей и определяет длину ключа

source: SQL statement to be executed for getting a new unique row ID value, which will be used with <![CDATA[<cInsertSQL>]]> (only for <link linkend="sqlinterbase">Interbase</link>)
ru: оператор SQL для получения нового уникального значения поля-идентификатора, используемое в дальнейшем с оператором <![CDATA[<cInsertSQL>]]> (только для <link linkend="sqlinterbase">Interbase</link>)

source: logical value defining the fetching mode. If passed .F. all rows are fetched immediately, if .T. - rows are fetched later on demand. Default is .F.
ru: логическое значение определяющее режим загрузки записей. Если передано .F. все записи загружаются сразу, если .T. - записи загружаются позже (по требованию). По умолчанию - .F.

source: a code block to be evaluated during fetching process. TRowset object is passed to the code block as a parameter. If <![CDATA[<bEval>]]> returns .F. fetching process aborts. It is ignored in 'fetch on demand' mode (when <![CDATA[<lNoFetch>]]> is .T.)
ru: блок кода, выполняемый в процессе загрузки записей. Этот блок кода получает параметр - объект TRowset. Если блок кода возвращает .F. процесс загрузки прекращается досрочно. В режиме 'загрузка по требованию' (когда <![CDATA[<lNoFetch>]]> - .T.) этот параметр игнорируется

source: an interval of rows when <![CDATA[<bEval>]]> should be evaluated (if passed). Default is 1, i.e. <![CDATA[<bEval>]]> is evaluated after each fetched row
ru: определяет количество загруженных записей между между выполнениями <![CDATA[<bEval>]]> (если передан). По умолчанию - 1, то есть <![CDATA[<bEval>]]> выполняется после каждой загруженной записи

source: <link linkend="sqltrowset">TRowset</link> object.
ru: Объект <link linkend="sqltrowset">TRowset</link>.

source: <command>CreateRowset()</command> executes SELECT query, builds a set of resulting rows and returns a TRowset object. Thus it may be considered as a TRowset class constructor. 'SELECT query' means any valid SQL statement returning rows. Usage of any other kind of SQL statement in <![CDATA[<cSelectSQL>]]> will result in an error.
ru: <command>CreateRowset()</command> выполняет запрос SELECT, строит локальный набор результирующих записей и возвращает объект TRowset. То есть эту функцию можно рассматривать как конструктор класса TRowset. 'Запрос SELECT' означает любой оператор SQL, возвращающий результирующие записи (или пустой набор записей). Использование оператора SQL любого другого вида приведет к ошибке.

source: <![CDATA[<cInsertSQL>, <cDeleteSQL>, <cUpdateSQL>]]> are optional parameters that make easier modification of data in the database. If not passed, corresponding changes in the set don't reflect in the tables of database. <![CDATA[<cInsertSQL>]]> is executed automatically by <link linkend="sqlappend">TRowset:Append()</link> method. In the same way <![CDATA[<cDeleteSQL>]]> is executed by <link linkend="sqldelete">TRowset:Delete()</link> method, and <![CDATA[<cUpdateSQL>]]> is executed by <link linkend="sqlwrite">TRowset:Write()</link> method.
ru: <![CDATA[<cInsertSQL>, <cDeleteSQL>, <cUpdateSQL>]]> - дополнительные параметры, предназначенные для облегчения модификации таблиц базы данных. Если не переданы, соответствующие изменения набора записей не отражаются в базе данных. <![CDATA[<cInsertSQL>]]> выполняется автоматически методом <link linkend="sqlappend">TRowset:Append()</link>. Таким же образом, <![CDATA[<cDeleteSQL>]]> выполняется методом <link linkend="sqldelete">TRowset:Delete()</link>, а <![CDATA[<cUpdateSQL>]]> - методом <link linkend="sqlwrite">TRowset:Write()</link>.

source: <![CDATA[<cRefreshSQL>]]> is automatically executed by <link linkend="sqlrefreshcurrent">TRowset:RefreshCurrent()</link> method. It must have the same list of fields as <![CDATA[<cSelectSQL>]]>.
ru: <![CDATA[<cRefreshSQL>]]> выполняется автоматически методом <link linkend="sqlrefreshcurrent">TRowset:RefreshCurrent()</link>. <![CDATA[<cRefreshSQL>]]> должен запрашивать точно такой же список полей, что и <![CDATA[<cSelectSQL>]]>.

source: The row set intended to modifying must contain an unique field (row ID), which is used to bind rows in the database tables and rows in the set. You should explicitly include that field to the list of requesting fields in the SELECT query. There is various approach to that issue in various RDBMS's.
ru: Редактируемый набор записей должен содержать поле - идентификатор записи с уникальными значениями, используемый для связывания записей таблицы базы данных и строк набора. Необходимо явно включать это поле в список запрашиваемых полей запроса SELECT. Для различных СУБД существуют различные подходы к реализации механизма связывания записей таблицы и строк набора.

source: Some RDBMS's provide a 'hidden' field for that purpose (ROWID in <link linkend="sqloracle">Oracle</link>, OID in <link linkend="sqlpostgresql">PostgreSQL</link>). Such field is created for any table by default, even if you did not describe it in the CREATE TABLE statement. PostgreSQL understands such syntax:
ru: Некоторые СУБД имеют 'скрытые' поля - идентификаторы записей для каждой хранимой таблицы (ROWID в <link linkend="sqloracle">Oracle</link>, OID в <link linkend="sqlpostgresql">PostgreSQL</link>). Эти поля создаются неявно, даже если вы не включали его описания в список полей оператора CREATE TABLE. PostgreSQL понимает такой синтаксис:

source: In the contrast, Oracle does not allow such syntax. You should enumerate all fields by the name:
ru: В отличие от PostgreSQL, Oracle не понимает такого синтаксиса. Необходимо перечислить все запрашиваемые поля:

source: Some RDBMS's provide autoincremental fields for that purpose. <link linkend="sqlmysql">MySQL</link>'s CREATE TABLE syntax allows to create table with such field by using AUTO_INCREMENT clause in the field's definition. CLIP discerns such field and uses it as row ID. You don't need to do anything more to indicate a field as row ID except for definition a field with AUTO_INCREMENT clause in CREATE TABLE statement.
ru: Некоторые СУБД предоставляют возможность использования автоинкрементных полей с уникальными значениями. Синтаксис оператора CREATE TABLE в<link linkend="sqlmysql">MySQL</link> позволяет использовать предложение AUTO_INCREMENT в определении поля. CLIP распознает такие поля и использует их в качестве идентификаторов записей. Никаких других действий кроме включения поля AUTO_INCREMENT в таблицу, которую предполагается редактировать при помощи методов класса TRowset, не требуется.

source: Some RDBMS's (<link linkend="sqlinterbase">Interbase</link>) provide triggers and unique number generators. A typical approach in such case is to define a trigger BEFORE INSERT, which gets an unique ID from generator and assigns it to the 'row ID' field. But there is no way to determine 'row ID' value of newly inserted row. I.e., you can't UPDATE or DELETE just INSERTed row (a row INSERTed after TRowset object was created). You have two choices:
ru: Некоторые СУБД (<link linkend="sqlinterbase">Interbase</link>) предоставляют механизм триггеров и генераторы уникальных значений. Типичный подход в этом случае - создать триггер BEFORE INSERT, который получает уникальное значение от генератора и присваивает его полю - идентификатору записи. Но не существует способа определить значение поля - идентификатора записи вновь вставленной записи. То есть невозможно изменить или удалить (при помощи операторов UPDATE и DELETE) вновь вставленную запись (добавленную после того как был создан объект TRowset). Есть два выбора:

source: design your application considering this limitation (never UPDATE a newly INSERTed rows);
ru: оформлять приложение с учетом этого ограничения (никогда не изменять вновь вставленные записи);

source: don't use trigger BEFORE INSERT, but provide <![CDATA[<cGenIdSQL>]]> parameter containing SQL query to the generator. That statement must return an unique ID from generator which then will be assigned to the field with name <![CDATA[<cIdName>]]> during executing <![CDATA[<cInsertSQL>]]> statement.
ru: не использовать триггер BEFORE INSERT, а передавать конструктору TRowset параметр <![CDATA[<cGenIdSQL>]]> с запросом к генератору уникальных значений. Этот оператор должен возвращать новое уникальное значение, которое будет затем присвоено полю с именем <![CDATA[<cIdName>]]> во время выполнения оператора <![CDATA[<cInsertSQL>]]>.

source: Interbase's RDB$DB_KEY attribute intended to be a 'row ID' is not actually. It is rather a 'row address' which can be changed (like RECNO() which can be changed after PACK). Therefore it's not used as 'row ID'.
ru: Атрибут таблиц Interbase под названием RDB$DB_KEY в действительности не является идентификатором записи, а скорее адресом записи, которое может меняться (как RECNO(), значение которого может измениться после PACK). Поэтому этот атрибут не используется в качестве идентификатора записей.

source: In the case of RDBMS's not providing any of features described above (ODBC, DBTCP), you should pass <![CDATA[<cIdName>]]> parameter with the name of 'row ID' field and should design your application so that a newly INSERTed row never is changed or deleted.
ru: В случае использования СУБД не предоставляющих никаких из вышеперечисленных возможностей (ODBC,DBTCP), необходимо передавать параметр <![CDATA[<cIdName>]]> с именем поля - идентификатора записи и оформлять ваши приложения таким образом, чтобы никогда не изменялись вновь вставленные записи.

source: SQL statements <![CDATA[<cInsertSQL>, <cDeleteSQL>, <cUpdateSQL> and <cRefreshSQL>]]> get values of current row fields through parameters with the same name as row set's field name. For example:
ru: Операторы SQL <![CDATA[<cInsertSQL>, <cDeleteSQL>, <cUpdateSQL> и <cRefreshSQL>]]> получают значения полей через параметры SQL с именами совпадающими с именами полей набора. Например:

source: There are three macros: %FIELDS, %VALUES for use in <![CDATA[<cInsertSQL>]]>; %LIST for use in <![CDATA[<cUpdateSQL>]]>. %FIELDS is expanded as list of field names; %VALUES - as parameter names; %LIST - as list of fields and corresponding parameters. For example:
ru: Имеется три макроса: %FIELDS, %VALUES для использования в операторе INSERT; %LIST для использования в операторе UPDATE. %FIELDS преобразуется в список имен полей; %VALUES - в список параметров; %LIST - в список полей и параметров. Например:

source: There are two modes of fetching rows controlled by <![CDATA[<lNoFetch>]]> parameter: full fetching and fetching on demand.
ru: Имеется два режима загрузки записей, управляемые параметром <![CDATA[<lNoFetch>]]>: полная загрузка и загрузка по требованию.

source: In the first mode (<![CDATA[<lNoFetch>]]>==.F.) all selected rows have been fetched before <command>CreateRowset()</command> terminates. You can immediately use <link linkend="sqllastrec">TRowset:Lastrec()</link> to determine the number of selected rows in this mode. You can use <![CDATA[<bEval>]]> code block to observe and to manage fetching process.
ru: В первом режиме (<![CDATA[<lNoFetch>]]>==.F.) все результирующие записи загружаются до завершения <command>CreateRowset()</command>. В этом режиме можно сразу использовать <link linkend="sqllastrec">TRowset:Lastrec()</link> для определения количества результирующих записей. Можно использовать <![CDATA[<bEval>]]> для наблюдения и прерывания процесса загрузки.

source: In the second mode (<![CDATA[<lNoFetch>]]>==.T.) rows are fetched later on demand (during the navigation through the set). This mode is more faster but <command>Lastrec()</command> returns actual number of selected rows only after all rows have been fetched. <![CDATA[<bEval>]]> parameter is ignored in this mode.
ru: Во втором режиме (<![CDATA[<lNoFetch>]]>==.T.) записи загружаются по требованию (в процессе навигации по набору). Этот режим гораздо быстрее, но <command>Lastrec()</command> возвращает рельное количество результирующих записей только после того как загрузятся все записи. В этом режиме параметр <![CDATA[<bEval>]]> игнорируется.

source: When an application completes using the row set, it should release the set by calling <link linkend="sqlrsdestroy">TRowset:Destroy()</link>.
ru: Когда приложению больше не требуется набор строк, оно должно освободить занимаемые ресурсы при помощи вызова метода-деструктора <command>TRowset:Destroy()</command>.

source: Examples
ru: Примеры

source: Simple example which creates a row set not intended to modifying:
ru: Простой пример, в котором создается нередактируемый набор записей:

source: Creating a row set using SQL parameters in SELECT query:
ru: Создание набора записей с использованием параметров SQL:

source: Creating a row set intended to modifying:
ru: Создание редактируемого набора записей:

source: Creating a row set with local orders 'id' and 'fullname':
ru: Создание набора записей с локальными индексами 'id' и 'fullname':

source: Using <![CDATA[<bEval>]]> to observe fetching process (printing a dot every 100 rows), which can be stopped by pressing ESC:
ru: Использование <![CDATA[<bEval>]]> для наблюдения за процессом загрузки (через каждые 100 загруженные записи печатается точка), который можно прервать нажатием ESC:

source: Fetching rows on demand:
ru: Загрузка записей по требованию:

source: <command>Rollback()</command> discards all changes made after invoking <link linkend="sqlstart">TConnect:Start()</link> and ends transaction. If there is no active transaction an error is generated.
ru: <command>Rollback()</command> отменяет все изменения сделанные во время транзакции и завершает транзакцию. Если нет активной транзакции генерируется ошибка.

source: a string defining isolation level to be used during transaction. This parameter overrides default isolation level defined by <![CDATA[<cIsolation>]]> parameter of <link linkend="sqlconnectnew">ConnectNew()</link> function. See desired <link linkend="sqlrdbms">RDBMS</link> section about what values can be passed with this parameter
ru: строка определяющая уровень изоляции для запускаемой транзакции. См. раздел описывающий особенности разных <link linkend="sqlrdbms">СУБД</link> о возможных значениях этого параметра.

source: this parameter is used only with <link linkend="sqlinterbase">Interbase</link> and defines which tables should be locked and how
ru: этот параметр используется только с <link linkend="sqlinterbase">Interbase</link> и определяет какие таблицы заблокировать и как

source: <command>Start()</command> starts new transaction. There must be no active transaction, otherwise an error is generated. Transaction should be sometime stopped (either must be commited or must be rolled back by invoking <link linkend="sqlcommit">TConnect:Commit()</link> or <link linkend="sqlrollback">TConnect:Rollback()</link> function).
ru: <command>Start()</command> стартует новую транзакцию. В момент запуска новой транзакция предыдущая должна быть завершена, иначе генерируется ошибка. Транзакция должна быть когда-нибудь завершена при помощи <link linkend="sqlcommit">TConnect:Commit()</link> или <link linkend="sqlrollback">TConnect:Rollback()</link>.

source: If there is no active transaction all changes to the database are commited immediately after executing each SQL statement.
ru: Если нет активной транзакции, все изменения таблицы вступают в силу после каждого выполненного оператора SQL.

source: TRowset class
ru: Класс TRowset

source: TRowset class constructor and member functions are listed below:
ru: Ниже перечислены конструктор и методы класса TRowset:

source: append a new row to the row set
ru: добавление новой строки в набор

source: determine when beginning of set is encountered
ru: определение достижения начала набора

source: browse rows within a window
ru: просмотр набора строк в окне

source: create new local order
ru: создание нового локального индекса

source: delete a row from the row set
ru: удаление строки из набора

source: destroy TRowset object
ru: уничтожение объекта TRowset

source: determine when end of set is encountered
ru: определение достижения конца набора

source: fetch all unfetched rows
ru: дозагрузка оставшихся записей

source: determine the number of fetched rows
ru: определение количества загруженных строк

source: determine if a given field is binary
ru: определение, является ли поле бинарным

source: return a set/get code block for a given field
ru: создание блока кода для доступа к заданному полю набора

source: determine number of decimal digits in a given field
ru: определение количества знаков после запятой для заданного поля

source: determine length of a given field
ru: определение длины заданного поля

source: return the name of a field with a given position
ru: определение имени поля по заданной позиции

source: return the position of a field with a given name
ru: определение позиции поля с заданным именем

source: determine if a given field is nullable
ru: определение, может ли поле принимать значения NULL

source: return XBase type of the field
ru: определение типа данных поля

source: return RDBMS type of the field
ru: определение типа данных поля (в терминах используемой СУБД)

source: determine if a given field is unsigned
ru: определение, является ли поле беззнаковым

source: retrieve the value of a field in the current row
ru: получение значения поля в текущей строке

source: move to the last logical row
ru: перемещение к последней логической строке

source: move to the specified row
ru: перемещение к заданной строке

source: move to the first logical row
ru: перемещение к первой логической строке

source: determine logical position of the current row
ru: определение логического номера текущей строки

source: determine the number of rows in the set
ru: определение количества строк в наборе

source: return the number of fields in the set
ru: определение количества полей в наборе

source: read the current row
ru: чтение текущей строки

source: return the position of the current row
ru: определение номера текущей строки

source: refresh the set by repeated executing the SELECT query
ru: обновление набора путем повторного выполнения запроса SELECT

source: refresh the current row by executing <![CDATA[<cRefreshSQL>]]>
ru: обновление текущей строки путем выполнения <![CDATA[<cRefreshSQL>]]>

source: move to the row having the specified key value
ru: поиск строки с заданным значением ключа

source: set the controlling order
ru: установка логического порядка записей

source: set the value of a field in the current row
ru: присвоение значения полю текущей строки

source: move relative to the current row
ru: перемещение относительно текущей записи

source: write the current row
ru: запись текущей строки

source: an object with fields values
ru: объект со значениями полей

source: <command>Append()</command> appends a new row to the row set and assigns <![CDATA[<oRow>]]> attributes values to the approprate fields of newly inserted row.
ru: <command>Append()</command> добавляет новую строку к набору и присваивает значения атрибутов <![CDATA[<oRow>]]> соответствующим полям новой записи.

source: If row set was created with <![CDATA[<cInsertSQL>]]> parameter, the latter is executed on the SQL server with newly inserted values.
ru: Если конструктору набора записей был передан параметр <![CDATA[<cInsertSQL>]]>, то последний исполняется на SQL сервере со значениями полей новой записи.

source: If the row set was created in 'fetch on demand' mode (<![CDATA[<lNoFetch>]]> parameter of <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> is .T.), all unfetched rows are fetched before processing.
ru: Если набор был создан в режиме 'загрузка по требованию' (<![CDATA[<lNoFetch>]]>==.T.), то предварительно дозагружаются все оставшиеся записи.

source: <command>Append()</command> increases rows count returning by <link linkend="sqllastrec">TRowset:Lastrec()</link>.
ru: <command>Append()</command> увеличивает количество строк в наборе, возвращаемое методом <link linkend="sqllastrec">TRowset:Lastrec()</link>.

source: Current row position moves to the new row.
ru: Указатель перемещается на новую строку.

source: True (.T.) after an attempt to skip backward beyond the first logical row in the set; otherwise it returns false (.F.). If the set contains no rows it returns true (.T.).
ru: .T. после попытки переместиться в обратном направлении за первую логическую строку набора; в противном случае возвращается .F. Если набор не содержит ни одной строки возвращается .T.

source: <command>Bof()</command> is used to test for a boundary condition when you are moving the row pointer backward through a set using <link linkend="sqlskip">TRowset:Skip()</link> function.
ru: <command>Bof()</command> используется для проверки условия достижения границ набора при перемещении указателя в обратном направлении при помощи метода <link linkend="sqlskip">TRowset:Skip()</link>.

source: Once <command>Bof()</command> is set to true (.T.), it retains its value until there is another attempt to move the row pointer.
ru: После того, как функцией <command>Bof()</command> будет установлено значение .T., оно остается до тех пор, пока не будет сделана очередная попытка передвижения указателя записи.
