Repository: amery/clip-angelo
Catalog: doc/po/doc/sql.sgml/*.po
Languages: ru

source: <command>TRowset:Skip()</command> is the only row movement function that can set <command>Bof()</command> to true (.T.).
ru: <command>TRowset:Skip()</command> является единственной функцией, которая может установить значение <command>Bof()</command> == .T.

source: define the window coordinates. If not specified, the default window coordinates are 1, 0 to MAXROW(), and MAXCOL().
ru: определяют координаты окна. По умолчанию 1, 0, MAXROW(), MAXCOL().

source: an array of strings containing field names to use as column values
ru: массив строк с именами полей, используемых в качестве значений колонок

source: a parallel array of strings contaning headings for each column
ru: параллельный массив строк содержащих заголовки для каждой колонки

source: a parallel array containing widths for each column
ru: параллельный массив содержащий размеры каждой колонки

source: <command>Browse()</command> is a user interface function that provides a simple browser for rows in the set.
ru: <command>Browse()</command> - функция пользовательского интерфейса предоставляющая простой просмотр строк набора.

source: defines the name of an order to be created
ru: имя создаваемого индекса

source: a name of the field which values are used as keys
ru: имя поля, значения которого используются в качестве ключей

source: a code block used to evaluate keys; it receives TRowset object as parameter
ru: блок кода, используемый для вычисления ключей; он получает объект TRowset в качестве параметра

source: a length of the key; it is required for character keys
ru: длина ключа; требуется только для символьных ключей

source: <command>CreateOrder()</command> is used to create a local order. Under 'local order' is meant an index in memory controlling logical order of rows in the set. Once created, order can be set as controlling by <link linkend="sqlsetorder">TRowset:SetOrder()</link> function. Besides, controlling order can be used to locate row having a given key by <link linkend="sqlseek">TRowset:Seek()</link> function.
ru: <command>CreateOrder()</command> используется для создания локального индекса, то есть индекса в памяти, управляющего логическим порядком строк в наборе. Созданный индекс может затем быть установлен управляющим при помощи метода <link linkend="sqlsetorder">TRowset:SetOrder()</link>. Кроме того, управляющий индекс может использоваться для быстрого поиска строки, содержащей заданный ключ при помощи метода <link linkend="sqlseek">TRowset:Seek()</link> function.

source: If rowset is created in 'fetch on demand' mode (<![CDATA[<lNoFetch>]]> parameter of <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> is .T.), all rows are fetched implicitly before processing.
ru: Если набор был создан в режиме 'загрузка по требованию' (<![CDATA[<lNoFetch>]]>==.T.), то предварительно дозагружаются все оставшиеся записи.

source: This example creates two orders ('birthdate' and 'fullname'); shows rows ordered by birth date and full name, and seeks for a person whose name begins with 'Joh':
ru: В этом примере создаются два индекса ('birthdate' и 'fullname'); показываются записи отсортированные в порядке даты рождения и полного имени; ищется работник, чье имя начинается с 'Joh':

source: <command>Delete()</command> deletes the current row from the set.
ru: <command>Delete()</command> удаляет текущую строку из набора.

source: If row set was created with <![CDATA[<cDeleteSQL>]]> parameter, the latter is executed on the SQL server with the value of 'row id' field of the current record.
ru: Если конструктору набора был передан параметр <![CDATA[<cDeleteSQL>]]>, последний выполняется на SQL сервере со значением поля - идентификатора текущей записи.

source: <command>Delete()</command> decreases rows count returning by <link linkend="sqllastrec">TRowset:Lastrec()</link>.
ru: <command>Delete()</command> уменьшает количество строк в наборе, возвращаемое методом <link linkend="sqllastrec">TRowset:Lastrec()</link>.

source: If there is no controlling order the current row position remains the same, or moves to the last row (when deleted a row with Recno()==Lastrec()).
ru: Если нет управляющего индекса позиция указателя текущей строки не изменяется, или перемещается к последней строке (когда удаляется последняя физическая строка (Recno()==Lastrec()).

source: If there is controlling order (set using <link linkend="sqlsetorder">TRowset:SetOrder()</link>) the current row position moves to the row having the next key, or moves to the last logical row (when a row having biggest key value is deleted).
ru: Если есть управляющий индекс (установленный методом <link linkend="sqlsetorder">TRowset:SetOrder()</link>) указатель текущей строки перемещается к следующей логической строке, или перемещается к последней логической строке (когда удаляется строка с наибольшим значением ключа).

source: If the last remained row is deleted, both <link linkend="sqlbof">Bof()</link> and <link linkend="sqleof">Eof()</link> status are switched to true (.T.) and <link linkend="sqlrecno">TRowset:Recno()</link> returns zero (0).
ru: Если удаляется последняя оставшаяся строка, состояния <link linkend="sqlbof">Bof()</link> и <link linkend="sqleof">Eof()</link> устанавливаются в .T. и <link linkend="sqlrecno">TRowset:Recno()</link> возвращает 0.

source: When an application completes using the row set, it should release the set by calling <command>TRowset:Destroy()</command>.
ru: Когда приложению больше не требуется набор строк, оно должно освободить занимаемые ресурсы при помощи вызова метода-деструктора <command>TRowset:Destroy()</command>.

source: True (.T.) after an attempt to skip forward beyond the last logical row in the set; otherwise it returns false (.F.). If the set contains no rows it returns true (.T.).
ru: .T. после попытки переместиться в прямом направлении за последнюю логическую строку набора; в противном случае возвращается .F. Если набор не содержит ни одной строки возвращается .T.

source: <command>Eof()</command> is used to test for a boundary condition when you are moving the row pointer forward through a set using <link linkend="sqlskip">TRowset:Skip()</link> function.
ru: <command>Eof()</command> используется для проверки условия достижения границ набора при перемещении указателя в прямом направлении при помощи метода <link linkend="sqlskip">TRowset:Skip()</link>.

source: Once <command>Eof()</command> is set to true (.T.), it retains its value until there is another attempt to move the row pointer.
ru: После того, как функцией <command>Eof()</command> будет установлено значение .T., оно остается до тех пор, пока не будет сделана очередная попытка передвижения указателя записи.

source: TRowset:Skip() is the only row movement function that can set <command>Eof()</command> to true (.T.).
ru: <command>TRowset:Skip()</command> является единственной функцией, которая может установить значение <command>Eof()</command> == .T.

source: Unlike standard XBase's command <command>SKIP</command>, <link linkend="sqlskip">TRowset:Skip()</link> never moves beyond the last logical row. When <command>TRowset:Eof()</command> returns .T. the current row position is certainly the last logical row, not <command>Lastrec()</command>+1.
ru: В отличие от команды <command>SKIP</command>, использеумой в XBase, <link linkend="sqlskip">TRowset:Skip()</link> никогда не перемещает указатель за последнюю логическую строку. Когда <command>TRowset:Eof()</command> возвращает .T. указатель находится на последней логической строке, а не на <command>Lastrec()</command>+1.

source: The number of rows in the set.
ru: Количество строк в наборе.

source: <command>FetchAll()</command> fetches all unfetched rows. It is useful when row set has been created in 'fetch on demand' mode (<![CDATA[<lNoFetch>]]> parameter of <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> is .T.). If there is no unfetched rows <command>FetchAll()</command> has no effect.
ru: <command>FetchAll()</command> дозагружает оставшиеся записи в набор. Это бывает необходимо, когда набор был создан в режиме 'загрузка по требованию'. Если все записи уже загружены, <command>FetchAll()</command> ничего не делает.

source: Number of already fetched rows.
ru: Количество загруженных строк.

source: <command>Fetched()</command> is used to determine how much rows are fetched already. It is useful in <![CDATA[<bEval>]]> code block parameter of <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>, and when row set has been created in 'fetch on demand' mode.
ru: <command>Fetched()</command> используется для определения количества загруженных строк. Это бывает необходимо в блоке кода <![CDATA[<bEval>]]>, передаваемом конструктору набора <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>, и при создании набора в режиме 'загрузка по требованию'.

source: Print the number of already fetched rows during fetching process:
ru: Выводится количество загруженных строк в процессе загрузки:

source: Using <command>Fetched()</command> with row set created in 'fetch on demand' mode:
ru: Использование <command>Fetched()</command> с набором, созданным в режиме 'загрузка по требованию':

source: the position of the field in the list of fields
ru: позиция поля в списке полей

source: the name of the field
ru: имя поля

source: True (.T.) if the given field is binary; false (.F.) otherwise.
ru: .T. если поле бинарное, .F. в противном случае.

source: <command>FieldBinary()</command> is used to determine if a character field is binary. Charset transformations don't take place with the values of binary field.
ru: <command>FieldBinary()</command> используется для определения, является ли поле бинарным. Бинарные поля не подвергаются перекодировкам.

source: A code block that, when evaluated, sets (assigns) or gets (retrieves) the value of the given field.
ru: Блок кода, устанавливающий или получающий значение поля.

source: <command>FieldBlock()</command> builds a set/get code block for a given field. When executed with an argument, the code block created by this function assigns the value of the argument to a given field. When executed without an argument, the code block retrieves the value of a given field.
ru: <command>FieldBlock()</command> строит блок кода для доступа к заданному полю. Если блоку передается параметр, значение поля устанавливается значением этого параметра. Если блоку не передается параметров, то он возвращает значение поля.

source: Change the set using that code block does not cause immediate execution of <![CDATA[<cUpdateSQL>]]> (parameter passed to <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>). <link linkend="sqlwrite">Write()</link> and all row movement functions (<link linkend="sqlgotop">Gotop()</link>, <link linkend="sqlgobottom">Gobottom()</link>, <link linkend="sqlgoto">Goto()</link> and <link linkend="sqlskip">Skip()</link>) are only functions that initiate reflection the change on the SQL server.
ru: Изменение набора с использованием этого блока кода не вызывает незамедлительного выполнения <![CDATA[<cUpdateSQL>]]> (параметра конструктора набора <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>). Выполнение <![CDATA[<cUpdateSQL>]]> на сервере инициируется лишь методом <link linkend="sqlwrite">Write()</link>, а также всеми методами, перемещающими указатель (<link linkend="sqlgotop">Gotop()</link><link linkend="sqlgobottom">Gobottom()</link><link linkend="sqlgoto">Goto()</link> и <link linkend="sqlskip">Skip()</link>).

source: A number of decimal digits used in a given numeric field.
ru: Количество знаков после запятой для заданного поля.

source: <command>FieldDec()</command> is used to determine the number of decimal digits in a given field.
ru: <command>FieldDec()</command> используется для определения количества десятичных знаков после запятой, используемых в заданном поле.

source: A length of the field (in terms of used RDBMS).
ru: Длина поля (в терминах используемой СУБД).

source: <command>FieldLen()</command> is used to determine the length of a given field, in terms of used RDBMS. For example, the length of a field of type 'FLOAT' is 4.
ru: <command>FieldLen()</command> используется для определения длины заданного поля, в терминах используемой СУБД. Например, длина поля типа 'FLOAT' равна 4.

source: The name of field.
ru: Имя поля.

source: <command>FieldName()</command> is used to determine the name of a field with a given position.
ru: <command>FieldName()</command> используется для определения имени поля с заданной позицией.

source: the name of field
ru: имя поля

source: The position of the field.
ru: Позиция поля.

source: <command>FieldNo()</command> is used to determine the position of a field with a given name.
ru: <command>FieldNo()</command> используется для определения позиции поля с заданным именем.

source: True (.T.) if the given field is nullable; false (.F.) otherwise (NOT NULL).
ru: .T. если поле может принимать значения NULL; .F. - в противном случае (поле NOT NULL).

source: <command>FieldNullable()</command> is used to determine if a field is nullable, i.e. not 'NOT NULL'.
ru: <command>FieldNullable()</command> используется для определения, может ли поле принимать значения NULL.

source: Type of a field (in terms of XBase).
ru: Код, определяющий тип поля (XBase).

source: <command>FieldType()</command> is used to determine the type of a given field. It returns a single character that designates the data type of the data field. <command>FieldType()</command> returns the following characters for the various data field types:
ru: <command>FieldType()</command> используется для определения типа поля. Функция возвращает один символ, определяющий тип данных. Возвращается один из следующих символов:

source: <emphasis>C</emphasis> - character string
ru: <emphasis>C</emphasis> - строка символов

source: <emphasis>N</emphasis> - numeric
ru: <emphasis>N</emphasis> - число

source: <emphasis>D</emphasis> - date
ru: <emphasis>D</emphasis> - дата

source: <emphasis>T</emphasis> - datetime
ru: <emphasis>T</emphasis> - дата и время

source: <emphasis>L</emphasis> - logical
ru: <emphasis>L</emphasis> - логическое значение

source: Numeric type of a field (in terms of used RDBMS).
ru: Код, определяющий тип поля (в терминах используемой СУБД).

source: <command>FieldTypeSQL()</command> is used to determine the type of a given field, in terms of used RDBMS. Specific RDBMS types are defined in corresponding *.ch files.
ru: <command>FieldTypeSQL</command> используется для определения типа поля, в терминах используемой СУБД. Типы данных конкретных СУБД определены в соответствующих заголовочных *.ch файлах, включенных в состав пакетов.

source: True (.T.) if the given field is unsigned; false (.F.) otherwise.
ru: .T. если поле беззнаковое; .F. - в противном случае.

source: <command>FieldUnsigned()</command> is used to determine if a numeric field is unsigned.
ru: <command>FieldUnsigned()</command> используется для определения, является ли поле беззнаковым.

source: A value of current row's field.
ru: Значение поля текущей строки.

source: <command>GetValue()</command> is used to retrieve the value of a field in the current row.
ru: <command>GetValue()</command> используется для определения значения заданного поля текущей строки.

source: <command>GoBottom()</command> moves the row position to the last logical row.
ru: <command>GoBottom()</command> перемещает указатель к последней логической строке.

source: If the row set was created in 'fetch on demand' mode (<![CDATA[<lNoFetch>]]> parameter of <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> is .T.), all unfetched rows are fetched before processing.
ru: Если набор был создан в режиме 'загрузка по требованию' (<![CDATA[<lNoFetch>]]>==.T.), то предварительно дозагружаются все оставшиеся записи.

source: the position to move to
ru: номер строки

source: New position of current row.
ru: Новый номер текущей строки.

source: <command>Goto()</command> is used to move to the specified physical row position. If controlling order is not physical (set by <link linkend="sqlsetorder">TRowset:SetOrder()</link>), physical position can be different from logical position.
ru: <command>Goto()</command> используется для перемещения к строке с заданным номером.

source: If <![CDATA[<nRowPosition>]]> is less than 1, <command>Goto()</command> moves to the first physical row, and <link linkend="sqlbof">Bof()</link> state is set to true (.T.). If <![CDATA[<nRowPosition>]]> is larger than <link linkend="sqllastrec">Lastrec()</link>, <command>Goto()</command> moves to the last physical row, and <link linkend="sqleof">Eof()</link> state is set to true (.T.).
ru: Если <![CDATA[<nRowPosition>]]> меньше 1, <command>Goto()</command> перемещает указатель к строке с номером 1 и состояние <link linkend="sqlbof">Bof()</link> устанавливается в .T. Если <![CDATA[<nRowPosition>]]> больше, чем <link linkend="sqllastrec">Lastrec()</link>, <command>Goto()</command> перемещает указатель к последней физической строке, и состояние <link linkend="sqleof">Eof()</link> устанавливается в .T.

source: <command>GoTop()</command> moves the row position to the first logical row.
ru: <command>GoTop()</command> перемещает указатель к первой логической строке.

source: The logical position of the current row.
ru: Логический номер текущей строки.

source: <command>KeyNo()</command> is used to determine the logical number of the current row. If there is no controlling order (created by <link linkend="sqlcreateorder">TRowset:CreateOrder()</link> and set by <link linkend="sqlsetorder">TRowset:SetOrder()</link>), <command>KeyNo()</command> returns the physical row position, i.e. it works just like <link linkend="sqlrecno">TRowset:Recno()</link>.
ru: <command>KeyNo()</command> используется для определения логического номера текущей строки. Если нет управляющего индекса (созданного методом <link linkend="sqlcreateorder">TRowset:CreateOrder()</link> и установленного управляемым методом <link linkend="sqlsetorder">TRowset:SetOrder()</link>), <command>KeyNo()</command> возвращает физический номер строки, то есть имеет тот же эффект, что и метод <link linkend="sqlrecno">TRowset:Recno()</link>.

source: <command>Lastrec()</command> determines the number of rows in the set.
ru: <command>Lastrec()</command> возвращает количество строк в наборе.

source: If the row set was created in 'fetch on demand' mode (<![CDATA[<lNoFetch>]]> parameter of <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> is .T.), <command>Lastrec()</command> can return 0 (if there remain unfetched rows). The number of fetched rows can be determined using <link linkend="sqlfetched">TRowset:Fetched()</link> function. <link linkend="sqlfetchall">TRowset:FetchAll()</link> can be used to fetch the remainder of unfetched rows. After that, <command>Lastrec()</command> will return actual number of rows.
ru: Если набор был создан в режиме 'загрузка по требованию' (параметр <![CDATA[<lNoFetch>]]> конструктора <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> - .T.), <command>Lastrec()</command> может возвращать 0 (когда загружены не все записи). Количество загруженных строк можно определить с помощью метода <link linkend="sqlfetched">TRowset:Fetched()</link>. Для дозагрузки оставшихся записей можно использовать метод <link linkend="sqlfetchall">TRowset:FetchAll()</link>. После этого <command>Lastrec()</command>, будет возвращать действительноеколичество строк в наборе.

source: The number of fields in the row set.
ru: Количество полей в наборе.

source: <command>NFields()</command> determines the number of fields in the row set.
ru: <command>NFields()</command> используется для определения количества полей в строках набора.

source: An object containing all fields of current row.
ru: Объект, содержащий все поля текущей строки.

source: <command>Read()</command> retrieves the current row values into an object.
ru: <command>Read()</command> получает значения всех полей текущей строки и помещает их в одноименные атрибуты возвращаемого объекта.

source: The physical position of the current row.
ru: Физический номер текущей строки.

source: <command>Recno()</command> used to determine the physical position of the current row. If there are no rows in the set, it returns 0.
ru: <command>Recno()</command> используется для определения физического номера текущей строки. Если в наборе не ни одной строки, возвращается 0.

source: <command>RefreshAll()</command> refreshes the row set by repeatedly executing <![CDATA[<cSelectSQL>]]> passed to the TRowset constructor <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> with SQL parameters passed in <![CDATA[<aParameters>]]>. The physical row position remains the same, or moves to the last physical row.
ru: <command>RefreshAll()</command> обновляет набор строк путем повторного выполнения <![CDATA[<cSelectSQL>]]>, переданного конструктору класса TRowset (<link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>), с использованием параметров SQL, переданных в <![CDATA[<aParameters>]]>. Указатель остается на строке с тем же физическим номером, или перемещается к последней физической строке.

source: <command>RefreshCurrent()</command> refreshes the current row of the set by executing <![CDATA[<cRefreshSQL>]]> passed to the TRowset constructor <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>. If <![CDATA[<cRefreshSQL>]]> not passed, <command>RefreshCurrent()</command> has no effect.
ru: <command>RefreshCurrent()</command> обновляет текущую строку набора путем выполнения <![CDATA[<cRefreshSQL>]]>, переданного конструктору <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>. Если <![CDATA[<cRefreshSQL>]]> - NIL, <command>RefreshCurrent()</command> ничего не делает.

source: a value of the key associated with the desired row
ru: значение ключа искомой строки

source: logical value that specifies whether a soft seek is to be performed. This determines how the work area is positioned if the specified key value is not found (see below)
ru: логическое значение определяющее режим относительного поиска. Это определяет, куда будет установлен указатель, если строка с заданным ключом не найдена (см. ниже)

source: True (.T.) if the specified key value was found; otherwise, false (.F.).
ru: .T. если строка с заданным ключом найдена; .F. - в противном случае

source: <command>Seek()</command> moves to the first logical row whose key value is equal to <![CDATA[<xKeyValue>]]>. If such row is found, it becomes the current row and <command>Seek()</command> returns true (.T.); otherwise, it returns false (.F.). For a normal (not soft) seek, the row set is positioned to the last logical row and <link linkend="sqleof">TRowset:Eof()</link> returns true (.T.); for a soft seek, the row set is positioned to the first row whose key value is greater than the specified key value. If no such row exists, the row set is positioned to the last logical row and <command>TRowset:Eof()</command> returns true (.T.).
ru: <command>Seek()</command> ищет первую логическую строку с ключом, равным <![CDATA[<xKeyValue>]]>. Если такая строка найдена, она становится текущей и <command>Seek()</command> возвращает .T.; иначе возвращается .F. и указатель перемещается следующим образом: при нормальном (не относительным) поиске указатель перемещается к последней логической строке и <link linkend="sqleof">TRowset:Eof()</link> возвращает .T.; при относительном поиске указатель перемещается к первой строке, ключевое значение которой больше чем заданное. Если такой строки не существует, указатель перемещается к последней логической строке и <command>TRowset:Eof()</command> возвращает .T.
