Repository: amery/clip-angelo
Catalog: doc/po/doc/sql.sgml/*.po
Languages: ru

source: For a row set with no controlling order (created by <link linkend="sqlcreateorder">TRowset:CreateOrder()</link> and prescribed controlling by <link linkend="sqlsetorder">TRowset:SetOrder()</link>), <command>Seek()</command> has no effect.
ru: Если нет управляющего индекса (созданного при помощи метода <link linkend="sqlcreateorder">TRowset:CreateOrder()</link> и установленного управляющим при помощи метода <link linkend="sqlsetorder">TRowset:SetOrder()</link>),<command>Seek()</command> ничего не делает.

source: the name of the order to be set controlling
ru: имя индекса, который должен стать управляющим

source: The name of previously controlling order or NIL (physical order).
ru: Имя текущего управляющего индекса или NIL (если нет управляющего индекса).

source: <command>SetOrder()</command> activates an order created by <link linkend="sqlcreateorder">TRowset:CreateOrder()</link> (makes it controlling). It returns the name of previously controlling order.
ru: <command>SetOrder()</command> устанавливает индекс, созданный методом <link linkend="sqlcreateorder">TRowset:CreateOrder()</link>, управляющим. Возвращается имя ранее управляющего индекса.

source: If passed an empty string, <command>SetOrder()</command> causes the row set to be accessed in physical (<link linkend="sqlrecno">TRowset:Recno()</link>) order.
ru: Если передана пустая строка, <command>SetOrder()</command> снимает управляющий индекс, и доступ к строкам набора осуществляется в физическом порядке.

source: the value to be assigned to the field
ru: новое значение поля

source: <command>SetValue()</command> assignes <![CDATA[<xValue>]]> to the field in the current row.
ru: <command>SetValue()</command> присвает значение <![CDATA[<xValue>]]> заданному полю текущей строки.

source: Unlike <link linkend="sqlwrite">TRowset:Write()</link> function, <command>SetValue()</command> does not cause immediate reflection the change on the SQL server. One of the row movement functions must arise to cause reflection (executing <![CDATA[<cUpdateSQL>]]> statement, passed to the TRowset constructor <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>).
ru: В отличие от метода <link linkend="sqlwrite">TRowset:Write()</link> <command>SetValue()</command> не инициирует немедленного отражения изменения на SQL сервере (выполнения оператора <![CDATA[<cUpdateSQL>]]>, переданного конструктору класса TRowset <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>). Отражение производится при первом же вызове метода, перемещающего указатель.

source: the number of logical rows to move, relatively to the current row. A positive value means to skip forward, and a negative value means to skip backward. If omitted, a value of 1 is assumed
ru: количество логических строк, на которое должен переместиться указатель относительно текущей строки. Положительное значение означает перемещение в прямом направлении, отрицательное - в обратном. По умолчанию 1

source: Actual number of rows skipped.
ru: Действительное число строк, на которое переместился указатель.

source: <command>Skip()</command> moves either forward or backward relatively to the current row. Attempting to skip forward beyond the last logical row positions the row set to the last logical row and <link linkend="sqleof">TRowset:Eof()</link> returns true (.T.). Attempting to skip backward beyond the first logical row positions the row set to the first logical row and <link linkend="sqlbof">TRowset:Bof()</link> returns true (.T.).
ru: <command>Skip()</command> перемещает указатель в прямом или обратном направлении относительно текущей строки. При попытке переместить указатель в прямом направлении за последнюю логическую строку, указатель становится на последнюю логическую строку и <link linkend="sqleof">TRowset:Eof()</link> возвращает .T. При попытке переместить указатель в обратном направлении за первую логичускую строку, указатель становится на первую логическую строку и <link linkend="sqlbof">TRowset:Bof()</link> возвращает .T.

source: an object containing new field values
ru: объект, содержащий новые значения полей

source: <command>Write()</command> assigns new values to the current row's fields. It tries then to reflect the changes on the SQL server by executing <![CDATA[<cUpdateSQL>]]> statement passed to the TRowset constructor <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>.
ru: <command>Write()</command> присваивает новые значения полям текущей строки. Производится попытка отразить изменения на SQL сервере путем выполнения оператора <![CDATA[<cUpdateSQL>]]>, переданного конструктору класса TRowset <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>.

source: RDBMS specific
ru: Особенности СУБД

source: Peculiarities of using particular RDBMS with CLIP are described below.
ru: Ниже описываются особенности использования различных СУБД с CLIP.

source: To be able to build an application using MySQL data base, appropriate packages must be installed. It includes MySQL development files and <command>clip-mysql</command> package. See <link linkend="installation">Installation</link> chapter for details.
ru: Для построения приложения использующего базу данных MySQL должны быть установлены соответствующие пакеты. Это пакет разработчика MySQL и пакет <command>clip-mysql</command>. См. подробности в главе <link linkend="installation">Установка CLIP</link>.

source: Link your application with MySQL driver by adding <command>-lclip-mysql</command> to the end of <command>clip</command> command:
ru: Чтобы скомпоновать приложение с драйвером MySQL необходимо добавить <command>-lclip-mysql</command> в конец команды компиляции <command>clip</command>:

source: ConnectNew() syntax
ru: Синтаксис ConnectNew()

source: To obtain a connect to the MySQL server use <link linkend="sqlconnectnew">ConnectNew()</link> with the following syntax:
ru: Для подключения к серверу MySQL используется следующий синтаксис <link linkend="sqlconnectnew">ConnectNew()</link>:

source: where
ru: где

source: "MS" - identifier of MySQL driver; see also <link linkend="sqlsqllist">SQLList()</link>
ru: "MS" - идентификатор драйвера MySQL; см. также описание функции <link linkend="sqlsqllist">SQLList()</link>

source: cHost - a string containing the name of the host MySQL server is running on
ru: cHost - строка, содержащая имя хоста сервера MySQL

source: cPort - server port number as string
ru: cPort - номер порта сервера в виде строки

source: cLogin - a string containing user login
ru: cLogin - строка, содержащая логин пользователя

source: cPassword - a string containing user's password
ru: cPassword - строка, содержащая пароль пользователя

source: cDB - a string containing the name of the database to be used
ru: cDB - строка, содержащая имя базы данных

source: cSocket - a string containing UNIX socket or pipe name to be used as transport
ru: cSocket - строка, содержащая имя UNIX socket или pipe, используемого в качестве транспорта

source: cFlags - flags to be used with this connection as string; see MySQL manual for details
ru: cFlags - флаги соединения в виде строки; см. руководство по MySQL

source: cCharset - charset used by server; if not passed, SET("SQL_CHARSET") is used
ru: cCharset - кодировка, используемая сервером; если NIL, используется SET("SQL_CHARSET")

source: cIsolation - a string containing the name of isolation level to be used by default (see MySQL manual for details); if not passed, SET("MS_ISOLATION_LEVEL") value is used; possible values:
ru: cIsolation - строка, содержащая имя уровня изоляции, используемого по умолчанию (см. подробности в руководстве по MySQL); если NIL, используется SET("MS_ISOLATION_LEVEL"); возможны следующие значения:

source: the same values are possible for <![CDATA[<cIsolation>]]> parameter of <link linkend="sqlstart">TRowset:Start()</link>.
ru: эти же значения могут использоваться в качестве значений параметра <![CDATA[<cIsolation>]]> метода <link linkend="sqlstart">TRowset:Start()</link>.

source: Rows binding
ru: Идентификация строк

source: To bind rows in the data base and rows in the local set a field with AUTO_INCREMENT clause is used (see description of CREATE TABLE statement in the MySQL manual). See also <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> description for details.
ru: Для связывания строк набора и записей базы данных используется поле AUTO_INCREMENT (см. описание оператора CREATE TABLE в руководстве по MySQL). См. также описание конструктора TRowset <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>.

source: Implemented data types
ru: Реализованные типы данных

source: The following table shows implemented MySQL data types and their XBase equivalents.
ru: В следующей таблице представлены реализованные типы данных MySQL и их XBase-эквиваленты.

source: Implemented MySQL data types
ru: Реализованные типы данных MySQL

source: MySQL data type
ru: Тип данных MySQL

source: CLIP data type
ru: Тип данных CLIP

source: To be able to build an application using PostgreSQL data base, appropriate packages must be installed. It includes PostgreSQL development files and <command>clip-postgres</command> package. See <link linkend="installation">Installation</link> chapter for details.
ru: Для построения приложения использующего базу данных PostgreSQL должны быть установлены соответствующие пакеты. Это пакет разработчика PostgreSQL и пакет <command>clip-postgres</command>. См. подробности в главе <link linkend="installation">Установка CLIP</link>.

source: Link your application with PostgreSQL driver by adding <command>-lclip-postgres</command> to the end of <command>clip</command> command:
ru: Чтобы скомпоновать приложение с драйвером PostgreSQL необходимо добавить <command>-lclip-postgres</command> в конец команды компиляции <command>clip</command>:

source: To obtain a connect to the PostgreSQL server use <link linkend="sqlconnectnew">ConnectNew()</link> with the following syntax:
ru: Для подключения к серверу PostgreSQL используется следующий синтаксис <link linkend="sqlconnectnew">ConnectNew()</link>:

source: "PG" - identifier of PostgreSQL driver; see also <link linkend="sqlsqllist">SQLList()</link>
ru: "PG" - идентификатор драйвера PostgreSQL; см. также описание функции <link linkend="sqlsqllist">SQLList()</link>

source: cHost - a string containing the name of the host PostgreSQL server is running on
ru: cHost - строка, содержащая имя хоста сервера PostgreSQL

source: cTTY - the name of debug tty
ru: cTTY - терминал для вывода отладочной информации

source: cOptions - optional parameters of the connection; see PostgreSQL manual for details
ru: cOptions - дополнительные параметры соединения; см. руководство по PostgreSQL

source: cIsolation - a string containing the name of isolation level to be used by default (see PostgreSQL manual for details); if not passed, SET("PG_ISOLATION_LEVEL") value is used; possible values:
ru: cIsolation - строка, содержащая имя уровня изоляции, используемого по умолчанию (см. подробности в руководстве по PostgreSQL); если NIL, используется SET("PG_ISOLATION_LEVEL"); возможны следующие значения:

source: To bind rows in the data base and rows in the local set a <command>oid</command> field is used. See <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> description and PostgreSQL manual for details.
ru: Для связывания строк набора и записей базы данных используется поле <command>oid</command>. См. руководство по PostgreSQL и описание конструктора TRowset <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>.

source: The following table shows implemented PostgreSQL data types and their XBase equivalents.
ru: В следующей таблице представлены реализованные типы данных PostgreSQL и их XBase-эквиваленты.

source: Implemented PostgreSQL data types
ru: Реализованные типы данных PostgreSQL

source: PostgreSQL data type
ru: Тип данных PostgreSQL

source: To be able to build an application using Oracle data base, appropriate packages must be installed. It includes Oracle development files and <command>clip-oracle</command> package. See <link linkend="installation">Installation</link> chapter for details.
ru: Для построения приложения использующего базу данных Oracle должны быть установлены соответствующие пакеты. Это файлы разработчика Oracle и пакет <command>clip-oracle</command>. См. подробности в главе <link linkend="installation">Установка CLIP</link>.

source: Link your application with Oracle driver by adding <command>-lclip-oracle</command> to the end of <command>clip</command> command:
ru: Чтобы скомпоновать приложение с драйвером Oracle необходимо добавить <command>-lclip-oracle</command> в конец команды компиляции <command>clip</command>:

source: To obtain a connect to the Oracle server use <link linkend="sqlconnectnew">ConnectNew()</link> with the following syntax:
ru: Для подключения к серверу Oracle используется следующий синтаксис <link linkend="sqlconnectnew">ConnectNew()</link>:

source: "OR" - identifier of Oracle driver; see also <link linkend="sqlsqllist">SQLList()</link>
ru: "OR" - идентификатор драйвера Oracle; см. также описание функции <link linkend="sqlsqllist">SQLList()</link>

source: cDB - a string containing the name of the database to be used (connect string)
ru: cDB - строка, содержащая имя базы данных (connect string)

source: cIsolation - a string containing the name of isolation level to be used by default (see Oracle manual for details); if not passed, SET("OR_ISOLATION_LEVEL") value is used; values containing one or more of the following strings divided by ';' are possible:
ru: cIsolation - строка, содержащая имя уровня изоляции, используемого по умолчанию (см. подробности в руководстве по Oracle); если NIL, используется SET("OR_ISOLATION_LEVEL"); возможны следующие значения:

source: To bind rows in the data base and rows in the local set a <command>rowid</command> field is used (see Oracle manual). See also <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> description for details.
ru: Для связывания строк набора и записей базы данных используется поле <command>rowid</command> (см. руководство по Oracle). См. также описание конструктора TRowset <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> .

source: Other peculiarities
ru: Другие особенности

source: An array with SQL parameters (used in <![CDATA[<aParameters>]]> parameter of <link linkend="sqlcommand">TConnect:Command()</link> and <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> functions) must have third element (SQL data type) in each row with Oracle. Data types are defined in <command>oracle.ch</command> include file. For example:
ru: Массив параметров SQL (используемый в качестве значения параметра <![CDATA[<aParameters>]]> методов <link linkend="sqlcommand">TConnect:Command()</link> и<link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>) должен содержать третий элемент (тип данных Oracle) в каждой строке. Типы данных Oracle определены в файле <command>oracle.ch</command>. Например:

source: INSERT statement passed in <![CDATA[<cInsertSQL>]]> parameter to TRowset constructor <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> must have <command>RETURNING rowid</command> clause. For example:
ru: Оператор INSERT, содержащийся в параметре <![CDATA[<cInsertSQL>]]> конструктора TRowset <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>, должен содержать предложение <command>RETURNING rowid</command>. Например:

source: The following table shows implemented Oracle data types and their XBase equivalents.
ru: В следующей таблице представлены реализованные типы данных Oracle и их XBase-эквиваленты.

source: Implemented Oracle data types
ru: Реализованные типы данных Oracle

source: Oracle data type
ru: Тип данных Oracle

source: To be able to build an application using Interbase data base, appropriate packages must be installed. It includes Interbase development files and <command>clip-interbase</command> package. See <link linkend="installation">Installation</link> chapter for details.
ru: Для построения приложения использующего базу данных Interbase должны быть установлены соответствующие пакеты. Это файлы разработчика Interbase и пакет <command>clip-interbase</command>. См. подробности в главе <link linkend="installation">Установка CLIP</link>.

source: Link your application with Interbase driver by adding <command>-lclip-interbase</command> to the end of <command>clip</command> command:
ru: Чтобы скомпоновать приложение с драйвером Interbase необходимо добавить <command>-lclip-interbase</command> в конец команды компиляции <command>clip</command>:

source: To obtain a connect to the Interbase server use <link linkend="sqlconnectnew">ConnectNew()</link> with the following syntax:
ru: Для подключения к серверу Interbase используется следующий синтаксис <link linkend="sqlconnectnew">ConnectNew()</link>:

source: "IB" - identifier of Interbase driver; see also <link linkend="sqlsqllist">SQLList()</link>
ru: "IB" - идентификатор драйвера Interbase; см. также описание функции <link linkend="sqlsqllist">SQLList()</link>

source: cDB - a string containing the name of the database to be used (the file name)
ru: cDB - строка, содержащая имя базы данных (имя файла)

source: cIsolation - a string containing the name of isolation level to be used by default (see Interbase manual for details); if not passed, SET("IB_ISOLATION_LEVEL") value is used; values containing one or more of the following strings divided by ';' are possible:
ru: cIsolation - строка, содержащая имя уровня изоляции, используемого по умолчанию (см. подробности в руководстве по Interbase); если NIL, используется SET("IB_ISOLATION_LEVEL"); возможны следующие значения:

source: To bind rows in the data base and rows in the local set a field with the name passed in <![CDATA[<cIdName>]]> parameter to TRowset constructor is used. See <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link> description for details.
ru: Для связывания строк набора и записей базы данных используется поле, чье имя передается конструктору TRowset в параметре <![CDATA[<cIdName>]]>. См. описание <link linkend="sqlcreaterowset">TConnect:CreateRowset()</link>.

source: With Interbase, <link linkend="sqlstart">TConnect:Start()</link> may receive the second parameter <![CDATA[<cLockTables>]]> describing what tables and how they should be locked during transaction. The string being contained in <![CDATA[<cLockTables>]]> should have the following form:
ru: При использовании драйвера Interbase метод <link linkend="sqlstart">TConnect:Start()</link> может получать второй параметр <![CDATA[<cLockTables>]]>, в котором описывается какие таблицы и как должны быть заблокированы на время транзакции. Строка, содержащаяся в <![CDATA[<cLockTables>]]> должна иметь следующий формат:

source: where <![CDATA[<table_name>]]> - the name of the table to be locked; <![CDATA[<lock_type>]]> - lock type; the following types are possible:
ru: где <![CDATA[<table_name>]]> - имя таблицы; <![CDATA[<lock_type>]]> - тип блокировки; возможны следующие значения:

source: See Interbase manual for details.
ru: См. подробности в руководстве по Interbase.

source: The following table shows implemented Interbase data types and their XBase equivalents.
ru: В следующей таблице представлены реализованные типы данных Interbase и их XBase-эквиваленты.

source: Implemented Interbase data types
ru: Реализованные типы данных Interbase

source: Interbase data type
ru: Тип данных Interbase

source: To be able to build an application using ODBC manager, appropriate packages must be installed. It includes ODBC development files (iODBC2 or unixodbc) and <command>clip-odbc</command> package. See <link linkend="installation">Installation</link> chapter for details.
ru: Для построения приложения использующего ODBC должны быть установлены соответствующие пакеты. Это пакет разработчика ODBC (iODBC2 или unixodbc) и пакет <command>clip-odbc</command>. См. подробности в главе <link linkend="installation">Установка CLIP</link>.

source: Link your application with ODBC driver by adding <command>-lclip-odbc</command> to the end of <command>clip</command> command:
ru: Чтобы скомпоновать приложение с драйвером ODBC необходимо добавить <command>-lclip-odbc</command> в конец команды компиляции <command>clip</command>:

source: To obtain a connect to the database server through ODBC manager use <link linkend="sqlconnectnew">ConnectNew()</link> with the following syntax:
ru: Для подключения к базе данных через ODBC используется следующий синтаксис <link linkend="sqlconnectnew">ConnectNew()</link>:

source: "ODBC" - identifier of ODBC driver; see also <link linkend="sqlsqllist">SQLList()</link>
ru: "ODBC" - идентификатор драйвера ODBC; см. также описание функции <link linkend="sqlsqllist">SQLList()</link>

source: cDSN - a string containing Data Source Name (see ODBC manual and odbc.ini)
ru: cDSN - строка, содержащая имя источника данных (см. руководство по ODBC и файл odbc.ini)

source: With ODBC you have to set appropriate transactions isolation level manually. <link linkend="sqlstart">TConnect:Start()</link> ignores passed parameters.
ru: При использовании ODBC нужный уровень изоляции должен устанавливаться вручную. Параметры метода <link linkend="sqlstart">TConnect:Start()</link> игнорируются.

source: The following table shows implemented ODBC data types and their XBase equivalents.
ru: В следующей таблице представлены реализованные типы данных ODBCи их XBase-эквиваленты.

source: Implemented ODBC data types
ru: Реализованные типы данных ODBC

source: ODBC data type
ru: Тип данных ODBC

source: To be able to build an application using DBTCP proxy, appropriate packages must be installed. It includes DBTCP development files and <command>clip-dbtcp</command> package. See <link linkend="installation">Installation</link> chapter for details.
ru: Для построения приложения использующего DBTCP должны быть установлены соответствующие пакеты. Это пакет разработчика DBTCP и пакет <command>clip-dbtcp</command>. См. подробности в главе <link linkend="installation">Установка CLIP</link>.

source: Link your application with DBTCP driver by adding <command>-lclip-dbtcp</command> to the end of <command>clip</command> command:
ru: Чтобы скомпоновать приложение с драйвером DBTCP необходимо добавить <command>-lclip-dbtcp</command> в конец команды компиляции <command>clip</command>:

source: To obtain a connect to the database server through DBTCP proxy use <link linkend="sqlconnectnew">ConnectNew()</link> with the following syntax:
ru: Для подключения к базе данных через DBTCP используется следующий синтаксис <link linkend="sqlconnectnew">ConnectNew()</link>:

source: "DBTCP" - identifier of DBTCP driver; see also <link linkend="sqlsqllist">SQLList()</link>
ru: "DBTCP" - идентификатор драйвера DBTCP; см. также описание функции <link linkend="sqlsqllist">SQLList()</link>

source: cHost - host name DBTCP server running on
ru: cHost - строка, содержащая имя хоста на котором работает сервер DBTCP

source: cDSN - a string containing Data Source Name
ru: cDSN - строка, содержащая имя источника данных

source: With DBTCP you have to set appropriate transactions isolation level manually. <link linkend="sqlstart">TConnect:Start()</link> ignores passed parameters.
ru: При использовании DBTCP нужный уровень изоляции должен устанавливаться вручную. Параметры метода <link linkend="sqlstart">TConnect:Start()</link> игнорируются.
