Repository: amery/clip-angelo
Catalog: doc/po/doc/compiler.sgml/*.po
Languages: ru

source: Compiler
ru: Компилятор

source: CLIP compiler (<command>clip</command>) is used to:
ru: Компилятор CLIP (<command>clip</command>) может использоваться для:

source: compile one or more source files (.prg) to an object file form (.o);
ru: компилирования одного или нескольких исходных файлов (.prg) в форму объектного файла (.o);

source: compile one or more source files (.prg) to a P-code (pseudocode) module form (.po);
ru: компилирования одного или нескольких исходных файлов (.prg) в P-code (псевдокод) модуль (.po);

source: link one or more source files (.prg), object files (.o), static libraries (.a), dynamic libraries (.so) or a P-code modules (.po) to an executable file form.
ru: компоновки одного или нескольких исходных файдлв (.prg), объектных файлов (.o), статических библиотек (.a), динамических библиотек (.so) или P-code модулей в исполняемый файл.

source: Usage
ru: Использование

source: where
ru: где

source: <![CDATA[<CLIP compiler options>]]> is a list of one or more options to control the course of the compilation and/or linking, all of which are described below;
ru: <![CDATA[<CLIP compiler options>]]> список опций, определяющих режим процесса компиляции и/или компоновки. Все они рассматриваются ниже;

source: <![CDATA[<filelist>]]> is a space separated list of source, object, library files to compile or link. All file names must be written with suffices, no assumtions about file type are made;
ru: <![CDATA[<filelist>]]> список исходных, объектных файлов и библиотек, которые необходимо скомпилировать или скомпоновать. Все имена файлов должны быть написаны с суффиксами. Никаких предположений о типах файлов без суффиксов не делается;

source: <![CDATA[<C compiler options>]]> are passed to the C compiler.
ru: <![CDATA[<C compiler options>]]> - список опций, передаваемых компилятору C.

source: Options
ru: Опции

source: Any of the CLIP compiler options described below can be placed in the <command>.cliprc</command> file in the current directory; or in the <command>$HOME/.cliprc</command> file; or in any file in the <command>$CLIPROOT/cliprc</command> directory. For example, you could create a file <command>.cliprc</command> in your home directory with the following content:
ru: Любые из нижеописываемых опций компилятора CLIP могут быть помещены в файл <command>.cliprc</command> в текущей директории; или в файл <command>$HOME/.cliprc</command>; или в любой файл в директории <command>$CLIPROOT/cliprc</command>. Например, вы можете создать файл <command>.cliprc</command> следующего содержания в домашней директории:

source: It results in compiling with <command>-r -l -Scp866</command> options, even if you don't specify them explicitly.
ru: В результате, каждая проводимая вами компиляция будет использовать опции <command>-r -l -Scp866</command>, даже если вы не укажете их явно.

source: The list of options follows.
ru: Ниже следует список опций компилятора CLIP.

source: display a short usage help and exit
ru: показать короткую справку об использовании и выйти

source: display a short help about acceptable environment variables and exit; see more detailed information in the chapter <link linkend="envir">Environment variables</link>
ru: показать короткую справку об используемых переменных окружения и выйти; см. подробности в главе <link linkend="envir">Переменные окружения</link>

source: display CLIP compiler version and exit
ru: показать версию компилятора CLIP и выйти

source: set/increase verbose level; possible values of <![CDATA[<level>]]> are from 0 (silent) to 6 (most verbose); default is 1
ru: установить/увеличить уровень детализации выводимой информации; возможные значения <![CDATA[<level>]]> - от 0 (без вывода) до 6 (наиболее подробная детализация); по умолчанию - 1

source: declare any variable included in a PRIVATE, PUBLIC, or PARAMETERS statement as MEMVAR
ru: любая переменная, включенная в операторы PUBLIC, PRIVATE илиPARAMETERS автоматически объявляется как MEMVAR

source: generate warning messages for undeclared or unaliased (ambiguous) variable references
ru: генерировать предупреждающие сообщения об использовании необъявленных переменных или полей

source: generate executable file
ru: сгенерировать исполняемый файл

source: stop after generation C code
ru: остановиться после генерации C кода

source: include debugging information in the object file
ru: включить отладочную информацию в объектный файл

source: print generated program syntax tree
ru: вывести дерево синтаксиса программы

source: place executable in file <![CDATA[<name>]]>
ru: задать имя исполняемого файла

source: define the location of the output object files
ru: поместить сгенерированные объектные файлы в заданную директорию

source: set optimisation level for C compiler
ru: задать уровень оптимизации для компилятора C

source: use the code of the first file in the file list as a program start point (automatic definition of the <command>MAIN</command> procedure)
ru: использовать код первого файла в списке в качестве точки старта программы (автообъявление процедуры <command>MAIN</command>)

source: suppress the automatic definition of a procedure with the same name as the program file (.prg)
ru: не объявлять процедуру с именем исходного файла (.prg)

source: compile in C+P-code mode; smaller size of an output file, either an object or an executable
ru: компилировать в режиме C+P-code; дает меньший размер сгенерированного файла

source: create an shared object; when used with <command>-e</command> option it results in linking with shared run-time library (libclip.so), which gives a smaller size executable; see <command>-r</command> option
ru: создать разделяемый объект; при использовании вместе с опицией <command>-e</command> включается режим динамической компоновки с библиотекой времени исполнения (libclip.so); это дает меньший размер исполняемого файла; см. также описание опции <command>-r</command>

source: always when possible link with shared libraries; smaller size of an executable
ru: всегда когда возможно компоновать с динамическими (разделяемыми) библиотеками; дает меньший размер исполняемого файла

source: add the specified directory to the INCLUDE path list
ru: добавить заданную директорию в список для поиска заголовочных (включаемых) файлов (.ch)

source: add the specified directory to the list of path that CLIP will search for libraries
ru: добавить заданную директорию в список для поиска библиотек

source: define macro <![CDATA[<name>]]>
ru: определить макро <![CDATA[<name>]]>

source: define macro <![CDATA[<name> as <value>]]>
ru: определить маскро <![CDATA[<name> со значением <value>]]>

source: identifies an alternate standard header file to preprocess in place of the supplied STD.CH which is used automatically
ru: использовать альтернативный включаемый файл вместо стандартного STD.CH

source: define charset of the string constants used in the source files (.prg); CLIP_HOSTCS environment variable is used by default; see chapter <link linkend="envir">Environment variables</link> for details
ru: определить кодировку строковых констант, используемых в исходном файле (.prg); по умолчанию используется значение переменной окружения CLIP_HOSTCS; см. подробности в главе <link linkend="envir">Переменные окружения</link>

source: define charset of the string constants to be used for an application's output; CLIP_HOSTCS environment variable is used by default; see chapter <link linkend="envir">Environment variables</link> for details
ru: определить кодировку строковых констант, используемую в выводе приложения; по умолчанию используется значение переменной окружения CLIP_HOSTCS; см. подробности в главе <link linkend="envir">Переменные окружения</link>

source: stop after the preprocessing stage; the output is preprocessed source code, which is sent to the standard output
ru: остановиться после завершения работы препроцессора; результат работы препроцессора помещается в стандартный вывод

source: print command definitions at the preprocessing stage
ru: вывести определения команд на этапе работы препроцессора

source: do not remove temporary '.c' files
ru: не удалять временные '.c'-файлы

source: generate warnings about unresolved function names; see CLIP_NAMES environment variable description in the chapter <link linkend="envir">Environment variable</link>
ru: генерировать предупреждающие сообщения об использовании неопределенных функций; см. описание переменной окружения CLIP_NAMES в главе <link linkend="envir">Переменные окружения</link>

source: set <![CDATA[<name>]]> environment variable's value to <![CDATA[<value>]]> for a compilation time
ru: установить значение переменной окружения <![CDATA[<name>]]> равным <![CDATA[<value>]]> на время компиляции

source: set syntax compatability mode; possible values:
ru: установить режим совместимости с ключевыми словами; возможные значения:

source: AS clause in variables definitions is not acceptable; it's default behavior
ru: не разрешается использование ключевого слова AS в определениях переменных; используется по умолчанию

source: AS clause in variables defintions is acceptable
ru: разрешается использование ключевого слова AS в определениях переменных

source: Examples
ru: Примеры

source: As stated before, CLIP compiler perceives not only options passed via command line, but these of them prescribed in <command>.cliprc</command> file in the current directory; or in the <command>$HOME/.cliprc</command> file; or in any file in the <command>$CLIPROOT/cliprc</command> directory. In the following examples it's assumed there are no (or empty) files, listed above.
ru: Как было сказано ранее, компилятор CLIP воспринимает не только опции передаваемые через командную строку, но и опции, прописанные в файле <command>.cliprc</command> в текущей директории; или в файле <command>$HOME/.cliprc</command>; или в любом файле в директории <command>$CLIPROOT/cliprc</command>. В следующих примерах предполагается, что этих файлов нет, или они пустые.

source: Build a very simple application from one source file with no <command>MAIN</command> procedure. The result is a huge executable staticly linked with CLIP Run Time Library (RTL).
ru: Построение простого приложения из одного исходного файла без процедуры<command>MAIN</command>. Результатом является исполняемый файл большого размера, статически скомпонованный с библиотекой времени выполнения CLIP (RTL).

source: Build an application from three source files. The result is small executable dynamicly linked with CLIP RTL. <command>app.prg</command> contains <command>MAIN</command> procedure.
ru: Построение приложения из трех исходных файлов. Результатом является исполняемый файл небольшого размера, динамически скомпонованный с RTL. <command>app.prg</command> содержит процедуру <command>MAIN</command>.

source: Create a P-code module (<command>.po</command> file). Be silent.
ru: Создание P-code модуля (<command>.po</command> файла). В процессе компиляции на экран ничего не выводится.

source: Build previous application so that it able to work when <command>libmylib.so</command> is placed in /home/rust/lib directory.
ru: Построение приложения из предыдущего примера так, что оно может работать когда <command>libmylib.so</command> находится в директории <command>/home/rust/lib</command>.

source: See preprocessor output.
ru: Вывод результата работы препроцессора.

source: Compile in <command>C+P-code</command> mode. Link dynamicly with CLIP RTL. Be more verbose. The result is an executable of the smallest size.
ru: Компиляция в режиме <command>C+P-code</command>. Динамическая компоновка с RTL. В процессе компиляции выводится подробная информация о производимых компилятором действиях.

source: Using C compiler option <command>-l</command> to link with shared library <command>libclip-postgres.so</command> (PostgreSQL driver for CLIP).
ru: Использование опции компилятора C <command>-l</command> для динамической компоновки с разделяемой библиотекой <command>libclip-postgres.so</command> (драйвер PostgreSQL для CLIP).
