Repository: amery/clip-angelo
Catalog: doc/po/doc/sockets.sgml/*.po
Languages: ru

source: Working with sockets
ru: Работа с сокетами

source: Introduction
ru: Введение

source: CLIP has the set of functions for work with sockets through TCP protocol. In combination with multitasking capability they can be used for writing application servers and clients.
ru: CLIP имеет набор функций для работы с сокетами с использованием протокола TCP. В сочетании с многозадачностью они могут быть использованы для написания серверов приложений и клиентов.

source: TCP functions
ru: Функции TCP

source: Listen for connections from a client
ru: Установка обработчика подключений от клиента

source: Accept a connection from a client
ru: Принятие подключения от клиента

source: Initiate a connection to the server
ru: Подключение к серверу

source: Close a socket
ru: Закрытие сокета

source: Send a message to the connected peer
ru: Отправка сообщения другой стороне

source: Receive a message from the connected peer
ru: Прием сообщения от другой стороны

source: Example
ru: Пример

source: Below are the codes of simple application server and client. Server waits for a connection from client, reads messages from client, and sends them back. Client connects to the server, reads data from keyboard, sends them to the server, and prints what server returns.
ru: Ниже приведены исходные тексты простого сервера приложений и клиента. Сервер ожидает подключения от клиентов, получает от них сообщения и посылает их обратно. Клиент подключается к серверу, получает данные с клавиатуры, посылает их серверу и выводит на экран то, что возвращает сервер.

source: Server source:
ru: Сервер:

source: Client source:
ru: Клиент:
