Repository: amery/clip-angelo
Catalog: doc/po/doc/dev.sgml/*.po
Languages: ru

source: Terminals, keyboard, mouse, localization
ru: Терминалы, клавиатура, мышь, локализация

source: Terminals
ru: Терминалы

source: CLIP applications are able to work with all kind of terminals and emulators. Terminal abilities descriptions are available at <emphasis>terminfo</emphasis> database or (if environment variable TERMCAP is set) at the file TERMCAP is indicating on. On addition to this descriptions there are some extended possibilities to indicate for CLIP application some special capabilities of terminal. These descriptions are in directory $CLIPROOT/term and looking as
ru: CLIP-приложения могут работать со всеми видами терминалов и эмуляторов. Описания возможностей терминалов берутся из базы данных <emphasis>terminfo</emphasis> или (если установлена переменная окружения TERMCAP) из файла на который указывает переменная TERMCAP. CLIP может использовать некоторые расширенные возможности терминалов, указанные в дополнительных описателях терминалов, которые располагаются в директории $CLIPROOT/term и выглядят следующим образом:

source: to work with description of linux terminal in terminfo
ru: для работы с описанием терминала linux из terminfo

source: whether yielding scan-codes instead of ansi-codes terminal ability; # options are: terminal, ioctl, no
ru: Возможность работы в скан-режиме; #возможные значения: terminal, ioctl, no

source: ESC-sequence to switch scan-codes transfer mode on
ru: ESC-последовательность для переключения в режим передачи скан-кодов

source: ESC-sequence to switch scan-codes transfer mode off
ru: ESC-последовательность для отключения режима передачи скан-кодов

source: keyboard layout for keyboard driver of CLIP application
ru: раскладка клавиатуры для клавиатурного драйвера CLIP приложения

source: charset used by CLIP VM at run time // unicode - file
ru: кодировка используемая CLIP VM во время выполнения // файл unicode

source: charset used by client for display // unicode - file
ru: кодировка используемая клиентом для отображения на дисплее // файл unicode

source: single pseudo-graphics symbols
ru: символы одинарной псевдографики

source: double pseudo-graphics symbols
ru: символы двойной псевдографики

source: color translation table
ru: таблица перекодировки цветов

source: All "advanced" terminal names have to be registered in your <emphasis>terminfo/termcap</emphasis> database.
ru: Названия всех "продвинутых" терминалов должны быть зарегистрированы в базах данных <emphasis>terminfo/termcap</emphasis>.

source: Linux standard <emphasis>unicode-tables</emphasis> located in /usr/share/consoletrans directory are used for translation of terminal output.
ru: Для перекодировки терминального вывода используются стандартные таблицы <emphasis>unicode</emphasis>, расположенные в директории /usr/share/consoletrans.

source: Necessary unicode-tables have to be unpacked and put into $CLIPROOT/charsets directory. CLIP distribution contains some unicode-tables also.
ru: Нужные таблицы unicode следует распаковать и поместить в директорию $CLIPROOT/charsets. В комплект поставки CLIP также входят некоторые таблицы unicode.

source: Keyboard
ru: Клавиатура

source: CLIP applications have two keyboard drivers: <emphasis>ANSI-mode</emphasis> and <emphasis>scan-mode</emphasis>.
ru: Приложения CLIP имеют два драйвера клавиатуры: <emphasis>ANSI-mode</emphasis> и <emphasis>scan-mode</emphasis>.

source: In the ANSI-mode ansi-codes of the keys are accepted from terminal, and two modificators - Ctrl-J, Ctrl-K are used for extended possibilities.
ru: В ANSI-mode от терминала принимаются ansi-коды клавиш, и два модификатора - Ctrl-J, Ctrl-K используются для расширенных возможностей.

source: Modificator change key code for CLIP application. For example: pushing key 1 yield code 49, pushing Ctrl-J,1 yield code 376, pushing Ctrl-K,1 also yield code 376. Modificator Ctrl-J works the same as ALT, and modificator Ctrl-K works the same as CTRL but not with all keys.
ru: Модификатор изменяет код следующей нажатой клавиши для приложения CLIP. Например: нажатие клавиши 1 дает код 49, нажатие Ctrl-J,1 дает код 376, нажатие Ctrl-K,1 также дает код 376. Модификатор Ctrl-J работает как клавиша ALT, а модификатор Ctrl-K - как CTRL, но не для всех клавиш.

source: More advanced keyboard mode is <emphasis>scan-mode</emphasis>. In this mode terminal passes to the host scan-codes of pushed and released keys. All key combinations are available in the case of correct keymap description. There is even possibility to enlist code of symbol using "Alt+enlisted_at_digital_keyboard_code"! In this case description of used console layout (/usr/share/keymaps/*) is used.
ru: Более продвинутый режим клавиатуры - <emphasis>scan-mode</emphasis>. В этом режиме терминал передает скан-коды нажимаемых и отпускаемых клавиш. Доступны все комбинации клавиш, при условии корректного описания keymap. Имеется даже возможность ввода клавиш с использованием "Alt+код_клавиши_на_цифровой_клавиатуре"! В этом случае используется описание консольной раскладки (/usr/share/keymaps/*).

source: In order for CLIP application to be able to use scan-mode it is necessary to generate keyboard description for desired keymap using $CLIPROOT/keymaps/genmap.sh utility; to put this description in $CLIPROOT/keymaps and to register CLIP_KEYMAP in the file with used terminal description in $CLIPROOT/term directory (see above about <link linkend="devterminals">terminals</link>).
ru: Для того чтобы приложения CLIP могли использовать scan-mode необходимо сгенерировать описатель клавиатуры для нужного keymap при помощи утилиты $CLIPROOT/keymaps/genmap.sh; поместить этот описатель в $CLIPROOT/keymaps и прописать CLIP_KEYMAP в файле-описателе используемого терминала в директории $CLIPROOT/term (см. выше о <link linkend="devterminals">терминалах</link>).

source: As terminal with scan-mode capability one may use linux-console or our terminal emulator <command>STelnel</command> (download at <ulink url="ftp://ftp.itk.ru/pub/telnet">ftp://ftp.itk.ru/pub/telnet</ulink>)
ru: В качестве терминала с возможностью работы в scan-mode можно использовать эмулятор терминала linux-console или наш эмулятор <command>STelnel</command> (скачать можно на <ulink url="ftp://ftp.itk.ru/pub/telnet">ftp://ftp.itk.ru/pub/telnet</ulink>).

source: In order to use capabilities of "advanced" terminal run stelnet as follows:
ru: Для использования возможностей "продвинутого" терминала запускайте stelnet примерно следующим образом:

source: and launch CLIP application as follows:
ru: и запускайте приложение CLIP таким образом:

source: Mouse
ru: Мышь

source: Mouse is supported in the following cases:
ru: Мышь поддерживается в следующих случаях:

source: on console with standard terminal mode using daemon gpm
ru: на консоли в стандартном режиме терминала с использованием драйвера gpm

source: on X-Windows terminals with TERM==xterm or TERM==rxwt terminals
ru: на терминалах X-Windows с TERM==xterm или TERM==rxwt

source: on another X-Windows terminals in the case of environment variable XTERM_MOUSE is set to <emphasis>ON</emphasis>
ru: на других терминалах X-Windows в случае установки переменной окружения XTERM_MOUSE=<emphasis>ON</emphasis>

source: from stelnet terminal emulator in the case of environment variable XTERM_MOUSE is set to <emphasis>ON</emphasis>
ru: при использовании эмулятор терминала stelnet в случае установки переменной окружения XTERM_MOUSE=<emphasis>ON</emphasis>

source: from console through ssh on another host (trans_1.2 package is required)
ru: с консоли через ssh на другом хосте (необходим пакет trans_1.2)

source: on the Windows host
ru: под Windows

source: Localization
ru: Локализация

source: Localization of CLIP application includes localization of display devices, keyboard, string constants and embedded functions.
ru: Локализация приложений CLIP подразумевает локализацию устройства отображения (дисплея), клавиатуры, строковых констант и встроенных функций.

source: Display devices are console, terminal, terminal emulator. One can execute their localization by standard for OS means, i.e. font loading, terminal localization by burning the BIOS, or by loading a special display/keyboard driver.
ru: Устройства отображения - консоль, терминал, эмулятор терминала. Локализация устройства отображения производится стандартным путем, т.е. загрузкой фонта, прошивкой ПЗУ терминала, или загрузкой специального драйвера клавиатуры и дисплея.

source: In the case of scan-mode keyboard layout and encoding are made up by means of creating keymap-file and generation on its base file - description for CLIP's builtin keyboard driver.
ru: При использовании scan-mode раскладка клавиатуры и перекодировка производится путем создания keymap-файла и генерации на его основе файла-описателя для клавиатурного драйвера, встроенного в CLIP.

source: Some clipper-functions (such as upper,lower,isalpha, isdigit) have national features - pseudographics, weight coefficients for string indexing and comparison etc. Utility $CLIPROOT/bin/gen_tbl is intended for creating the file - description of national features of that functions. For the more details see <link linkend="localisation">Localisation</link> chapter.
ru: Некоторые функции Clipper (такие как upper, lower, isalpha, isdigit) имеют национальные особенности - символы псевдографики, весовые коэффициенты символов для индексации и сравнения строк, и т.д. Утилита $CLIPROOT/bin/gen_tbl предназначена для создания файла-описателя, используемого для реализации национальных особенностей этих функций. Для более подробной информации см. главу <link linkend="localisation">Локализация</link>.

source: CLIP has special setting for the using DBF data by different users with different charsets simultaneously:
ru: CLIP имеет специальную установку для использования DBF разными пользователями, работающими с разными кодировками, одновременно:

source: or in the command form:
ru: или в виде команды:

source: where cp866 is name of tbl-file with national features description.
ru: где cp866 - имя tbl-файла с описанием национальных особенностей.

source: May be so that data stored in DBF with one charset, program operates in another and client displays in third (see above about <link linkend="devterminals">terminals</link>).
ru: Может быть так, что данные хранятся в DBF в одной кодировке, программа работает в другой, а отображение на клиенте производится в третьей (см. выше о <link linkend="devterminals">терминалах</link>).

source: There is possibility to set charset used by printer too:
ru: Также имеется возможность задания кодировки, используемой принтером:

source: CLIP compiler stores all string constants defined as [string_data] at the $CLIPROOT/locale.pot subdirectories. So there is possibility for all these constants to make the translations for another languages.
ru: Компилятор CLIP помещает все строковые константы определенные как [строка_данных] в поддиректориях $CLIPROOT/locale.pot. Эти константы можно перевести на другие языки.

source: At run time CLIP application reads environment variable LANG and then gets appropriate constants from $CLIPROOT/locale.po subdirectories.
ru: Во время выполнения приложение CLIP читает значение переменной окружения LANG и загружает соответствующие языку константы из поддиректорий $CLIPROOT/locale.po.
