Repository: amery/clip-angelo
Catalog: doc/po/doc/introduction.sgml/*.po
Languages: ru

source: Introduction
ru: Введение

source: Clip team searches for sponsor or investor
ru: Команда разработки Clip ищет спонсоров и/или инвесторов

source: clip future notes
ru: Если вы читаете эту страницу, значит вас тоже волнует будущее Clipper, прочитайте пожалуйста внимательнее информацию от начала и до конца. Многое из ненаписанного вы найдете "между строк". Если у вас есть мысли и пожелания по развитию безвременно зачахшей лучшей среды разработки последнего десятилетия - обязательно напишите нам и мы постараемся учесть ваши пожелания.

source: Download and mirrors
ru: Где взять

source: Very fast mirror linux.ru.net
ru: Очень быстрое зеркало на linux.ru.net

source: Home ftp ftp.itk.ru
ru: Домашнее ftp на ftp.itk.ru

source: Irkutsk mirror ftp.lastik.ru
ru: Домашнее ftp ftp.itk.ru)

source: Trademarks
ru: Зарегестрированные торговые марки

source: Clipper - trademark of Computer Associates International Inc
ru: Clipper - торговые марка Computer Associates International Inc

source: UNIX - trademark of SCO Inc
ru: UNIX - торговые марка SCO Inc

source: Linux - trademark of Linus Torwalds
ru: Linux - торговые марка Linus Torwalds

source: DOS, Windows, FoxPro - are trademarks of Microsoft Corporation
ru: DOS, Windows, FoxPro - торговые марки Microsoft Corporation
