Repository: amery/clip-angelo
Catalog: clip/locale.po/*.ISO01/clip.po
Languages: es_es

source: cannot load charset '%s': %s
es_es: no se puede cargar el juego de caracteres '%s': %s

source: no access to file '%s': not a regular file
es_es: no hay acceso al archivo '%s': no es un archivo regular

source: no access to file '%s': %s
es_es: no hay acceso al archivo '%s': %s

source: locale settings not found for module '%s'
es_es: no se encontraron parámetros de localización para el módulo '%s'

source: no access to locale file '%s': %s
es_es: no hay acceso al archivo de localización '%s': %s

source: cannot open locale file '%s': %s
es_es: no se puede abrir el archivo de localización '%s': %s

source: open locale file '%s', charset '%s'
es_es: abierlo el archivo de localización '%s', juego de caracteres '%s'

source: cannot stat locale file '%s': %s
es_es: no se encuentra el archivo de localización '%s': %s

source: cannot read locale file '%s': %s
es_es: no se puede leer el archivo de localización '%s': %s

source: wrong magic number of locale file '%s'
es_es: código de identificación equivocado en el archivo de localización '%s'

source: illegal revision of locale file '%s': %d
es_es: revisión ilegal del archivo de localización '%s': %d

source: syntax error: cannot back up
es_es: error de sintaxis: no se puede regresar

source: EXTERN after executable statements
es_es: EXTERN luego de sentencias ejecutables

source: EXIT statement out of loop
es_es: sentencia EXIT fuera de bucle

source: LOOP statement out of loop
es_es: sentencia LOOP fuera de bucle

source: please, use IIF function (not IF) on operator level to avoid conflicts
es_es: por favor, use función IIF (no IF) a nivel operador para evitar conflictos

source: unclosed BEGIN SEQUENCE
es_es: BEGIN SEQUENCE no cerrado

source: invalid array call
es_es: llamada a array inválida

source: only inline assign := allowed in initialisation
es_es: unicamente asignador en línea (:=) permitido en inicialización

source: name '%s' duplication
es_es: nombre '%s' duplicado

source: parse error; also virtual memory exhausted
es_es: error de análisis; y memoria virtual agotada

source: parse error
es_es: error de análisis

source: parser stack overflow
es_es: desborde de pila en el analizador

source: cannot open file '%s'
es_es: no se puede abrir el archivo '%s'

source: executable operator outside of function (-n flag is active)
es_es: operador ejecutable fuera de función (opción -n activa)

source: in file '%s', included at line %d
es_es: en archivo '%s', incluido en línea %d

source: in file '%s'
es_es: en archivo '%s'

source: line %ld pos %ld (yychar=%d, '%c')
es_es: línea %ld posición %ld (yychar=%d, '%c')

source: warning %d:
es_es: advertencia %d:

source: line %ld, pos %ld,
es_es: línea %ld, posición %ld,

source: warning %d,
es_es: advertencia %d,

source: unclosed loop statement (level %d, begin at line %d file %s)
es_es: bucle loop sin cerrar (nivel %d, comienza en línea %d archivo %s)

source: unclosed IF statement (level %d, begin at line %d file %s)
es_es: sentencia IF sin cerrar (nivel %d, comienza en línea %d archivo %s)

source: unclosed SEQUENCE statement (level %d, begin at line %d file %s)
es_es: sentencia SEQUENCE sin cerrar (nivel %d, comienza en línea %d archivo %s)

source: duplicate name '%s', previous name defined near line %d pos %d in file '%s'
es_es: nombre '%s' duplicado, nombre anterior definido cerca de la línea %d posición %d en archivo '%s'

source: declaration function with module name '%s'; force -n flag
es_es: declaración de función con nombre de módulo '%s'; forzar opción -n

source: function '%s' already defined near line %d file %s
es_es: función '%s' ya definida cerca de la línea %d archivo %s

source: static function '%s' already declared as external
es_es: función estática '%s' ya declarada como externa

source: macro variable name not allowed here
es_es: nombre de variable macro no permitida aquí

source: name '%s' already declared as LOCAL near line %d pos %d file '%s'
es_es: nombre '%s' ya declarado como LOCAL cerca de la línea %d posición %d archivo '%s'

source: name '%s' already declared as PARAMETER near line %d pos %d file '%s'
es_es: nombre '%s' ya declarado como PARAMETER cerca de la línea %d posición %d archivo '%s'

source: name '%s' already declared as MEMVAR near line %d pos %d file '%s' (previous name will be hidden)
es_es: nombre '%s' ya declarado como MEMVAR cerca de la línea %d posición %d archivo '%s' (nombre anterior será escondido)

source: name '%s' already declared as FIELD near line %d pos %d file '%s'
es_es: nombre '%s' ya declarado como FIELD cerca de la línea %d posición %d archivo '%s'

source: name '%s' already declared as STATIC near line %d pos %d file '%s'
es_es: nombre '%s' ya declarado como STATIC cerca de la línea %d posición %d archivo '%s'

source: namespace of name '%s' undeclared, assumed as FIELD-MEMVAR
es_es: ámbito del nombre '%s' no declarado, asumido como FIELD-MEMVAR

source: file '%s' table:
es_es: archivo '%s' tabla:

source: read module %s: %ld bytes
es_es: leído módulo %s: %ld bytes

source: read file '%s': %d modules
es_es: leído archivo '%s': %d módulos

source: write file '%s', %d func
es_es: escrito archivo '%s', %d func

source: done, %ld bytes
es_es: terminado, %ld bytes

source: write file '%s'
es_es: escrito archivo '%s'

source: set source charset to %s
es_es: puesto juego de caracteres fuente a %s

source: set target charset to %s
es_es: puesto juego de caracteres destino a %s

source: invalid argument for -E: '%s'
es_es: argumento inválido para -E: '%s'

source: invalid compatability word: '%s' possible values: as-word, no-as-word
es_es: compatibilidad para word inválida: '%s' valores posibles: as-word, no-as-word

source: try '%s --help' for options details
es_es: intente '%s --help' para detalles de opciones

source: Usage: %s [options] [<filename> ...] options: -h, --help this help -H, --help-environment help about acceptable environment variables -V, --version print clip version -v[<level>], --verbose[=<level>] set/increase verbose level -a, --auto-memvar[=1|0] set auto memvar variables mode -w, --namespace-warning[=1|0] set warning about implicit var declaration -e, --exec generate executable file -c, --compile stop after generation C code -g,-b, --debug[=1|0] generate debug info -t, --show-syntax-tree print program syntax tree -o<name>, --output=<name> set output file name -d<name>, --outdir=<name> set output directory -O, --optimise[=<val>] set optimisation level -M, --main use first <filename> as start program point -n, --nomain don't declare module procedure -p, --pcode generate pseudocode module -l, --c-pcode compile C-pseudocode module -s, --shared compile into shared object -r, --shared-exec always when possible link with shared libraries --static static link CLIP libraries to executable --full-static static link all libraries to executable -I<path>, --include-path=<path> add include search path -L<path>, --library-path=<path> add library path -D<name>, --define=<name> define macro name -D<name=value>, --define=<name=value> define macro name as <value> -U[<filename>], --use-std-ch[=<filename>] use alternate (or none) standard include file (default==std.ch) -S<charset>, --source-charset define source charset of string constants -T<charet>, --target-charset define target charset of string constants -P, --preprocess preprocess only -C, --show-command print command definitions -R, --noremove-c do not remove temporary '.c' files -N, --names warning on unresolved function names (see CLIP_NAMES envar) -E<name=value>, --environment=<name=value> exact to set same environ variable(see -H for details) -q <word>, --compat=<word> set syntax compatability modes: no-as-word - default value as-word <filename> files to process all above options may be placed in .cliprc file in current directory, in $HOME/.cliprc file, or in any file in $CLIPROOT/cliprc directory
es_es: Uso: %s [opciones] [<archivo> ...] opciones: -h, --help esta ayuda -H, --help-environment ayuda sobre variables de entorno aceptadas -V, --version imprimir la versión de clip -v[<nivel>], --verbose[=<nivel>] activar/incrementar el nivel de mensajes -a, --auto-memvar[=1|0] activar modo de variables memvar automático -w, --namespace-warning[=1|0] alertar sobre variables declaradas implicitamente -e, --exec generar archivo ejecutable -c, --compile parar luego de generar el código C -g,-b, --debug[=1|0] generar información de depuración -t, --show-syntax-tree imprimir el árbol de sintaxis del programa -o<name>, --output=<name> nombre de archivo de salida -d<name>, --outdir=<name> directorio destino -O, --optimise[=<val>] nivel de optimización -M, --main usar el primer <archivo> como punto de comienzo del programa -n, --nomain no declarar nombre de módulo automaticamente -p, --pcode generar módulo de pseudocódigo -l, --c-pcode compilar módulo de pseudocódigo-C -s, --shared compilar como objeto dinámico -r, --shared-exec enlazar con librerías dinámicas si es posible -I<ruta>, --include-path=<ruta> agregar ruta de búsqueda de cabeceras -L<ruta>, --library-path=<ruta> agregar ruta de búsqueda de librerías -D<nombre>, --define=<nombre> definir <nombre> como macro -D<nombre=valor>, --define=<nombre=valor> definir <nombre> como macro igual a <valor> -U[<archivo>], --use-std-ch[=<archivo>] usar cabecera estándar alternativa (o ninguna, por defecto std.ch) -S<juego de caracteres>, --source-charset definir juego de caracteres fuente -T<charet>, --target-charset definir juego de caracteres destino -P, --preprocess sólo preprocesar -C, --show-command imprimir definiciones de comandos -R, --noremove-c no remover archivos '.c' temporales -N, --names alertar sobre funciones no resueltas (ver varent CLIP_NAMES) -E<nombre=valor>, --environment=<nombre=valor> pone variable de entorno <nombre> como <valor> (ver -H para detalles) -q <word>, --compat=<word> modo de compatibilidad de sintaxis: no-as-word - valor por defecto as-word <archivo> nombres de archivos a procesar todas las opciones anteriores pueden ser puestas en un archivo .cliprc en el directorio actual, en $HOME/.cliprc, o en cualquier archivo en el directorio $CLIPROOT/cliprc

source: cannot open defname file '%s': %s
es_es: no se puede abrir el archivo nombredef '%s': %s

source: cannot open exname file '%s': %s
es_es: no se puede abrir el archivo nombreej '%s': %s

source: possible not defined function %s
es_es: función posiblemente no definida %s

source: conflict between -s and -p flags
es_es: conflicto entre opciones -s y -p

source: conflict between -c and -p flags
es_es: conflicto entre opciones -c y -p

source: conflict between -n and -m flags
es_es: conflicto entre opciones -n y -m

source: cannot change to output dir '%s': %s
es_es: no se puede cambiar al directorio destino '%s': %s

source: unknown file type '' file '%s'
es_es: tipo de archivo desconocido '' archivo '%s'

source: unknown file type '%s' file '%s'
es_es: tipo de archivo desconocido '%s' archivo '%s'

source: no input files, so use stdin; -h will help
es_es: no se especificaron archivos de entrada, usando stdin (-h ayudaría)

source: process file '%s' ..
es_es: procesando archivo '%s' ..

source: .. done, %s
es_es: .. terminado, %s

source: parsing file '%s' ..
es_es: analizando archivo '%s' ..

source: .. done (%d/%d %s, %d %s, %s)
es_es: .. terminado (%d/%d %s, %d %s, %s)

source: line
es_es: línea

source: warning
es_es: advertencia

source: codegen file '%s' ..
es_es: archivo de código '%s' ..

source: writing file '%s' ..
es_es: escribiendo archivo '%s' ..

source: .. done, %ld %s ,%s
es_es: .. terminado, %ld %s ,%s

source: .. done
es_es: .. terminado

source: compile file '%s' ..
es_es: compilando archivo '%s' ..

source: make shared object '%s' ..
es_es: creando archivo dinámico '%s' ..

source: generate reference file '%s' ..
es_es: generando archivo referencia '%s' ..

source: make file '%s' ..
es_es: creando archivo '%s' ..

source: C level error in command: %s
es_es: error de nivel C en comando: %s

source: file
es_es: archivo

source: cannot open output file '%s'
es_es: no se puede abrir el archivo de salida '%s'

source: cannot write PCODE module with c-texts
es_es: no se pude escribir módulo PCODE con textos-c

source: error writing file '%s', %s
es_es: error escribiendo archivo '%s', %s

source: cannot open pipe '%s'
es_es: no se puede abrir tubería '%s'

source: cannot open file '%s': %s
es_es: no se puede abrir el archivo '%s': %s

source: invalid chars in number
es_es: caracteres inválidos en número

source: newline in string
es_es: línea nueva en cadena de texto

source: end-of-comment without begin
es_es: fin de comentario sin un principio

source: '@}' without '@{'
es_es: '@}' sin '@{'

source: id: non-matched command '%s'
es_es: id: comando no encontrado '%s'

source: non-matched command '%s'
es_es: comando no encontrado '%s'

source: #else without #ifdef or #ifndef
es_es: #else sin #ifdef o #ifndef

source: #endif without #ifdef or #ifndef
es_es: #endif sin #ifdef o #ifndef

source: invalid #define directive
es_es: directiva #define inválida

source: macro function redefined
es_es: función macro redefinida

source: macro redefined
es_es: macro redefinida

source: invalid macro call
es_es: llamada a macro inválida

source: invalid number of macro arguments (%d instead %d)
es_es: número inválido de argumetos de macro (%d en vez de %d)

source: unexpected EOL in SM_ENUM
es_es: EOL inesperada in SM_ENUM

source: bad symbol in SM_ENUM: '%s'
es_es: símbolo inválido en SM_ENUM: '%s'

source: non-balanced '[' in #command
es_es: '[' no balanceado en #command

source: unexpected end of #command directive
es_es: fin inesperado de directiva #command

source: cmdstr: newline in string
es_es: cmdstr: nueva línea en cadena de texto

source: too much errors
es_es: demasiados errores

source: #ifdef or #ifndef without #endif
es_es: #ifdef o #ifndef sin #endif

source: unterminated string constant (possible begin at line %d pos %d file '%s')
es_es: constante de texto no terminada (posible comienzo en línea %d posición %d archivo '%s')

source: unmatched bracket '%c' (possible begin at line %d pos %d file '%s')
es_es: llave no coincidida '%c' (posible comienzo en línea %d posición %d archivo '%s')

source: unclosed comment (possible begin at line %d pos %d file '%s')
es_es: comentario no cerrado (posible comienzo en línea %d posición %d archivo '%s')

source: no ENDTEXT
es_es: sin ENDTEXT

source: macro function with 0 count of arguments
es_es: función macro con 0 argumentos

source: no subst marker '%s' in pattern part of command
es_es: sin marca de sustitución '%s' en patrón de comando

source: unmatched bracket '%c'
es_es: llave no coincidida '%c'

source: skip_norm: match delim '%s', return at '%s'
es_es: skip_norm: coincidencia delim '%s', devuelta en '%s'

source: bad command definition: OPTION have only literals
es_es: definición de comando inválida: OPTION tiene sólo literales

source: endless subst loop detected
es_es: bucle sin fin detectado

source: too many entries in OPTIONAL list: > %d
es_es: demasiadas entradas en lista OPTIONAL: > %d

source: bad #include directive
es_es: directiva #include inválida

source: cannot open include file '%s': %s
es_es: no se puede abrir archivo de cabecera '%s': %s

source: recodeString: subst %d: '%s'->'%s': '%s'
es_es: recodeString: sust %d: '%s'->'%s': '%s'

source: recode_string: subst %d: '%s'->'%s': '%s'
es_es: recode_string: sust %d: '%s'->'%s': '%s'

source: circular loop in macro/command substitution detected
es_es: bucle circular detectado en sustitución de macro/comando

source: set file '%s' charset to '%s'
es_es: puesto para el archivo '%s' juego de caracteres '%s'

source: push charset '%s' %d
es_es: promovido juego de caracteres '%s' %d

source: pop charset '%s' %d
es_es: traído juego de caracteres '%s' %d

source: too long string
es_es: cadena de texto muy larga

source: cannot create dir '%s': %s
es_es: no se pudo crear el directorio '%s': %s

source: cannot create file '%s': %s
es_es: no se pudo crear el archivo '%s': %s

source: open locale file '%s'
es_es: abierto archivo de localización '%s'

source: wrote locale message entry '%s'
es_es: escrita entrada de mensaje '%s'

source: wrote plural locale message '%s' '%s'
es_es: escrita entrada de mensaje plural '%s' '%s'

source: LOCAL after executable statements
es_es: LOCAL luego de sentencias ejecutables

source: STATIC after executable statements
es_es: STATIC luego de sentencias ejecutables

source: only constant expression allowed for static variable initialisation
es_es: solo expresiones constantes permitidas para inicialización de variables estáticas

source: MEMVAR after executable statements
es_es: MEMVAR luego de sentencias ejecutables

source: FIELD after executable statements
es_es: FIELD luego de sentencias ejecutables

source: PARAMETERS and '(' <paramlist> ')' are incompatible
es_es: PARAMETERS y '(' <listaparam> ')' son incompatibles

source: init expression not allowed here
es_es: expresión de inicio no permitida aquí

source: array declaration not allowed here
es_es: declaración de array no permitida aquí

source: reference to constant
es_es: referencia a constante

source: reference to temporary object
es_es: referencia a objeto temporal

source: reference to undeclared function '%s' near line %d
es_es: referencia a función no declarada '%s' cerca de la línea %d

source: reference to macro not allowed
es_es: no se permiten referencias a macros

source: reference to non-lvalue object
es_es: referencia a objeto no-lvalor

source: reference to function with args not allowed
es_es: referencia a función con argumentos no permitido

source: cannot GET constant
es_es: no se puede hacer GET de constantes

source: assign to non-lvalue
es_es: asignación a no-lvalor

source: reference to macro assign not allowed
es_es: asignación de referencia a macro no permitido

source: CTEXT in pcode module
es_es: CTEXT en módulo pcodigo

source: assign to element of local array conflicts with macro
es_es: conflicto de asignación a elemento de array local con macro

source: INCR with non-lvalue
es_es: INCR con no-lvalor

source: %s not allowed in CODESTR
es_es: %s no permitido en CODESTR

source: CASE label duplication: '%s' at line %d and '%s' at line %d
es_es: etiqueta CASE duplicada: '%s' en línea %d y '%s' en línea %d
