Repository: amery/clip-angelo
Catalog: clip/locale.po/*.ISO01/sys.po
Languages: es_es

source: Class TBlock constructor error:Invalid expression
es_es: Error del constructor de la clase TBlock: Expresión inválida

source: Beginning of file
es_es: Comienzo de archivo

source: End of file
es_es: Fin de archivo

source: Record in use, Please, retry
es_es: Registro en uso. Por favor reintente

source: Can~t lock dataBase ! Please try again
es_es: No se puede bloquear la base de datos. Intentelo nuevamente

source: Called Error:
es_es: Llamado Error:

source: Field not found in dictonary
es_es: Campo no encontrado en el diccionario

source: Index not found in dictonary
es_es: Indice no encontrado en el diccionario

source: Line
es_es: Línea

source: String;
es_es: Cadena de texto;

source: ;not found!
es_es: ;no encontrado!

source: &File
es_es: &Archivo

source: E&xit
es_es: &Salir

source: End of application
es_es: Terminar la aplicación

source: &Options
es_es: &Opciones

source: &Find
es_es: &Buscar

source: Find string
es_es: Buscar una cadena de texto

source: Resume find string
es_es: Resumir búsqueda de cadena de texto

source: Unmark selected block
es_es: Desmarcar bloque seleccionado

source: ESC -menu
es_es: ESC - menú

source: Can't open file;
es_es: No se puede abrir el archivo;

source: File;
es_es: Archivo;

source: ;not saved. Save it?
es_es: ;no fue guardado. Guardar?

source: Yes
es_es: Si

source: Cancel
es_es: Cancelar

source: Made
es_es: Echo

source: changes
es_es: cambios

source: Nothing to find!!!
es_es: Nada para buscar!!!

source: String
es_es: Cadena de texto

source: not found!
es_es: no encontrada!

source: There is a change in the file.;
es_es: Hay un cambio en el archivo.;

source: ; Reload?
es_es: ; Recargar?

source: Symbol '
es_es: Símbolo '

source: ' not found!
es_es: ' no encontrado!

source: Structure not found!
es_es: Estructura no encontrada!

source: Block not marked!
es_es: Bloque no marcado!

source: ;already exists. Overwrite it?
es_es: ;ya existe. Sobreescribirlo?

source: Windows list
es_es: Lista de ventanas

source: ESC - menu
es_es: ESC - menú

source: <Link>
es_es: <Enlace>

source: Create a new file
es_es: Crear un archivo nuevo

source: Open a file
es_es: Abrir un archivo

source: Save a file
es_es: Guardar un archivo

source: Save a file as...
es_es: Guardar un archivo con distinto nombre

source: Reload a file
es_es: Volver a cargar el contenido de un archivo

source: Read only options
es_es: Opciones de sólo lectura

source: Print a file
es_es: Imprimir un archivo

source: Print marked block
es_es: Imprimir un bloque marcado

source: End of application and save options
es_es: Terminar la aplicación y guardar los cambios

source: Exit with-out sa&ve
es_es: Salir sin g&uardar

source: End of application and not save options
es_es: Terminar la aplicación sin guardar los cambios

source: &Window
es_es: &Ventanas

source: List of windows
es_es: Lista de ventanas

source: Next window
es_es: Próxima ventana

source: Prevoice window
es_es: Ventana anterior

source: Close window
es_es: Cerrar ventana

source: &Block
es_es: &Bloque

source: &Line block marker
es_es: Marcador de bloque &lineal

source: Start/stop line block marker
es_es: Principio/fin de marcador de bloque lineal

source: &Column block marker
es_es: Marcador de bloque de &columnas

source: Start/stop columns block marker
es_es: Principio/fin de marcador de bloque de columnas

source: Unmark block marker
es_es: Desmarcar bloque

source: Copy block
es_es: Copiar bloque

source: Move block
es_es: Mover bloque

source: Delete block
es_es: Borrar bloque

source: Copy to clip&board
es_es: Copiar al portapap&eles

source: Copy block to clipboard
es_es: Copiar bloque al portapapeles

source: Pa&ste from clipboard
es_es: Pegar &desde el portapapeles

source: Paste block from clipboard
es_es: Pegar bloque desde el porpapapeles

source: Save block to file
es_es: Guardar bloque a archivo

source: Load block from file
es_es: Cargar bloque desde archivo

source: &Service
es_es: &Servicios

source: &Insert mode
es_es: Modo &insertar

source: On/off insert mode
es_es: Poner/quitar modo insertar

source: Find &string
es_es: &Buscar

source: Find string
es_es: Buscar cadena de texto

source: Find &next
es_es: Buscar &siguiente

source: Find next
es_es: Buscar siguiente ocurrencia

source: Find pre&vious
es_es: Buscar &anterior

source: Find previous
es_es: Buscar ocurrencia anterior

source: &Replace
es_es: &Reemplazar

source: Find and replace string
es_es: Buscar y reemplazar cadena de texto

source: &Match symbol forward
es_es: Encontrar &siguiente símbolo

source: Match identity symbol in forward
es_es: Encontrar el siguiente símbolo de identidad

source: Match symbol &backward
es_es: Encontrar símbolo &anterior

source: Match identity symbol in backward
es_es: Encontrar el símbolo de identidad anterior

source: Match Clipper structure to forward
es_es: Encontrar siguiente estructura Clipper

source: Match structure backward
es_es: Encontrar estructura an&terior

source: Match Clipper structure to backward
es_es: Encontrar estructura Clipper anterior

source: Undo operation
es_es: Deshacer operación

source: Format &line
es_es: Dar formato a &línea

source: Format line
es_es: Dar formato a línea

source: Format &part
es_es: Dar formato a &parte

source: Format part
es_es: Dar formato a parte

source: O&therwise
es_es: &Otros

source: &Template
es_es: Plan&tilla

source: Template
es_es: Plantilla

source: Template &macro
es_es: Plantilla de &macro

source: Template macro
es_es: Plantilla de macro

source: &Single graphic
es_es: Gráfico &simple

source: On/Off single graphic mode
es_es: Poner/quitar modo de gráfico simple

source: &Double graphic
es_es: Gráfico &doble

source: On/Off double graphic mode
es_es: Poner/quitar modo de gráfico doble

source: &Choose code page
es_es: &Cambiar página de códigos

source: Choose code page
es_es: Cambiar página de códigos

source: &Options...
es_es: &Opciones...

source: Set options
es_es: Cambiar opciones

source: ; not saved. Save?
es_es: ; no fue guardado. Guardar?

source: Options
es_es: Opciones

source: Create .bak files
es_es: Crear archivos .bak

source: Tabulation size
es_es: Tamaño de tabulación

source: Autosave files
es_es: Autoguardar archivos

source: Autosave time
es_es: Tiempo de autoguardado

source: Save status
es_es: Estado de guardado

source: Hypen in word
es_es: Guión en palabra

source: Auto margin left
es_es: Auto margen izquierdo

source: Margin left
es_es: Margen izquierdo

source: Margin right
es_es: Margen derecho

source: Line
es_es: Línea

source: Bad line number!
es_es: Número de línea inválido!

source: New
es_es: Nuevo

source: Link
es_es: Enlace

source: Source charset
es_es: Juego de caracteres origen

source: Y
es_es: S

source: array
es_es: tabla

source: Block
es_es: Bloque

source: Object
es_es: Objeto

source: Connect not activated
es_es: Conexión no activada

source: Find & replace
es_es: Buscar y reemplazar

source: Find:
es_es: Buscar:

source: Replace:
es_es: Reemplazar:

source: Find
es_es: Buscar

source: Options
es_es: Opciones

source: Case-sensitive
es_es: Sensitivo a May/Min

source: Word only
es_es: Sólo palabra

source: Reg. expression
es_es: Expresión reg.

source: All windows
es_es: Todas las ventanas

source: Forward
es_es: Siguiente

source: Backward
es_es: Anterior

source: From begin
es_es: Desde el comienzo

source: Direction
es_es: Dirección

source: In block
es_es: En bloque

source: Where
es_es: Donde

source: Load file...
es_es: Cargar archivo...

source: OK
es_es: AK

source: Save file...
es_es: Guardar archivo...

source: Can't create ;
es_es: No se puede crear ;

source: .bak file
es_es: archivo .bak

source: Save block to file...
es_es: Guardar bloque a un archivo...

source: Out from bound in sorted array
es_es: Fuera de límite en tabla ordenada

source: Unknown values for key or data
es_es: Valor desconocido para datos de clave

source: Out bounds in sorted array
es_es: Fuera de límites en tabla ordenada

source: Key value not found in sorted array
es_es: Valor de clave no encontrado en tabla ordenada

source: Unknown values for key
es_es: Valores desconocidos para clave

source: : create error:
es_es: : error de creación:

source: Bad file name: name is not specified
es_es: Nombre de archivo inválido: nombre no especificado

source: : open error:
es_es: : error de apertura:

source: Bad string in .ini file:
es_es: Cadena de texto inválida en archivo .ini

source: Error A2EDIT; What~s Edit ?
es_es: Error en A2EDIT; Qué Editar?

source: <bof>
es_es: <CDA>

source: <new>
es_es: <nuevo>

source: Record N
es_es: Registro N

source: January
es_es: Enero

source: February
es_es: Febrero

source: March
es_es: Marzo

source: April
es_es: Abril

source: May
es_es: Mayo

source: June
es_es: Junio

source: July
es_es: Julio

source: August
es_es: Agosto

source: September
es_es: Septiembre

source: October
es_es: Octubre

source: November
es_es: Noviembre

source: December
es_es: Diciembre

source: Sunday
es_es: Domingo

source: Monday
es_es: Lunes

source: Tuesday
es_es: Martes

source: Wednesday
es_es: Miércoles

source: Thursday
es_es: Jueves

source: Friday
es_es: Viernes

source: Saturday
es_es: Sábado

source: Can't open;
es_es: No se puede abrir;

source: Database files
es_es: Archivos base de datos

source: # records
es_es: # registros

source: last update
es_es: última actualización

source: size
es_es: tamaño

source: Esc: Cancel
es_es: Esc: Cancela

source: <Ovr>
es_es: <Sob>

source: Invalid argument
es_es: Argumento inválido

source: Do you want more samples?
es_es: Quiere más muestras?

source: Page No.
es_es: Pág. Nro

source: Invalid date
es_es: Fecha inválida

source: Range:
es_es: Rango:

source: YyTtYy1
es_es: YyVvSs1

source: Error compiling plugin file:
es_es: Error compilando archivo plugin:

source: Unknown
es_es: Desconocido

source: Undef
es_es: Indef

source: < >-go next item i-info <F5>-go line <F6>-find <F9>-menu <ESC>,<F10>-exit
es_es: < >-ir sig. item i-info <F5>-ir línea <F6>-buscar <F9>-menú <ESC>,<F10>-salir

source: Where are you going?
es_es: Dónde está yendo?

source: &Charset
es_es: &Juego de caracteres

source: &Next
es_es: &Siguiente

source: Go next item
es_es: Ir al siguiente item

source: &Prev
es_es: &Anterior

source: Go previous item
es_es: Ir al item anterior

source: P&revUrl
es_es: An&t. URL

source: Go previous URL document
es_es: Ir al documento URL anterior

source: Nex&tUrl
es_es: Si&g. URL

source: Go next URL document
es_es: Ir al siguiente documento URL

source: Get information about URL document
es_es: Información acerca del documento URL

source: <eof>
es_es: <FDA>

source: <empty>
es_es: <vacío>

source: Press any key to continue
es_es: Presione cualquier tecla para continuar

source: View printer output in text editor
es_es: Ver salida de impresora en editor de texto

source: Printing to main printer on your host
es_es: Imprimiendo a la impresora principal en su ordenador

source: choice printer
es_es: ÷ÙÂÅÒÉÔÅ ÐÒÉÎÔÅÒ

source: : Printing pages range: from XXXX to YYYY
es_es: : Imprimiendo rango de páginas: de XXXX a YYYY

source: : Printing copies: XXXX
es_es: : Imprimiendo copias: XXXX

source: Printbegin(): printing already in process
es_es: Printbegin(): impresión actualmente en proceso

source: PrintEnd(): printing process not actived
es_es: PrintEnd(): proceso de impresión no activado

source: Press any key
es_es: Presione cualquier tecla
