/*
    Copyright (C) 2001  ITK
    Author   : Yevgen Bondar (elb@lg.bank.gov.ua)
    License : (GPL) http://www.itk.ru/clipper/license.html
*/
/*
Наращенная сумма обычной ренты (Future value investment)
R_FVI(постоянный платеж,процент,число платежей)

Наращенная сумма при N начислениях и M выплатах в год
R_FVI(годовой платеж,процент,всего лет,начислений в год,выплат в год)

Современная величина ренты (Present value investment)
R_PVI(постоянный платеж,процент,число платежей)

Современная величина при N начислениях и M выплатах в год
R_PVI(годовой платеж,процент,всего лет,начислений в год,выплат в год)

Величина постоянной выплаты (Investment Payment)
R_Payment(сумма,процент,всего лет,начислений в год,выплат в год)
*/
**************************************************************************
**************************************************************************
**************************************************************************
**************************************************************************
**************************************************************************
#include <pv_fv/R_FVI.prg>
#include <pv_fv/R_Payment.prg>
#include <pv_fv/R_PVI.prg>
**************************************************************************
