Repository: amery/clip-angelo
Catalog: clip/locale.po/*.KOI8-R/clip.po
Languages: ru_ru

source: cannot load charset '%s': %s
ru_ru: невозможно загрузить кодировку '%s': %s

source: no access to file '%s': not a regular file
ru_ru: нет доступа к файлу '%s': не регулярный файл

source: no access to file '%s': %s
ru_ru: нет доступа к файлу '%s': %s

source: locale settings not found for module '%s'
ru_ru: не найдены установки локализации '%s'

source: no access to locale file '%s': %s
ru_ru: нет доступа к файлу локализации '%s': %s

source: cannot open locale file '%s': %s
ru_ru: невозможно открыть файл локализации '%s': %s

source: open locale file '%s', charset '%s'
ru_ru: открыт файл локализации '%s', кодировка '%s'

source: cannot stat locale file '%s': %s
ru_ru: невозможно получить состояние файла локализации '%s': %s

source: cannot read locale file '%s': %s
ru_ru: ошибка чтения файла локализации '%s': %s

source: wrong magic number of locale file '%s'
ru_ru: неправильный magic number файла локализации '%s'

source: illegal revision of locale file '%s': %d
ru_ru: неизвестная версия файла локализации '%s': %d

source: syntax error: cannot back up
ru_ru: синтаксическая ошибка: возврат невозможен

source: EXTERN after executable statements
ru_ru: EXTERN после выполнимого оператора

source: EXIT statement out of loop
ru_ru: оператор EXIT вне цикла

source: LOOP statement out of loop
ru_ru: оператор LOOP вне цикла

source: please, use IIF function (not IF) on operator level to avoid conflicts
ru_ru: пожалуйста, используйте функцию IIF (вместо IF) на уровне операторов, для избежания конфликтов

source: unclosed BEGIN SEQUENCE
ru_ru: незавершенный BEGIN SEQUENCE

source: invalid array call
ru_ru: неверный вызов массива

source: only inline assign := allowed in initialisation
ru_ru: только inline-присваивание ( :=) разрешено при инициализации

source: name '%s' duplication
ru_ru: повторное использование '%s'

source: parse error; also virtual memory exhausted
ru_ru: ошибка разбора; виртуальная память исчерпана

source: parse error
ru_ru: ошибка разбора

source: parser stack overflow
ru_ru: переполнение стека парсера

source: cannot open file '%s'
ru_ru: невозможно открыть файл '%s'

source: executable operator outside of function (-n flag is active)
ru_ru: выполнимый оператор вне функции (включен флаг -n)

source: in file '%s', included at line %d
ru_ru: в файле '%s', включенном на строке %d

source: in file '%s'
ru_ru: в файле '%s'

source: working directory : '%s'
ru_ru: рабочий каталог : '%s'

source: error %d:
ru_ru: ошибка %d:

source: line %ld pos %ld (yychar=%d, '%c')
ru_ru: строка %ld позиция %ld (yychar=%d, '%c')

source: error %d, (yychar=%d)
ru_ru: ошибка %d, (yychar=%d)

source: warning %d:
ru_ru: предупреждение %d:

source: line %ld, pos %ld,
ru_ru: строка %ld, позиция %ld,

source: warning %d,
ru_ru: предупреждение %d,

source: unclosed loop statement (level %d, begin at line %d file %s)
ru_ru: незавершенный оператор цикла (уровень %d, начало на строке %d file %s)

source: unclosed IF statement (level %d, begin at line %d file %s)
ru_ru: незавершенный оператор IF (уровень %d, начало на строке %d файл %s)

source: unclosed SEQUENCE statement (level %d, begin at line %d file %s)
ru_ru: незавершенный оператор SEQUENCE (уровень %d, начало на строке %d файл %s)

source: duplicate name '%s', previous name defined near line %d pos %d in file '%s'
ru_ru: повторное определение имени '%s', предыдущее определение около строки %d позиция %d файл '%s'

source: declaration function with module name '%s'; force -n flag
ru_ru: объявление функции с именем модуля '%s'; установлен флаг -n

source: function '%s' already defined near line %d file %s
ru_ru: функция '%s' уже определена около строки %d файла %s

source: static function '%s' already declared as external
ru_ru: статическая функция '%s' уже определена как внешняя

source: macro variable name not allowed here
ru_ru: имя макро-переменной здесь не разрешено

source: name '%s' already declared as LOCAL near line %d pos %d file '%s'
ru_ru: имя '%s' уже определено как LOCAL около строки %d позиция %d файл '%s'

source: name '%s' already declared as PARAMETER near line %d pos %d file '%s'
ru_ru: имя '%s' уже определено как PARAMETER около строки %d позиция %d файл '%s'

source: name '%s' already declared as MEMVAR near line %d pos %d file '%s' (previous name will be hidden)
ru_ru: имя '%s' уже определено как MEMVAR около строки %d позиция %d файл '%s' (предыдущее имя будет скрыто)

source: name '%s' already declared as FIELD near line %d pos %d file '%s'
ru_ru: имя '%s' уже определено как FIELD около строки %d позиция %d файл '%s'

source: name '%s' already declared as STATIC near line %d pos %d file '%s'
ru_ru: имя '%s' уже определено как STATIC около строки %d позиция %d файл '%s'

source: namespace of name '%s' undeclared, assumed as FIELD-MEMVAR
ru_ru: пространство имен для '%s' неопределено, установлено в FIELD-MEMVAR

source: file '%s' table:
ru_ru: таблица файла '%s':

source: read module %s: %ld bytes
ru_ru: прочитано для модуля %s: %ld байт

source: %s: %d byte %d func %d pub %d inits %d exits %s
ru_ru: %s: %d байт %d функций %d pub %d inits %d exits %s

source: read file '%s': %d modules
ru_ru: файл '%s': %d модулей

source: write file '%s', %d func
ru_ru: записан файл '%s', %d функций

source: done, %ld bytes
ru_ru: сделано, %ld байт

source: write file '%s'
ru_ru: запись файла '%s'

source: set source charset to %s
ru_ru: установлена исходная кодировка %s

source: set target charset to %s
ru_ru: установлена целевая кодировка %s

source: invalid argument for -E: '%s'
ru_ru: неправильный аргумент для -E: '%s'

source: invalid compatability word: '%s' possible values: as-word, no-as-word
ru_ru: неправильная установка совместимости: '%s' возможные значения: as-word, no-as-word

source: try '%s --help' for options details
ru_ru: попробуйте '%s --help' для описания опций

source: Usage: %s [options] [<filename> ...] options: -h, --help this help -H, --help-environment help about acceptable environment variables -V, --version print clip version -v[<level>], --verbose[=<level>] set/increase verbose level -a, --auto-memvar[=1|0] set auto memvar variables mode -w, --namespace-warning[=1|0] set warning about implicit var declaration -e, --exec generate executable file -c, --compile stop after generation C code -g,-b, --debug[=1|0] generate debug info -t, --show-syntax-tree print program syntax tree -o<name>, --output=<name> set output file name -d<name>, --outdir=<name> set output directory -O, --optimise[=<val>] set optimisation level -M, --main use first <filename> as start program point -n, --nomain don't declare module procedure -p, --pcode generate pseudocode module -l, --c-pcode compile C-pseudocode module -s, --shared compile into shared object -r, --shared-exec always when possible link with shared libraries --static static link CLIP libraries to executable --full-static static link all libraries to executable -I<path>, --include-path=<path> add include search path -L<path>, --library-path=<path> add library path -D<name>, --define=<name> define macro name -D<name=value>, --define=<name=value> define macro name as <value> -U[<filename>], --use-std-ch[=<filename>] use alternate (or none) standard include file (default==std.ch) -S<charset>, --source-charset define source charset of string constants -T<charet>, --target-charset define target charset of string constants -P, --preprocess preprocess only -C, --show-command print command definitions -R, --noremove-c do not remove temporary '.c' files -N, --names warning on unresolved function names (see CLIP_NAMES envar) -E<name=value>, --environment=<name=value> exact to set same environ variable(see -H for details) -q <word>, --compat=<word> set syntax compatability modes: no-as-word - default value as-word <filename> files to process all above options may be placed in .cliprc file in current directory, in $HOME/.cliprc file, or in any file in $CLIPROOT/cliprc directory
ru_ru: Использование: %s [опции] [<имяфайла.> ...] опции.: -h, --help эта помощь -H, --help-environment описание переменных окружения -V, --version выводит версию clip -v[<уровень>], --verbose[=<уровень>] устанавливает/увеличивает уровень сообщений отладки -a, --auto-memvar[=1|0] устанавливает режим объявления переменных auto memvar -w, --namespace-warning[=1|0] выводятся предупреждения при неявном определении переменной -e, --exec генерирует выполнимый файл -c, --compile остановка после генерации C кода -g,-b, --debug[=1|0] генерировать отладочную информацию -t, --show-syntax-tree выводит синтаксическое дерево программы -o<name>, --output=<name> устанавливает имя выходного файла -d<name>, --outdir=<name> устанавливает выходной каталог -O, --optimise[=<val>] устанавливает уровень оптимизации -M, --main использовать первое <имяфайла> как стартовую точку программы -n, --nomain не объявлять процедуру с именем файла -p, --pcode генерировать модуль в псевдокоде -l, --c-pcode генерировать модуль C-псевдокода. -s, --shared создать разделяемый объект -r, --shared-exec всегда когда возможно линковать с разделяемыми библиотеками --static static link CLIP libraries to executable --full-static static link all libraries to executable -I<path>, --include-path=<path> добавить каталог для поиска включаемых файлов -L<path>, --library-path=<path> добавить каталог для поиска библиотечных файлов -D<name>, --define=<name> определить макро-имя -D<name=value>, --define=<name=value> определить макро-имя как значение <value> -U[<filename>], --use-std-ch[=<filename>] использовать альтернативное имя стандартного включаемого файла (std.ch) -S<charset>, --source-charset установить исходную кодировку строковых констант -T<charet>, --target-charset установить целевую кодировку строковых констант -P, --preprocess выполнить только проход препроцессора -C, --show-command выводить определения команд -R, --noremove-c не удалять временные '.c' файлы -N, --names выводить предупреждения на использование неопределенных функций -E<name=value>, --environment=<name=value> установить значение переменной окружения -q <word>, --compat=<word> установить режим совместимости с ключевыми словами: no-as-word - значение по умолчанию as-word <имяфайла> файлы для обработки Все вышеприведенные опции могут быть помещены в файл .cliprc в текущем каталоге, в файл $HOME/.cliprc, либо в любой файл в каталоге $CLIPROOT/cliprc

source: %s can accept next environment variables: CC name of C compiler (default=='%s') CFLAGS options for C compiler (default=='%s') COMPILE_FLAG 'compile-only' flag for C compiler (default=='%s') COPT optimisation flag for C compiler (default=='%s') CDBG debug flag for C compiler (default=='%s') OUT_FLAG output flag for C compiler (default=='%s') INCLUDE_FLAG include flag for C compiler (default=='%s') OBJSUF suffix for output object files (default=='%s') SOBJSUF suffix for output shared files (default=='%s') LIBSUF suffix for library files (default=='%s') SLIBSUF suffix for shared library files (default=='%s') SFLAGS options for C compiler - shared version (default=='%s') CLIPLIB runtime support library (default=='%s') CLIPSLIB runtime support shared library (default=='%s') CLIPLIBS additional libs (default=='%s') CLIPROOT root for all clip related files (default=='%s') CLIP_LOCALE_ROOT root for locale messages CLIP_MODULE current locale module (default=='%s') CLIP_CMDSTR comma-separated list of command-line options CLIP_NAMES generate .ex, .nm files (possible values yes/no|on/off|0/1) predefined macros: __FILE__ string - name of current compile file __BASE_FILE__ string - name of root compile file __LINE__ numeric - number of current line in current file __VERSION__ string - version of clip __CLIP__ string - version of clip __SYSTEM__ string - name of operating system __DATE__ string - date in format 'MON DD YYYY' __TIME__ string - current time in format 'HH:MM::SS' __CLIP_MODULE__ string - name of current locale module
ru_ru: %s принимает следующие переменные.окружения: CC программа компилятора C (default=='%s') CFLAGS опции компилятора .C (default=='%s') COMPILE_FLAG флаг 'compile-only' для компилятора C (default=='%s') COPT флаг оптимизации. для компилятора C (default=='%s') CDBG флаг отладки для компилятора C (default=='%s') OUT_FLAG флаг задания выходного файла для компилятора C (default=='%s') INCLUDE_FLAG флаг включения файлов для компилятора C (default=='%s') OBJSUF суффикс для выходных объектных файлов (default=='%s') SOBJSUF суффикс для выходных разделяемых объектных файлов (default=='%s') LIBSUF суффикс для библиотечных файлов (default=='%s') SLIBSUF суффикс для разделяемых библиотек (default=='%s') SFLAGS опции для компилятора C - разделяемая версия (default=='%s') CLIPLIB основная библиотека поддержки времени выполнения (default=='%s') CLIPSLIB разделяемая библиотека поддержки времени выполнения (default=='%s') CLIPLIBS дополнительные библиотеки (default=='%s') CLIPROOT корневой каталог для clip (default=='%s') CLIP_LOCALE_ROOT корневой каталог для локализованных сообщений CLIP_MODULE имя модуля локализации (default=='%s') CLIP_CMDSTR разделенный запятыми список опций командной строки CLIP_NAMES генерировать файлы .ex, .nm (возможны значения yes/no|on/off|0/1) предопределенные макросы: __FILE__ строка - имя текущего файла компиляции __BASE_FILE__ строка - имя корневого файла компиляции __LINE__ число - номер текущей строки в файле компиляции __VERSION__ строка - версия clip __CLIP__ строка - версия clip __SYSTEM__ строка - имя операционной системы __DATE__ строка - текущая дата в формате 'MON DD YYYY' __TIME__ строка - текущее время в формате 'HH:MM::SS' __CLIP_MODULE__ строка - имя текущего модуля локализации

source: cannot open defname file '%s': %s
ru_ru: невозможно открыть файл определений имен '%s': %s

source: cannot open exname file '%s': %s
ru_ru: невозможно открыть файл внешних имен'%s': %s

source: possible not defined function %s
ru_ru: возможно не определена функция %s

source: error
ru_ru: ошибка

source: conflict between -s and -p flags
ru_ru: конфликт между -s и -p флагами

source: conflict between -c and -p flags
ru_ru: конфликт между -c и -p флагами

source: conflict between -n and -m flags
ru_ru: конфликт между -n и -m флагами

source: cannot change to output dir '%s': %s
ru_ru: невозможно установить выходной каталог '%s': %s

source: unknown file type '' file '%s'
ru_ru: неизвестный тип файла '' файл '%s'

source: unknown file type '%s' file '%s'
ru_ru: неизвестный тип '%s' файла '%s'

source: no input files, so use stdin; -h will help
ru_ru: не заданы входные файлы, поэтому используем stdin; попробуйте флаг -h для помощи

source: process file '%s' ..
ru_ru: обрабатывается файл '%s' ..

source: .. done, %s
ru_ru: .. готово, %s

source: parsing file '%s' ..
ru_ru: разбор файла '%s' ..

source: .. done (%d/%d %s, %d %s, %s)
ru_ru: .. готово (%d/%d %s, %d %s, %s)

source: line
ru_ru: строка

source: warning
ru_ru: предупреждение

source: codegen file '%s' ..
ru_ru: генерация кода для файла '%s' ..

source: writing file '%s' ..
ru_ru: запись файла '%s' ..

source: .. done, %ld %s ,%s
ru_ru: .. готово, %ld %s ,%s

source: byte
ru_ru: байт

source: .. done
ru_ru: .. готово

source: compile file '%s' ..
ru_ru: компиляция файла '%s' ..

source: make shared object '%s' ..
ru_ru: делаем разделяемый объект '%s' ..

source: generate reference file '%s' ..
ru_ru: генерируется файл ссылок '%s' ..

source: make file '%s' ..
ru_ru: делаем файл '%s' ..

source: C level error in command: %s
ru_ru: ошибки уровня C в команде.: %s

source: file
ru_ru: файл

source: cannot open output file '%s'
ru_ru: невозможно открыть выходной файл. '%s'

source: cannot write PCODE module with c-texts
ru_ru: невозможно записать PCODE модуль с встроенным c-текстом

source: error writing file '%s', %s
ru_ru: ошибка записи файла '%s', %s

source: cannot open pipe '%s'
ru_ru: невозможно открыть канал '%s'

source: cannot open file '%s': %s
ru_ru: невозможно открыть файл '%s': %s

source: invalid chars in number
ru_ru: неправильные символы в числе

source: newline in string
ru_ru: символ новой строки внутри строки

source: end-of-comment without begin
ru_ru: конец комментария без начала

source: '@}' without '@{'
ru_ru: '@}' без '@{'

source: id: non-matched command '%s'
ru_ru: id: нераспознанная команда '%s'

source: non-matched command '%s'
ru_ru: нераспознанная команда '%s'

source: #else without #ifdef or #ifndef
ru_ru: #else без #ifdef или #ifndef

source: #endif without #ifdef or #ifndef
ru_ru: #endif без #ifdef или #ifndef

source: invalid #define directive
ru_ru: неправильная директива #define

source: macro function redefined
ru_ru: переопределение макро функции

source: macro redefined
ru_ru: переопределение макро

source: invalid macro call
ru_ru: неправильный вызов макро

source: invalid number of macro arguments (%d instead %d)
ru_ru: неправильное число аргументов макро-функции (%d вместо %d)

source: unexpected EOL in SM_ENUM
ru_ru: неожиданный EOL в SM_ENUM

source: bad symbol in SM_ENUM: '%s'
ru_ru: неразрешенный символ в SM_ENUM: '%s'

source: non-balanced '[' in #command
ru_ru: несбалансированная скобка '[' в #command

source: unexpected end of #command directive
ru_ru: неожиданный конец директивы #command

source: cmdstr: newline in string
ru_ru: cmdstr: символ новой строки в строке.

source: too much errors
ru_ru: слишком много ошибок

source: #ifdef or #ifndef without #endif
ru_ru: #ifdef или #ifndef без #endif

source: unterminated string constant (possible begin at line %d pos %d file '%s')
ru_ru: незаконченная строчная константа (возможное начало на строке %d позиция %d файл '%s')

source: unmatched bracket '%c' (possible begin at line %d pos %d file '%s')
ru_ru: непарная скобка '%c' (возможное начало на строке %d позиция %d файл '%s')

source: unclosed comment (possible begin at line %d pos %d file '%s')
ru_ru: незакрытый комментарий (возможное начало на строке %d позиция %d файл '%s')

source: no ENDTEXT
ru_ru: нет ENDTEXT

source: macro function with 0 count of arguments
ru_ru: макро-функция с нулевым числом аргументов

source: no subst marker '%s' in pattern part of command
ru_ru: нет маркера подстановки '%s' в части шаблона команды

source: unmatched bracket '%c'
ru_ru: непарная скобка '%c'

source: bad command definition: OPTION have only literals
ru_ru: неправильное определение команды: OPTION состоит только из литералов

source: endless subst loop detected
ru_ru: найден бесконечный цикл подстановки

source: too many entries in OPTIONAL list: > %d
ru_ru: слишком много вхождений в списке OPTIONAL: > %d

source: bad #include directive
ru_ru: неправильная директива #include

source: cannot open include file '%s': %s
ru_ru: невозможно открыть включаемый файл '%s': %s

source: circular loop in macro/command substitution detected
ru_ru: найден бесконечный цикл макро/командных подстановок

source: set file '%s' charset to '%s'
ru_ru: кодировка файла '%s' установлена в '%s'

source: too long string
ru_ru: слишком длинная строка

source: cannot create dir '%s': %s
ru_ru: невозможно создать каталог '%s': %s

source: cannot create file '%s': %s
ru_ru: невозможно создать файл '%s': %s

source: open locale file '%s'
ru_ru: открыт файл локали '%s'

source: wrote locale message entry '%s'
ru_ru: записано сообщение локализации '%s'

source: wrote plural locale message '%s' '%s'
ru_ru: записано множественное сообщение локализации '%s' '%s'

source: po code too large at line %d
ru_ru: псевдокод слишком длинный начиная со строки %d

source: LOCAL after executable statements
ru_ru: LOCAL после выполнимого оператора

source: STATIC after executable statements
ru_ru: STATIC после выполнимого оператора

source: only constant expression allowed for static variable initialisation
ru_ru: только константное выражение разрешено для инициализации статических переменных

source: MEMVAR after executable statements
ru_ru: MEMVAR после выполнимых операторов

source: FIELD after executable statements
ru_ru: FIELD после выполнимых операторов

source: PARAMETERS and '(' <paramlist> ')' are incompatible
ru_ru: PARAMETERS и '(' <список_параметров> ')' несовместимы

source: init expression not allowed here
ru_ru: выражение инициализации здесь недопустимо

source: array declaration not allowed here
ru_ru: определение массива здесь недопустимо

source: reference to constant
ru_ru: ссылка на константу

source: reference to temporary object
ru_ru: ссылка на временный объект

source: reference to undeclared function '%s' near line %d
ru_ru: ссылка на неопределенную функцию '%s' около строки %d

source: reference to macro not allowed
ru_ru: ссылка на макро не разрешена

source: reference to non-lvalue object
ru_ru: ссылка на не-lvalue объект

source: reference to function with args not allowed
ru_ru: ссылка на функцию с аргументами не разрешена

source: cannot GET constant
ru_ru: невозможен ввод константы через GET

source: assign to non-lvalue
ru_ru: присваивание для не-lvalue

source: reference to macro assign not allowed
ru_ru: ссылка на макро-присваивание не разрешена

source: CTEXT in pcode module
ru_ru: CTEXT в pcode модуле

source: assign to element of local array conflicts with macro
ru_ru: присваивание элементу локального массива конфликтует с макро

source: INCR with non-lvalue
ru_ru: INCR для не-lvalue

source: %s not allowed in CODESTR
ru_ru: %s не допустимо в CODESTR

source: CASE label duplication: '%s' at line %d and '%s' at line %d
ru_ru: повторение метки CASE: '%s' на строке %d и '%s' на строке %d
