Repository: amery/clip-angelo
Catalog: doc/po/doc/localisation.sgml/*.po
Languages: ru

source: CLIP localisation
ru: Локализация CLIP

source: CLIP runtime localisation
ru: Локализация среды выполнения CLIP

source: The LANG environment variable, directory $CLIPROOT/lang
ru: Переменная окружения LANG, каталог $CLIPROOT/lang

source: The CLIP runtime system on program start check existance of some files, and treat it content as environment variables name/value pairs. (See <link linkend="envir">CLIP environment description</link>)
ru: Библиотека времени выполнения CLIP при старте программы провераят наличие некоторых файлов, и использует их содержимое в качестве значений переменных окружения.(См. <link linkend="envir">Переменные окружения CLIP</link>)

source: The first useful file is $CLIPROOT/lang/$LANG, where value of CLIPROOT will be taken from environment, or if there is nothing, from builtin (compiled-in) value, and LANG is a value of environment (also known as locale). If LANG is empty, CLIP check also CHARSET variable.
ru: Первым провераяется файл $CLIPROOT/lang/$LANG, где CLIPROOT берется из переменной окружения, либо использется значение, заданное при компиляции, LANG является значение соответствующей переменной окружения, (известной также как локаль). Если LANG не задана, CLIP проверяет значение переменной окружения CHARSET.

source: Sample $CLIPROOT/lang/ru_RU.KOI8-R file
ru: Пример файла $CLIPROOT/lang/ru_RU.KOI8-R

source: The next file is $CLIPROOT/term/$TERM, where TERM is variable, which identified type of used terminal.
ru: Затем проверяется файл $CLIPROOT/term/$TERM, где TERM является, переменной окружения, которая задает тип используемого терминала.

source: Sample $CLIPROOT/term/linux-console file
ru: Пример файла $CLIPROOT/term/linux-console

source: Keymaps and keymap table generation.
ru: Keymaps. утилиты генерации

source: Keymaps are used in raw keyboard mode, it is possible (for now) on Linux console, and on some kind of terminals, which can be switched into scancode mode by escape sequence.
ru: Keymap используется в режиме "сырой" клавиатуры (работа со скан-кодами), этот режим сейчас доступен на Линукс-консоли, а также на некоторых терминалах (или эмуляторах терминалов), которые могут работать в режиме скан-кодов.

source: CLIP use the same keymaps as Linux kernel, and scancode processing is borrowed from the kernel sources. That means, you can easy add new keymaps and to modify it as required.
ru: CLIP использует те же keymaps, как и ядро Линукса, обработка скан-кодов также во многом заимствована из кода ядра. Это означает, что можно легко добавить новый keymap, а также модифицировать его в случае необходимости.

source: Adding new keymap:
ru: Добавление нового keymap:

source: Copy appropriate keymap from <command>/usr/share/keymaps</command> (on any Linux distribution):
ru: Скопируйте подходящий keymap из каталога <command>/usr/share/keymaps</command> (доступного практически в любом дистрибутиве Linux):

source: Use <command>$CLIPROOT/keymaps/genmap.sh</command> for generation CLIP-readable keymap:
ru: Используйте <command>$CLIPROOT/keymaps/genmap.sh</command> для генерации keymap в формате CLIP:

source: Absolute path warning
ru: Предупреждение относительно полного пути

source: Parameter of <command>genmap.sh</command> must have absolute pathname.
ru: Парамет скрипта <command>genmap.sh</command> должен записан с полным путем (от корня файловой системы).

source: Copy keymap to <command>$CLIPROOT/keymaps</command>:
ru: Скопируйте keymap в <command>$CLIPROOT/keymaps</command>:

source: Charsets, uni-files, utilites for generation
ru: Charsets, uni-файлы, утилиты генерации

source: Charsets are used for recoding terminal input and output, for dealing with terminal pseudographics, to determine the sort order, and for recoding file and database in/out througput.
ru: Charsets используются для перекодирования ввода/вывода на терминал, обработки псевдографики, определения порядка сортировки, а также для перекодирования ввода/вывода в файлы и базы данных.

source: As with keymaps, CLIP use own format for storing charsets, but have utilite for generation from standard charset-to-unicode mapping.
ru: Также как с keymap, CLIP использует свой формат для хранения charset, и предоставляет утилиты для генерации charset из стандартного отображения нужной кодировки в Unicode.

source: Adding new charset:
ru: Добавление нового charset:

source: Copy appropriate charset mapping from <command>/usr/share/consoletrans</command> (on any Linux distribution):
ru: Скопируйте подходящее отображение кодировки из каталога <command>/usr/share/consoletrans</command> (для Linux):

source: Fullness of Unicode mapping
ru: Полнота отображения в Unicode

source: Some Unicode mapping files provide mapping only for part of full 256 symbols in charset. For such exceptions, you probably must manually append absent characters.
ru: Некоторые файлы не содержат отображение для всех 256 символов кодировки. Для таких файлов может понадобиться ручное редактирование.

source: Use the <command>gen_tbl</command> utilite for .tbl file generation:
ru: Используйте утилиту <command>gen_tbl</command> для генерации .tbl файла:

source: Copy .uni and .tbl files to <command>$CLIPROOT/charsets</command>:
ru: Скопируйте .uni и .tbl файлы в <command>$CLIPROOT/charsets</command>:

source: Message translation
ru: Перевод сообщений

source: Gettext and utils for po-files translation
ru: Пакет Gettext и утилиты для работы с .po файлами

source: <firstterm>Gettext</firstterm> is a common package, widely used for message <firstterm>localisation</firstterm>.
ru: <firstterm>Gettext</firstterm> является широко используемым пакетом, предназначенным для локализации сообщений.

source: The <quote>gettext</quote> package have two main parts - the message extraction and preparing utilites, and a library for runtime message handling.
ru: Пакет <quote>gettext</quote> состоит из двух основных частей - утилит для извлечения и форматирования сообщений и библиотеки доступа к сообщениям.

source: CLIP use some <quote>gettext</quote> utilities for message extracting and preparing of message files, but use own code for runtime message handling.
ru: CLIP использует некоторые утилиты <quote>gettext</quote> для подготовки файлов сообщений, но применяет свой собственный код для доступа к сообщениям во время выполнения .

source: CLIP po-files and dirs, clip_msg* utils
ru: CLIP .po файлы и каталоги, утилиты clip_msg*

source: CLIP have number of utilites to make the message handling easier.
ru: CLIP имеет ряд утилит для облегчения работы с сообщениями.

source: Locale message roadmap:
ru: Подготовка локализованных сообщений:

source: Extracting of message and creating the .pot (po-template) file.
ru: Извлечение сообщений и создание .pot (po-template) файлов.

source: For extracting messages from C sources may be used <command>xgettext</command> command from <command>gettext</command> package.
ru: Для извлечения сообщений из C текстов может быть использована утилита <command>xgettext</command> пакета <command>gettext</command> .

source: CLIP automatically extract messages, quoted in [] brackets, and store them in <emphasis>$CLIPROOT/locale/pot/&lt;modulename&gt;/&lt;filename&gt;.pot</emphasis> file.
ru: CLIP автоматически извлекает сообщения, заключенные в скобки [], и записывает их в файл <emphasis>$CLIPROOT/locale/pot/&lt;modulename&gt;/&lt;filename&gt;.pot</emphasis> .

source: The <emphasis>&lt;modulename&gt;</emphasis> determined by CLIP from current working directory name, or may be specified by environment variable <link linkend="envir">CLIP_MODULE</link>.
ru: <emphasis>&lt;modulename&gt;</emphasis> определяется CLIP из имени каталога, в котором расположен исходный файл, либо может быть задан переменной окружения <link linkend="envir">CLIP_MODULE</link>.

source: The <emphasis>&lt;filename&gt;</emphasis> determined from name of compiled file.
ru: <emphasis>&lt;filename&gt;</emphasis> определяется по имени компилируемого файла.

source: Use script <command>clip_msgmerge</command> to merge .pot files from directory $CLIPROOT/locale.pot with translated .po files in directory $CLIPROOT/locale.po.
ru: Используйте скрипт <command>clip_msgmerge</command> для слияния .pot файлов из каталога $CLIPROOT/locale.pot с переведенными .po файлами в каталоге $CLIPROOT/locale.po.

source: <command>clip_msgmerge</command> merge files for all locales in $CLIPROOT/locale.po/&lt;locale&gt;. To add new locale you just need create appropriate directory, for example, $CLIPROOT/locale.po/ru_RU.KOI8-R for locale ru_RU.KOI8-R.
ru: <command>clip_msgmerge</command> сливает файлы для всех локалей в каталоге $CLIPROOT/locale.po/&lt;locale&gt;. Для добавления новой локали нужно только создать нужный каталог, например $CLIPROOT/locale.po/ru_RU.KOI8-R для локали ru_RU.KOI8-R.

source: You must edit created .po files in any text editor, or use specialized po-file editor, like <command>kbabel</command> from KDE suite.
ru: Вы можете отредактировать созданные.po файлы в любом текстовом редакторе, либо использовать специализированный редактор .po-файлов, например <command>kbabel</command> из KDE.

source: Charset definition in .po file.
ru: Задание кодировки в .po файле.

source: Please check the field <quote>Content-Type: text/plain; charset=ASCII</quote> in first entry of .po file. You must set valid value of charset, used in this file (for example, <quote>Content-Type: text/plain; charset=KOI8-R</quote>). This is very important for correct message handling.
ru: Пожалуйста проверьте поле <quote>Content-Type: text/plain; charset=ASCII</quote> в начале .po файла. Вы должны установать правильное значение кодировки, используемой в файле (например, <quote>Content-Type: text/plain; charset=KOI8-R</quote>). Это очень важно для правильной обработки сообщений.

source: And the last step: invoke script <command>clip_msgfmt</command> to format messages into compiled message file in directory $CLIPROOT/locale.mo
ru: И, наконец, запустите скрипт <command>clip_msgfmt</command> чтобы отформатировать сообщения в .mo файл в каталоге $CLIPROOT/locale.mo

source: Now, CLIP runtime will fetch nesessary messages from this files, and substitute it in your program.
ru: Теперь библиотека времени выполнения CLIP сможет извлечь необходимые сообщения из этих файлов и подставить в нужное место программы.

source: Writing and translation the CLIP documentation.
ru: Написание и перевод документации CLIP

source: CLIP project now use the <ulink url="http://www.docbook.org">DocBook</ulink> documentation system to provide multiformat and multilanguage documentation in the strong and regular fasion.
ru: Проект CLIP теперь использует систему документации <ulink url="http://www.docbook.org">DocBook</ulink> для получения многоформатной и многонациональной документации.

source: The good introduction into DocBook is
ru: Хорошее введение в DocBook

source: A simple introduction into DocBook is <link linkend="writing-docbook">here</link>.
ru: Простое введение в DocBook доступно <link linkend="writing-docbook">здесь</link>.

source: CLIP makefiles and .po manipulation utilities
ru: Утилиты CLIP для манипуляции .po файлами.

source: Writing and supporting documentation in more than one language is not so trivial, so we develop some helper programs to make our life a bit easier.
ru: Создание и поддержка документации на нескольких языках является непростой задачей, поэтому мы разработали несколько программ для облегчения нашей жизни.

source: The <command>po_extr</command> utilite process given files and extract all strings, delimited by start and stop strings, into output standard .po file.
ru: Утилита <command>po_extr</command> обрабатывает заданные файлы, извлекает все строки, ограниченные заданными начальной и конечной строками, и выводит стантартный .po файл.

source: By default, as start string used <quote>&#095;&#040;</quote>, and as stop string <quote>&#041;&#095;</quote>.
ru: По умолчанию, в качестве начальной используется строка <quote>&#095;&#040;</quote>, и в качестве конечной <quote>&#041;&#095;</quote>.

source: The companion program is <command>po_subst</command>, which substitute translated values from .po files into source text.
ru: Вторая программа - <command>po_subst</command>, подставляет переведенные строки из.po файла в исходный текст документа.

source: The makefile <command>$CLIPROOT/include/Makefile.tdoc</command> can be used as include to simplify and unificate the documentation building.
ru: Makefile <command>$CLIPROOT/include/Makefile.tdoc</command> может быть использован в качестве включаемого файла для упрощения и унификации процесса создания документации.

source: This file assume, that sources .sgmls are in directory ./template, the translated .po files are in ./po/&lt;sgml-file-name&gt;/*.po, and the output directory will be ./html for HTML output, ./ps for Postscript output, ./pdf for PDF output, ./text for text output.
ru: Этот файл предполагает, что исходные .sgml файлы расположены в каталоге ./template, переведенные.po файлы располагаются в ./po/&lt;sgml-file-name&gt;/*.po, и выходными каталогами являются ./html для вывода HTML ./ps для вывода Postscript, ./pdf для вывода PDF output, ./text для текстового вывода.

source: Provided targets are:
ru: Целями make могут быть:

source: to merge sources and .po translations
ru: для слияния исходных текстов и .po трансляций

source: to produce translated SGML files
ru: для генерации переведенных файлов SGML

source: to generate documentation in HTML format
ru: для генерации документации в формате HTML

source: to generate documentation in Postscript format
ru: для генерации документации в формате Postscript

source: to generate documentation in Adobe PDF format
ru: для генерации документации в формате Adobe PDF

source: to generate documentation in TeX format
ru: для генерации документации в формате TeX

source: to generate documentation in plain text format
ru: для генерации документации в формате простого текста

source: Some CLIP packages already have the <quote>tdoc</quote> directory, which contain documentation in this layout ("template doc, tdoc"), and we have planes make it for all.
ru: Часть пакетов CLIP уже имеет каталог <quote>tdoc</quote> directory, который содержит документацию в этом формате ("template doc, tdoc"), и мы планируем перевести всю документацию в этот формат.
