Repository: amery/clip-angelo
Catalog: doc/po/doc/capi.sgml/*.po
Languages: ru

source: Extend System
ru: Система расширения

source: Really 90% of the CLIP functional capabilities made up on its extend system base.
ru: Практически 90% функциональных возможностей CLIP сделаны на базе его системы расширения

source: The name of jointed function must be begining from "clip_" and then // it must be the name of CLIPPER-function on upper register. // Such names CLIP-compilier put on the special list of the // run-time available functions. // mp is the current CLIP-machine state description; it's better to see its // structure in clip.h directly. // If this function returns 0 there are no error; // if it returns not 0 it is error code.
ru: Название подключаемой функции должно начинаться с "clip_" и далее // название CLIPPER-функции в верхнем регистре. // такие имена CLIP-компилятор помещает в специальный список доступных // в run-time функций. // mp - это описание текущего состояния CLIP-машины, лучше смотрите ее структуру // непосредственно в clip.h // Если эта функция возвращает 0 - то ошибок не произошло, если // не 0 - то это будет код ошибки.

source: We get first parameter as fix length string.
ru: получаем первый параметр в виде строки с конкретной длиной.

source: We get second and third parameter as the automatical converting to int-number
ru: получаем второй и третий параметр в виде числа с автоматическим преобразованием в int - тип

source: it will be retrieved NULL as C-values.
ru: будет получено NULL

source: The execution algorithm itself.
ru: собственно алгоритм обработки

source: It's not necessary to pay your attention to it.
ru: на него можно не обращать внимания

source: The message to CLIP-machine is that function terminates correct.
ru: сообщение CLIP-машине что функция завершилась без ошибок

source: Well, now let's look at such expent functions that you need for the new CLIP capabilities using. If you easy read and write in C it's better to see in clip.h file.
ru: Ну а теперь собственно коротко о тех функциях расширения, которыми надо пользоваться при написании новых возможностей для CLIP.Для тех, кто легко читает и пишет на Си, лучше ознакомиться с файлом clip.h.

source: The passed parameters retrieving functions
ru: Функции получения передаваемых параметров

source: Parameters
ru: Параметры

source: <emphasis>mp</emphasis> is pointing to the current CLIP-machine state description.
ru: <emphasis>mp</emphasis> - указывает на текущее состояние CLIP-машины

source: Description
ru: Описание

source: If
ru: Если

source: <emphasis>mp</emphasis> is pointing to the current CLIP-machine state description
ru: <emphasis>mp</emphasis> - указывает на текущее состояние CLIP-машины

source: <emphasis>num</emphasis> is the position of parameter
ru: <emphasis>num</emhpasis> - позиция параметра в списке параметров

source: <emphasis>mp</emphasis> is pointing to the current CLIP-machine task context
ru: <emphasis>mp</emphasis> - указывает на текущее состояние CLIP-машины

source: <emphasis>len</emphasis> is the parameter length
ru: <emphasis>len</emphasis> - длина передаваемого параметра

source: <emphasis>dec</emphasis> is the parameter precision
ru: <emphasis>dec</emphasis>- точность передаваемого параметра

source: retrieves a numeric value passed as parameter and returns converted to julian-representation date value of parameter with num number
ru: Возвращает значение параметра с номером num, как дату преобразованную в julian - представление

source: <emphasis>yy</emphasis> is pointing to int contained year value
ru: <emphasis>yy</emphasis>-указывает на значение года

source: <emphasis>mm</emphasis> is pointing to int contained month value
ru: <emphasis>mm</emphasis>-указывает на значение месяца

source: <emphasis>dd</emphasis> is pointing to int contained day value
ru: <emphasis>dd</emphasis>-указывает на значение дня

source: <emphasis>ww</emphasis> is pointing to int contained millenium format
ru: <emphasis>ww</emphasis>-указывает на формат столетия

source: <emphasis>n</emphasis> is a numerical expression of type int
ru: <emphasis>n</emphasis> - численное выражение типа int

source: post a int type value to a CLIP return value area
ru: передает значение типа int в область возвращаемых значений CLIP

source: <emphasis>n</emphasis> is a numerical expression of type long
ru: <emphasis>n</emphasis> - численное выражение типа long

source: post a long type value to a CLIP return value area
ru: передает значение типа long в область возвращаемых значений CLIP

source: <emphasis>n</emphasis> is a numerical expression of type double
ru: <emphasis>n</emphasis> - численное выражение типа double

source: post a double type value to a CLIP return value area
ru: передает значение типа double в область возвращаемых значений CLIP

source: <emphasis>len</emphasis> is a string length parameter
ru: <emphasis>len</emphasis> - длина строки

source: <emphasis>dec</emphasis> is a string precision parameter
ru: <emphasis>dec</emphasis> - точность параметра

source: post a double type with len length and dec precision value to a CLIP return value area
ru: возвращает число, преобразовав его из double в формате с длиной len и точностью dec .в область возвращаемых значений CLIP

source: <emphasis>str</emphasis> is a string of type char
ru: <emphasis>str</emphasis> - строка типа char

source: post a string to a CLIP return value area; data from str must be copied before; Str must be released without CLIP-machine taking part!
ru: возвращает строку с длиной len, предварительно скопировав данные из str. Str должна быть освобождена без участия CLIP-машины!

source: post a string with len length; data from str must be copied before; Str must be released without CLIP-machine taking part!
ru: возвращает строку с длиной len, предварительно скопировав данные из str. Str должна быть освобождена без участия CLI-машины!

source: <emphasis>str</emphasis> is pointing to string
ru: <emphasis>str</emphasis> - указатель на строку

source: post a string with len length without the coping of data from str; Str will be released by CLIP-machine when this string be not used more (i.e when number of references on this string will become equal to zero)
ru: возвращает строку c длиной len, без копирования данных из str. Str будет освобождена CLIP-машиной когда эта строка не будет больше использоваться (когда кол-во ссылок на эту строку станет равно 0).

source: <emphasis>l</emphasis> is a numerical expression of type logic
ru: <emphasis>l</emphasis> - численное выражение типа logic

source: post a logic type number to a CLIP return value area
ru: передает значение типа logic в область возвращаемых значений CLIP

source: <emphasis>l</emphasis> is a julian parameter of type long
ru: <emphasis>l</emphasis> - julian параметр типа long

source: post a julian format date to a CLIP return value area
ru: передает значение типа julian в область возвращаемых значений CLIP

source: <emphasis>yy</emphasis> is a parameter contained year
ru: <emphasis>yy</emphasis> - значение года

source: <emphasis>len</emphasis> is a parameter contained month
ru: <emphasis>len</emphasis> - значение месяца

source: <emphasis>dec</emphasis> is a parameter contained day
ru: <emphasis>dec</emphasis> - значение дня

source: post a year,month,day format date to a CLIP return value area
ru: передает значение года,месяца,дня типа date в область возвращаемых значений CLIP

source: The hash-codes evaluation functions
ru: Функции вычисления hash-кодов

source: Hash-codes are used everwhere in CLIP-machine, hence there is necessity to evaluate them often.
ru: hash-коды постоянно используются в CLIP-машине,поэтому часто возникает необходимость их вычисления.

source: The run-time errors generation functions
ru: Функции генерации run-time ошибок

source: For the more insighting to the "error" entity read the error class description.
ru: Для более полного понимания сущности "ошибка" читайте описание класса error

source: <emphasis>genCode</emphasis> is an error code number
ru: <emphasis>genCode</emphasis> - номер кода ошибки

source: <emphasis>canDefault</emphasis> indicates if default recovery is available
ru: <emphasis>canDefault</emphasis> - указывает, возможно ли восстановить по умолчанию

source: <emphasis>canRetry</emphasis> indicates if a retry is possible after an error
ru: <emphasis>canRetry</emphasis> - указывает, воможен ли перезапуск после ошибки

source: <emphasis>subSystem</emphasis> is character describtion of the subsystem generation the error
ru: <emphasis>subSystem</emphasis> - символьное описание подсистемы, сгенерировавшей ошибку

source: <emphasis>subCode</emphasis> is subsystem-cpecific error code number
ru: <emphasis>subCode</emphasis> -номер кода ошибки подсистемы

source: <emphasis>operation</emphasis> is character describtion of the failed operation
ru: <emphasis>operation</emphasis> - символьное описание операции, сгенерировавшей ошибку

source: In more simple cases one can use:
ru: Могут быть использованы также :

source: The static data operating functions
ru: Функции управления статическими данными

source: store
ru: сохраняет

source: data with
ru: данные с

source: identificator, the best way to generate it is to use
ru: идентификатором; для его генерации лучше всего использовать

source: functions. A memory for
ru: функции. Память для

source: must be allocated explicitly.
ru: должна быть выделена явно.

source: <emphasis>destroy</emphasis> is the destroy function
ru: <emphasis>destroy</emphasis> - функция уничтожения

source: set a function of the memory release for the static data with a
ru: набор функций освобождения памяти для статических данных с

source: <emphasis>hash</emphasis> is the identificator of item data
ru: <emphasis>hash</emphasis> - идентификатор данных item

source: release the memory for
ru: освобождает память для

source: destroy all information about
ru: уничтожает всю информацию о

source: return pointer to
ru: возвращает указатель на идентифицируемую

source: identificator memory
ru: - ем область памяти

source: The containers operating functions
ru: Функции управления контейнерами

source: Container is a one more way to store the static data. For example it's difficalt to return any C-pointer on structure to CLIP-machine:
ru: Контейнер - это еще одно средство для хранения статических данных. Например, в CLIP-машину трудно вернуть какой-нибудь Си-указатель на структуру:

source: Where the pointer "FILE * fh" mast be put to? Well known that return value in clipper-function <command>fopen()</command> is simple number. And for instance what about structure of open connection whith ORACLE,MYSQL etc? It's desired to operate with a number inside of CLIP-application. To store that structures a container is intend for.
ru: Что делать с указателем "FILE * fh"? А ведь в clipper-функции <command>fopen()</command> возвращаемое значение - простое число.Или, например, структура открытого соединения с ORACLE,MYSQL и т.п. Также желательно внутри clip-программы оперировать числом.Вот именно для хранения таких структур и предназначен контейнер.

source: <emphasis>cm</emphasis> is pointing to the current CLIP-machine task context
ru: <emphasis>cm</emphasis> - указывает на текущее состояние CLIP-машины

source: is a stored information type (it's for impossibility to set file number instead of connection one)
ru: - тип хранимой информации (необходимо для исключения возможности поставить номер файла вместо номера соединения).

source: fetch item object with key number
ru: загружает объект item с номером key

source: destroy item object with key number
ru: уничтожает объект item с номером key

source: is a stored structure destroy/close function
ru: - функция уничтожения/закрытия хранимой структуры.

source: store item object with key number
ru: сохраняет объект item с номером key

source: The CLIP function/procedure calling from C
ru: Вызов функции/процедуры, написанной на CLIPе, из C

source: is pointing to a current CLIP-machine task context
ru: указывает на текущее состояние CLIP-машины

source: is a function name in CLIP
ru: имя функции на CLIP

source: is a number of arguments
ru: - число аргументов

source: is pointing to array of argc ClipVar type elements
ru: - указывает на массив из argc элементов типа ClipVar

source: is a pointer to stack cell in wich returned value will be located. One can use macros RETPTR to get that pointer.
ru: - указатель на ячейку стека в который будет помещено возвращаемое значение

source: For example :
ru: Например:

source: RETPTR is macros that returns pointer to
ru: RETPTR - макрос, возращает указатель

source: stack cell returned value will be in
ru: на ячейку стека, в которой будет возвращаемое значение

source: to be on a safe side
ru: на всякий случай

source: first argument is a string ("Baby")
ru: первый аргумент - строка ("Baby")

source: element s of union ClipVar is for strings
ru: элемент s юниона ClipVar - для строк

source: second argument is number
ru: второй - число

source: element n of union ClipVar is for numbers
ru: элемент n юниона ClipVar - для чисел

source: The CLIP dynamics loading modules creating
ru: Создание динамически загружаемых модулей для clip

source: And it's possible to write the same loading module in C in such way:
ru: Написать на Си такой же загружаемый модуль можно таким способом:

source: Then this module is compilied
ru: Затем этот модуль компилируется

source: Other features
ru: Другие возможности

source: In addition to described above there are much more functions in C-API to operate whith arrays, objects, input-output process, code blocks calling and others.
ru: Кроме описанных выше в C-API существует множество других функций для работы с массивами, объектами, процессами ввода-вывода, вызовами кодовых блоков и многое другое.
