Repository: amery/clip-angelo
Catalog: doc/po/doc/codb.sgml/*.po
Languages: ru

source: For better understanding of this document it is necessary to read sections of the documentation <link linkend="leintroduction">language extensions</link> and especially attentively the chapter <link linkend="leoomodel">OO-model</link>. If you won't understand them - further reading has no sense.
ru: Для более точного понимания этого текста необходимо прочитать разделы документации <link linkend="leintroduction">расширения языка </link> и особенно внимательно раздел<link linkend="leoomodel">ОО-модель</link>. Если вы там ничего не поймете - дальше лучше не читать вообще, потому-что вопросов будет больше чем знаний.

source: <command>CODB</command> consists of the dictionary ( metadata storehouse ) and a number of depositories for data objects.
ru: <command>CODB</command> состоит из словаря (хранилище метаданных) и нескольких депозитариев для хранимых объектов.

source: <command>CODB</command> is not OO storehouse as it is in classical OO-programming (C ++, SmallTalk...). <command>CODB</command> is an object database, i.e. storehouse of objects with some OO elements.
ru: <command>CODB</command> не является объектно ориентированным хранилицем как это принято в классическом ОО программировании (C++,SmallTalk,...). CODB - это объектная база данных, т.е. хранилище объектов с некоторыми элементами ориентированности.

source: In particular, the "private" properties is not supported - for the simple reason that <command>CODB</command> core must know about all properties of an object. But instead of "private" there is an opportunity to store objects with properties, which aren't described in metadata.
ru: В частности не поддерживаются "private" аттрибуты, по той простой причине, что ядро ОБД должно знать обо всех свойствах объекта. Но вместо "private" имеется возможность хранения объектов с неописанными в метаданных атрибутами.

source: Thus, if the object with extra properties will be stored, using the method method depository:append(obj), all those extra properties will be kept completely, but the type checking, content checking and indexation will not work for them.
ru: Т.е. если в метод depository:append(obj) будет передан объект с лишними аттрибутами, то такой объект будет сохранен полностью как есть, но контроль типов и содержимого лишних атрибутов, а также индексация производится не будет.

source: While reading such an object all properties will be accessible and the programmer is fully responsible for the content of those extra properties. If he will not describe them in the documentation, they may be considered as "private" :).
ru: При чтении такого объекта он будет выдан тоже полностью и всю отвественность за содержимое лишних аттрибутов берет на себя прикладной программист. Если он их не опишет в своей документации, значит эти аттрибуты будут считаться "private" :)

source: Inheritance is supported, but only from one superclass, and the properties and indexes are inherited only.
ru: Наследование имеется, но только от одного суперкласса, и наследуется только состав аттрибутов и индексов. .

source: Polymorphism currently is not supported, because object methods are not kept. Possibly, the following versions of <command>CODB</command> will support object methods keeping and polymorphism. Currently only event handlers ( analogues of triggers in RDBMS ) are available - it is possible to realize polymorphism partially using them, if necessary.
ru: Полиморфизм не поддерживается, потому-что методы объектов в настоящее время не хранятся, возможно в следующих версиях CODB будет поддерживать и методы и полиморфизм. В настоящее время имеются только обработчики событий(аналоги триггеров в РСУБД), при необходимости некоторую часть полиморфизма можно реализовать через них.

source: Main concepts:
ru: Понятия:

source: Class
ru: Класс

source: the set of substances with identical properties
ru: совокупность сущностей с одинаковыми свойствами.

source: Object
ru: Объект

source: the substance belonging to any class
ru: сущность принадлежащая какому-то классу.

source: The stored object
ru: Хранимый объект

source: object which is kept in storehouse, there is other name for such objects - "permanent" or "constant"
ru: объект предметной области, есть другое название таких объектов - "перманентный" или "постоянный".

source: The comment:
ru: Комментарий:

source: In some ODB, especially based on C ++, the metadata are not permanent. In such ODB metadata are known only at compile time and are not kept in dictionaries. In <command>CODB</command> both metadata and the stored data are permanent because they are kept in DB and are accessible at run-time
ru: В некоторых ODB, особенно основанные на C++, метаданные не являются перманентными. В таких ODB метаданные известны только во время компиляции и не хранятся в словарях. В <command>CODB</command> и метаданные и хранимые данные являются перманентными, потому-что храняться в БД и доступны во время выполнения.

source: Property
ru: Свойство

source: a part of an object, the attribute of an object, it may be of any type
ru: часть объекта, хранящая данные какого-то типа.

source: Method
ru: Метод

source: a program code which an object may execute
ru: действие, которое может производить объект.

source: Metadata
ru: Метаобъект

source: objects which describes the structure of other objects
ru: объект, описывающий характеристики других объектов.

source: Dictionary
ru: Словарь

source: storehouse of metadata
ru: хранилище метаданных

source: Depository
ru: Депозитарий

source: a place where stored objects are kept ( the structure of these objects is described in the dictionary )
ru: место для хранимых объектов, структура которых описана в словаре.

source: Essence
ru: Суть

source: a string which describes the content of stored object
ru: строкове значение, по которому можно легко понять содержимое хранимого объекта.

source: Extent
ru: Пространство

source: a part of depository for storage of related objects belonging to different classes. The fragmentation of depositry on extents depends on the essence of the whole data kept, the number of stored objects, their relations etc. It is defined at a design time
ru: часть депозитария, предназначеная для хранения родственных объектов,принадлежащих разным классам. Разбивка депозитария на пространства зависит от предметной области, количества хранимых объектов, похожести объектов и, возможно, другим параметрам. Определяется на этапе проектирования предметной области.

source: If to consider these concepts from the point of RDBMS:
ru: Если рассматривать эти понятия с точки зрения РСУБД, то:

source: a place where descriptions of databases, tables, fields, users, views, triggers and others is stored
ru: место хранения описаний БД,таблиц,полей,пользователей, представлений,триггеров и других данных, требуемых для работы SQL-сервера

source: the data used by RDBMS for the internal needs
ru: данные используемые SQL-сервером для своих внутренних нужд.

source: database
ru: база данных

source: this concept is not present in RDBMS, but it may be a part of database, which keeps some tables. For example, tables which names begins with a letter "A", a letter "B", .....
ru: этого понятия в РСУБД нет, но, например, это может быть часть БД, которая хранит несколько таблиц. Например, таблицы, имена которых начинаются на букву "A",на букву "B",.....

source: the table
ru: таблица

source: a record of the table
ru: строка таблицы

source: a field of a record
ru: часть строки таблицы, поле записи.

source: Specification
ru: Основные понятия

source: Theoretically <command>CODB</command> may keep the data in any low level storehouse: TXT, SDF, XML, DBF, SQL, others ODB, CORBA... At the present time only a driver for DBF+CDX files is implemented. The driver is written on CLIP, it's sources are about 60k.
ru: Теоретически <command>CODB</command> может хранить данные в любом низкоуровневом хранилище данных: TXT,SDF,XML,DBF,SQL, других ODB, CORBA,...В настоящий момент реализован только драйвер для хранения объектов в DBF+CDX файлах. Драйвер написан на CLIP и занимает примерно 60k исходного текста.

source: Identification of all objects is global, i.e. using the identifier of an object it is possible to determine the dictionary and depository it is related to. The length of the identifier of an object is defined at compile time, the configuration is in codbcfg.ch. In a standard configuration the identifier of any object ( meta or stored ) occupies 12 bytes and consists of:
ru: Идентификация всех объектов глобальная, т.е. по идентификатору объекта можно определить к какому словарю и депозитарию он относится.Длина идентификатора объекта определяется на этапе компиляции, конфигурация находится в codbcfg.ch. В стандартной конфигурации идентификатор любого объекта(мета или хранимого) занимает 12 байт и состоит из:

source: The identifier of the dictionary - 5 bytes.
ru: идентификатор словаря - 5 байт

source: The identifier of the depository - 2 bytes.
ru: идентификатор депозитария - 2 байта

source: The identifier of an object in depository - 5 bytes.
ru: идентификатор объекта в депозитарии - 5 байт.

source: Only Latin letters and digits are used in the identifier, so the number of dictionaries is no more than 32^5 = 2^25 = ~32 000 000. At each dictionary there may be 32^2 = ~1000 depositories. The number of extents inside the depository is limited only by the number of files in the directory or number of tables supported by RDBMS. The number of objects in one depository is no more than 32^5 = ~32 000 000.
ru: В идентификаторе используются только читаемые английские символы и цифры,поэтому кол-во словарей ограничено 32^5 = 2^25 = ~32 000 000 словарей. У каждого словаря может быть 32^2 = ~1000 депозитариев. Количество пространств внутри депозитария практически неограничено, ограниченотолько кол-вом файлов в каталоге или кол-вом таблиц в БД SQL-сервера. Количество объектов в одном депозитарии ограничено 32^5 = ~32 000 000.

source: The speed of objects recording to the database using the DBF driver is about 200 per second ( Celeron 400/128M ), it depends on the size of object slightly. The speed of reading without caching is about 2000 per second. If an application server and objects caching will be used, the speed of reading will increase presumably in 3-4 times.
ru: Скорость записи объектов на Cel400/128M в БД с драйвером DBF около 500в секунду, немного зависит от размера объекта. Скорость чтения безкеширования 3000 в секунду. В случае, если сделать сервер приложений и включить кеширование объектов, скорость чтения возрастет предположительно раза в 3-4.

source: Metadata classes
ru: Классы метаданных:

source: Metadata it is objects what describe other object and so objects needdes to control of ODB kernel.
ru: Метаобъекты - это объекты, описывающие структуры хранимых объектов. А также объекты, необходимые для управления работой ядра ОБД.

source: Any metadata have obligatory attribute <![CDATA[<ID>]]>. This attribute use for access to keeping objects. <![CDATA[<ID>]]> created ODB kernel when object append to dictionary.
ru: Любой метаобъект (а также и любой хранимый объект) имеет обязательный аттрибут <![CDATA[<ID>]]>, по которому производится чтение метаобъекта или хранимого объекта.<![CDATA[<ID>]]> присваивается ядром ОДБ при добавлении метаобъекта в словарь.

source: The metadata counts and names are limited and determine by ODB kernel. The dictionary have object only classes:
ru: Количество и названия метаклассов, хранимых в словаре строго ограничено и определяется ядром ОБД. Никакие другие метаклассы, кроме описанных ниже, хранится в словаре не могут.

source: In the dictionary mast be at least one object of each metaclass.
ru: В словаре должен быть хотя бы один объект каждого метакласса, для того чтобы появилась возможность работать с хранимыми объектами.

source: the description of metadata "depository"
ru: описание метаобъекта "depository"

source: Attributes:
ru: Атрибуты:

source: ID - metadata identifier
ru: ID - идентификатор метаобъекта

source: NAME - depository name
ru: NAME - название депозитария

source: Example: create DEPOSIT metadata
ru: Пример создания метаобъекта DEPOSIT

source: the description of metadata "extent"
ru: описание метаобъекта "пространство"

source: NAME - extent name
ru: NAME - название пространства

source: HELP - description
ru: HELP - описание

source: Example: create EXTENT metadata
ru: Пример создания метаобъекта EXTENT

source: the attribute description of keeping object
ru: описание аттрибута хранимого объекта

source: NAME - keeping object attribute name
ru: NAME - имя аттрибута хранимого объекта

source: TYPE - keeping object attribute type
ru: TYPE - тип аттрибута хранимого объекта

source: LEN - length
ru: LEN - длина

source: DEC - characters after point (for numeric attributes)
ru: DEC - знаков после точки для числовых аттрибутов

source: LENTYPE - formatting type (for string attributes)
ru: LENTYPE - тип форматирования строковых аттрибутов

source: REF_TO - class identifier (for attributes with type "R") if empty, then reference to object any classes
ru: REF_TO - идентификатор класса для аттрибутов типа "R", на объекты которого могут ссылатся, если не заполнен то ссылка может быть на объект любого класса.

source: DEFVALUE - the value by default
ru: DEFVALUE - значение по умолчанию

source: The TYPE values:
ru: Возможные значения TYPE

source: "C" - characters string with limit by length
ru: "C" - строка символов с ограничением по длине

source: "N" - numeric
ru: "N" - число

source: "D" - date
ru: "D" - дата

source: "L" - logical
ru: "L" - логическое значение

source: "M" - characters string without limit by length
ru: "M" - строка символов без ограничения по длине

source: "O" - object
ru: "O" - объект

source: "X" - any data of simple type: string, numeric, date, logical, reference
ru: "X" - любые данные примитивного типа: строка, число, дата, логическое, ссылка.

source: "R" - reference to object
ru: "R" - ссылка на объект

source: "S" - reference to class
ru: "S" - ссылка на класс

source: "A" - array of reference
ru: "A" - массив ссылок, может хранить не только ссылки, в этом случае содержимое контролируется прикладным программистом

source: "B" - code block
ru: "B" - исполняемый блок кода

source: 1 - "As is"
ru: 1 - "As is", ядро ОБД не будет ничего менять

source: 2 - "Right trim"
ru: 2 - "Right trim", при записи хранимых объектов в таких аттрибутах будут удалены хвостовые пробелы

source: 4 - "Right pad length"
ru: 4 - "Right pad length", при записи объектов содержимое аттрибута будет дополнено пробелами до указанной длины.

source: Example: create ATTR metadata
ru: Пример создания метаобъекта ATTR

source: the counter description
ru: описание счетчиков

source: the index description
ru: описание индексируемых выражений

source: NAME - index name
ru: NAME - название индекса

source: EXPR - index expression
ru: EXPR - выражение

source: Example: create INDEX metadata
ru: Пример создания метаобъекта INDEX

source: the structure description
ru: описание структуры хранимого объекта

source: NAME - keeling object name
ru: NAME - имя хранимого класса

source: SUPER_ID - super class identifier
ru: SUPER_ID - идентификатор супер класса

source: EXTENT_ID - extent identifier
ru: EXTENT_ID - идентификатор пространства, в который записывать хранимые объекты

source: EXPR_ESSENCE - expression for short appeares
ru: EXPR_ESSENCE - выражение для короткого представления содержимого хранимого объекта

source: UNSTABLE - the characteristic of object stably (service parameter)
ru: UNSTABLE - находятся ли хранимые объекты в стабильном состоянии, служебный аттрибут используется ядром ОБД

source: ATTR_LIST - array of attribute identifiers
ru: ATTR_LIST - массив идентификаторов аттрибутов

source: IDX_LIST - array of index identifiers
ru: IDX_LIST - массив идентификаторов индексов

source: Example: create CLASS metadata
ru: Пример создания метаобъекта CLASS

source: the table column description
ru: описание колонок таблицы

source: the table view description
ru: описание таблиц

source: the report description
ru: описание отчетов

source: the plugins modules description
ru: описание подключаемых модулей

source: the user description
ru: описание пользователя

source: the description of users group
ru: описание группы пользователя

source: Controling classes.
ru: Управляющие классы.

source: There are three classes for creation and management of dictionaries and depositories:
ru: Для создания и управления содержимым собственных словарей и депозитариев програмным способом используются три класса:

source: <link linkend="classCODBLIST">CODBLIST </link> - handles the list of accessible dictionaries.
ru: <link linkend="classCODBLIST">CODBLIST </link> -управляет списком доступных словарей.

source: <link linkend="classCODBDICTIONARY">CODBDICTIONARY</link> - handles the content of the dictionary.
ru: <link linkend="classCODBDICTIONARY">CODBDICTIONARY</link> - управляет содержимым словаря (метаобъектами).

source: <link linkend="classCODBDEPOSITORY">CODBDEPOSITORY</link> - handles the content of depository.
ru: <link linkend="classCODBDEPOSITORY">CODBDEPOSITORY</link> - управляет содержимым хранилища объектов.

source: And one service class:
ru: И один сервисный класс:

source: <link linkend="classCODBIDLIST">CODBIDLIST</link> - a service class for a work with stored objects in navigating style.
ru: <link linkend="classCODBIDLIST">CODBIDLIST</link> -сервисный класс для работы с хранимыми объектами в навигационном стиле.

source: Examples
ru: Например

source: The first full example of using the <command>CODB</command> (prg/udb/sample/my001.prg), it is for the subsequent descriptions of classes were visible in a whole. To execute it you need to build the program with the command " clip-eslM my001.prg-lclip-codb "
ru: Первый полный пример использования <command>CODB</command> (prg/udb/sample/my001.prg). Пример приведен для того, чтобы последующие описания классов были видны в комплексе.Для его запуска надо собрать программу командой"clip -eslM my001.prg -lclip-codb" .

source: Utilities
ru: Утилиты

source: There are two utilities:
ru: Существует две утилиты:

source: codb_make - to creat dictionaries and depositories using the description in XML format.
ru: codb_make - для создания словарей и депозитариев посредством описания в XML формате без программирования.

source: codb_ab - to work with dictionaries, etc. in an interactive mode.
ru: codb_ab - для работы со словарями и т.п. в интерактивном режиме.
