Repository: amery/clip-angelo
Catalog: clip/locale.po/*.8859-1/clip.po
Languages: pt_br

source: cannot load charset '%s': %s
pt_br: não se pode carregar o conjunto de caracteres '%s': %s

source: no access to file '%s': not a regular file
pt_br: sem acesso ao arquivo '%s': não é um arquivo regular

source: no access to file '%s': %s
pt_br: sem acesso ao arquivo '%s': %s

source: locale settings not found for module '%s'
pt_br: parâmetros de regionalização para o módulo '%s' não encotrados

source: no access to locale file '%s': %s
pt_br: sem acesso ao arquivo de regionalização '%s': %s

source: cannot open locale file '%s': %s
pt_br: não foi possível abrir o arquivo de regionalização '%s': %s

source: open locale file '%s', charset '%s'
pt_br: aberto o arquivo de regionalização '%s' com caracteres '%s'

source: cannot stat locale file '%s': %s
pt_br: arquivo de regionalização '%s': %s não encontrado

source: cannot read locale file '%s': %s
pt_br: arquivo de regionalização '%s': %s não pode ser lido

source: wrong magic number of locale file '%s'
pt_br: erro de identificador do arquivo de regionalização '%s'

source: illegal revision of locale file '%s': %d
pt_br: revisão ilegal do arquivo de regionalização '%s': %d

source: syntax error: cannot back up
pt_br: erro de sintaxe: não tem retorno

source: EXTERN after executable statements
pt_br: EXTERN após comandos executáveis

source: EXIT statement out of loop
pt_br: comando EXIT fora do loop

source: LOOP statement out of loop
pt_br: comando LOOP fora do loop

source: please, use IIF function (not IF) on operator level to avoid conflicts
pt_br: por favor, use a função IIF (não IF) no nivel de operador para evitar conflitos

source: unclosed BEGIN SEQUENCE
pt_br: comando BEGIN SEQUENCE não terminada

source: invalid array call
pt_br: chamada de matriz (array) inválida

source: only inline assign := allowed in initialisation
pt_br: inicialização somente é permitida com o comando :=

source: name '%s' duplication
pt_br: nome '%s' duplicado

source: parse error; also virtual memory exhausted
pt_br: erro de análise; e memória virtual esgotada

source: parse error
pt_br: erro de análise

source: parser stack overflow
pt_br: estouro de pilha do analizador (overflow)

source: cannot open file '%s'
pt_br: o arqhivo '%s' não pode ser aberto

source: executable operator outside of function (-n flag is active)
pt_br: operador executável fora da função (opção -n está ativa)

source: in file '%s', included at line %d
pt_br: no arquivo '%s', incluído na linha %d

source: in file '%s'
pt_br: no arquivo '%s'

source: working directory : '%s'
pt_br: diretório de trabalho : '%s'

source: error %d:
pt_br: erro %d:

source: line %ld pos %ld (yychar=%d, '%c')
pt_br: linha %ld posição %ld (yychar=%d, '%c')

source: error %d, (yychar=%d)
pt_br: erro %d, (yychar=%d)

source: warning %d:
pt_br: CUIDADO (advertência) %d:

source: line %ld, pos %ld,
pt_br: linha %ld, posição %ld,

source: warning %d,
pt_br: CUIDADO (advertência) %d:

source: unclosed loop statement (level %d, begin at line %d file %s)
pt_br: comando LOOP não fechado (nível %d, início na linha %d arquivo %s)

source: unclosed IF statement (level %d, begin at line %d file %s)
pt_br: comando IF não fechado (nível %d, início na linha %d arquivo %s)

source: unclosed SEQUENCE statement (level %d, begin at line %d file %s)
pt_br: comando SEQUENCE não fechado (nível %d, início na linha %d arquivo %s)

source: duplicate name '%s', previous name defined near line %d pos %d in file '%s'
pt_br: nome '%s' duplicado, primeira definição na linha %d posição %d no arquivo '%s'

source: declaration function with module name '%s'; force -n flag
pt_br: declaração de função com nome de módulo '%s'; precisa opção -n

source: function '%s' already defined near line %d file %s
pt_br: função '%s' já definida na línha %d do arquivo %s

source: static function '%s' already declared as external
pt_br: função estática '%s' já declarada como externa

source: macro variable name not allowed here
pt_br: nome de variable macro no permitida aquí

source: name '%s' already declared as LOCAL near line %d pos %d file '%s'
pt_br: nome '%s' já declarado como LOCAL na linha %d na posição %d do arquivo '%s'

source: name '%s' already declared as PARAMETER near line %d pos %d file '%s'
pt_br: nome '%s' já declarado como PARAMETER na linha %d na posição %d do arquivo '%s'

source: name '%s' already declared as MEMVAR near line %d pos %d file '%s' (previous name will be hidden)
pt_br: nome '%s' já declarado como MEMVAR na linha %d na posição %d do arquivo '%s' (nome anterior será escondido)

source: name '%s' already declared as FIELD near line %d pos %d file '%s'
pt_br: nome '%s' já declarado como FIELD na linha %d na posição %d no arquivo '%s'

source: name '%s' already declared as STATIC near line %d pos %d file '%s'
pt_br: nome '%s' já declarado como STATIC na linha %d na posição %d no arquivo '%s'

source: namespace of name '%s' undeclared, assumed as FIELD-MEMVAR
pt_br: tamanho do nome '%s' não declarado, assumido como FIELD-MEMVAR

source: file '%s' table:
pt_br: arquivo '%s' tabela:

source: read module %s: %ld bytes
pt_br: lido o módulo %s: %ld bytes

source: read file '%s': %d modules
pt_br: lido arquivo '%s': %d módulos

source: write file '%s', %d func
pt_br: gravado o arquivo '%s', %d func

source: done, %ld bytes
pt_br: terminado, %ld bytes

source: write file '%s'
pt_br: gravado o arquivo '%s'

source: set source charset to %s
pt_br: selecionada a tabela fonte de caracteres %s

source: set target charset to %s
pt_br: selecionada a tabela destino de caracteres %s

source: invalid argument for -E: '%s'
pt_br: argumento inválido para -E: '%s'

source: invalid compatability word: '%s' possible values: as-word, no-as-word
pt_br: compatibilidade para word inválida: '%s' valores possíveis: as-word, no-as-word

source: try '%s --help' for options details
pt_br: tente '%s --help' para ter detalhes de opções

source: Usage: %s [options] [<filename> ...] options: -h, --help this help -H, --help-environment help about acceptable environment variables -V, --version print clip version -v[<level>], --verbose[=<level>] set/increase verbose level -a, --auto-memvar[=1|0] set auto memvar variables mode -w, --namespace-warning[=1|0] set warning about implicit var declaration -e, --exec generate executable file -c, --compile stop after generation C code -g,-b, --debug[=1|0] generate debug info -t, --show-syntax-tree print program syntax tree -o<name>, --output=<name> set output file name -d<name>, --outdir=<name> set output directory -O, --optimise[=<val>] set optimisation level -M, --main use first <filename> as start program point -n, --nomain don't declare module procedure -p, --pcode generate pseudocode module -l, --c-pcode compile C-pseudocode module -s, --shared compile into shared object -r, --shared-exec always when possible link with shared libraries --static static link CLIP libraries to executable --full-static static link all libraries to executable -I<path>, --include-path=<path> add include search path -L<path>, --library-path=<path> add library path -D<name>, --define=<name> define macro name -D<name=value>, --define=<name=value> define macro name as <value> -U[<filename>], --use-std-ch[=<filename>] use alternate (or none) standard include file (default==std.ch) -S<charset>, --source-charset define source charset of string constants -T<charet>, --target-charset define target charset of string constants -P, --preprocess preprocess only -C, --show-command print command definitions -R, --noremove-c do not remove temporary '.c' files -N, --names warning on unresolved function names (see CLIP_NAMES envar) -E<name=value>, --environment=<name=value> exact to set same environ variable(see -H for details) -q <word>, --compat=<word> set syntax compatability modes: no-as-word - default value as-word <filename> files to process all above options may be placed in .cliprc file in current directory, in $HOME/.cliprc file, or in any file in $CLIPROOT/cliprc directory
pt_br: Uso: %s [opções] [<arquivo> ...] opções: -h, --help esta ajuda -H, --help-environment ajuda sobre variáveis de ambiente aceitas -V, --version mostrar a versão do clip -v[<nivel>], --verbose[=<nivel>] ativar/incrementar o nivel de menssagens -a, --auto-memvar[=1|0] ativar modo de variáveis memvar automático -w, --namespace-warning[=1|0] avisar sobre declaração implícita de variáveis -e, --exec gerar arquivo executável -c, --compile parar após a geração do código C -g,-b, --debug[=1|0] gerar informação de depuração (debug) -t, --show-syntax-tree mostrar a árvore de sintaxe de programação -o<name>, --output=<name> define o nome do arquivo de saída -d<name>, --outdir=<name> define o diretório de destino -O, --optimise[=<val>] nivel de otimização -M, --main usar o primeiro <arquivo> como programa inicial -n, --nomain não declarar o nome do módulo automaticamente -p, --pcode gerar módulo de pseudocódigo -l, --c-pcode compilar módulo de pseudocódigo-C -s, --shared compilar como objeto compartilhado -r, --shared-exec sempre que possível ligar a bibliotecas compartilhadas --static compilar como biblioteca estática para o executável --full-static compilar com todas as bibliotecas estáticas -I<path>, --include-path=<path> adicionar caminho de pesquisa em "include" -L<path>, --library-path=<path> adicionar caminho de pesquisa em "library" -D<nome>, --define=<nome> definir <nome> como macro -D<nome=valor>, --define=<nome=valor> definir a macro <nome> como igual a <valor> -U[<arquivo>], --use-std-ch[=<arquivo>] usar outro ou nenhum arquivo padrão de inclusão include (padrão = std.ch) -S<charset>, --source-charset definir fonte de caracteres padrão de constantes de texto de origem -T<charset>, --target-charset definir fonte de caracteres padrão de constantes de texto de destino -P, --preprocess somente pré-processar -C, --show-command imprimir definições de comandos -R, --noremove-c não remover arquivos '.c' temporários -N, --names avisar nomes de funções não resolvidas (ver CLIP_NAMES envar) -E<nome=valor>, --environment=<nome=valor> definir variável de ambiente <nombre> como <valor> (ver -H para detalhes) -q <palavra>, --compat=<palavra> define sintaxe de modo de compatibilidade: no-as-word - valor por defecto as-word <arquivo> nomes de arquivos a processar todas las opções anteriores podem ser colocadas em um arquivo .cliprc no diretório atual, em $HOME/.cliprc, ou em qualquer arquivo no diretório $CLIPROOT/cliprc

source: %s can accept next environment variables: CC name of C compiler (default=='%s') CFLAGS options for C compiler (default=='%s') COMPILE_FLAG 'compile-only' flag for C compiler (default=='%s') COPT optimisation flag for C compiler (default=='%s') CDBG debug flag for C compiler (default=='%s') OUT_FLAG output flag for C compiler (default=='%s') INCLUDE_FLAG include flag for C compiler (default=='%s') OBJSUF suffix for output object files (default=='%s') SOBJSUF suffix for output shared files (default=='%s') LIBSUF suffix for library files (default=='%s') SLIBSUF suffix for shared library files (default=='%s') SFLAGS options for C compiler - shared version (default=='%s') CLIPLIB runtime support library (default=='%s') CLIPSLIB runtime support shared library (default=='%s') CLIPLIBS additional libs (default=='%s') CLIPROOT root for all clip related files (default=='%s') CLIP_LOCALE_ROOT root for locale messages CLIP_MODULE current locale module (default=='%s') CLIP_CMDSTR comma-separated list of command-line options CLIP_NAMES generate .ex, .nm files (possible values yes/no|on/off|0/1) predefined macros: __FILE__ string - name of current compile file __BASE_FILE__ string - name of root compile file __LINE__ numeric - number of current line in current file __VERSION__ string - version of clip __CLIP__ string - version of clip __SYSTEM__ string - name of operating system __DATE__ string - date in format 'MON DD YYYY' __TIME__ string - current time in format 'HH:MM::SS' __CLIP_MODULE__ string - name of current locale module
pt_br: %s pode aceitar as siguintes variáveis de ambiente: CC nome do compilador C (padrão=='%s') CFLAGS opções do compilador C (padrão=='%s') COMPILE_FLAG opção de somente-compilar para o compilador C (padrão=='%s') COPT opção de otimização do compilador C (padrão=='%s') CDBG opção de depuração (debug) do compilador C (padrão=='%s') OUT_FLAG opção de saida do compilador C (padrão=='%s') INCLUDE_FLAG opção de inclusão do compilador C (padrão=='%s') OBJSUF extensão para arquivos objetos de saída (padrão=='%s') SOBJSUF extensão para arquivos compartilhados (shared) de saída (padrão=='%s') LIBSUF extensão para arquivos de bibliotecas (padrão=='%s') SLIBSUF extensão para arquivos de bibliotecas compartilhadas (padrão=='%s') SFLAGS opções para o compilador C - versão compartilhada (padrão=='%s') CLIPLIB suporte a biblioteca ao executar (runtime) (padrão=='%s') CLIPSLIB suporte a biblioteca compartilhada ao executar (runtime) (padrão=='%s') CLIPLIBS bibliotecas adicionais (padrão=='%s') CLIPROOT raíz central para todos os arquivos relacionados ao clip (padrão=='%s') CLIP_LOCALE_ROOT raíz para menssagens de regionalização CLIP_MODULE módulo de regionalização atual (padrão=='%s') CLIP_CMDSTR lista separada por vírgulas de opções de linha de comando para o clip CLIP_NAMES gerar arquivos .ex, .nm (possíveis valores: yes/no|on/off|0/1) macros predefinidas: __FILE__ texto - nome do arquivo atual a compilar __BASE_FILE__ texto - nome do arquivo raíz a compilar __LINE__ número - número da linha no arquivo atual __VERSION__ texto - versão do clip __CLIP__ texto - versão do clip __SYSTEM__ texto - nome do sistema operacional __DATE__ texto - data no formato 'MM DD AAAA' __TIME__ texto - hora no formato 'HH:MM:SS' __CLIP_MODULE__ texto - nome do módulo atual de regionalização

source: cannot open defname file '%s': %s
pt_br: não se pode abrir o arquivo defname '%s': %s

source: cannot open exname file '%s': %s
pt_br: não se pode abrir o arquivo exname '%s': %s

source: possible not defined function %s
pt_br: função possivelmente não definida %s

source: error
pt_br: erro

source: conflict between -s and -p flags
pt_br: conflito entre opções -s e -p

source: conflict between -c and -p flags
pt_br: conflito entre opções -c e -p

source: conflict between -n and -m flags
pt_br: conflito entre opções -n e -m

source: cannot change to output dir '%s': %s
pt_br: não se pode trocar para diretório destino '%s': %s

source: unknown file type '' file '%s'
pt_br: tipo de arquivo desconhecido '' file '%s'

source: unknown file type '%s' file '%s'
pt_br: tipo de arquivo desconhecido '%s' file '%s'

source: no input files, so use stdin; -h will help
pt_br: arquivo de entrada não especificado, usando stdin (-h para ajuda)

source: process file '%s' ..
pt_br: processando arquivo '%s' ..

source: .. done, %s
pt_br: .. terminado, %s

source: parsing file '%s' ..
pt_br: analizando arquivo '%s' ..

source: .. done (%d/%d %s, %d %s, %s)
pt_br: .. terminado (%d/%d %s, %d %s, %s)

source: line
pt_br: linha

source: warning
pt_br: advertência

source: codegen file '%s' ..
pt_br: arquivo de código '%s' ..

source: writing file '%s' ..
pt_br: gravando arquivo '%s' ..

source: .. done, %ld %s ,%s
pt_br: .. terminado, %ld %s ,%s

source: .. done
pt_br: .. terminado

source: compile file '%s' ..
pt_br: compilando arquivo '%s' ..

source: make shared object '%s' ..
pt_br: criando arquivo compartilhado '%s' ..

source: generate reference file '%s' ..
pt_br: gerando arquivo de referência '%s' ..

source: make file '%s' ..
pt_br: criando arquivo '%s' ..

source: C level error in command: %s
pt_br: erro de C no comando: %s

source: file
pt_br: arquivo

source: cannot open output file '%s'
pt_br: não é possível abrir o arquivo de saída '%s'

source: cannot write PCODE module with c-texts
pt_br: não é possível escrever o módulo PCODE com textos-c

source: error writing file '%s', %s
pt_br: erro escrevendo arquivo '%s', %s

source: cannot open pipe '%s'
pt_br: não é possível abrir pipe '%s'

source: cannot open file '%s': %s
pt_br: não é possivel abrir o arquivo '%s': %s

source: invalid chars in number
pt_br: carateres inválidos em número

source: newline in string
pt_br: nova linha em texto

source: end-of-comment without begin
pt_br: fim de comentário sem marca de início

source: '@}' without '@{'
pt_br: '@}' sem '@{'

source: id: non-matched command '%s'
pt_br: id: comando não encontrado '%s'

source: non-matched command '%s'
pt_br: comando não encontrado '%s'

source: #else without #ifdef or #ifndef
pt_br: #else sem #ifdef ou #ifndef

source: #endif without #ifdef or #ifndef
pt_br: #endif sem #ifdef ou #ifndef

source: invalid #define directive
pt_br: diretiva #define inválida

source: macro function redefined
pt_br: função macro redefinida

source: macro redefined
pt_br: macro redefinida

source: invalid macro call
pt_br: chamada inválida de macro

source: invalid number of macro arguments (%d instead %d)
pt_br: número inválido de argumetos de macro (%d em vez de %d)

source: unexpected EOL in SM_ENUM
pt_br: inesperado EOL em SM_ENUM

source: bad symbol in SM_ENUM: '%s'
pt_br: símbolo inválido em SM_ENUM: '%s'

source: non-balanced '[' in #command
pt_br: nãon balanceado '[' em #command

source: unexpected end of #command directive
pt_br: fim inesperado de diretiva #command

source: cmdstr: newline in string
pt_br: cmdstr: nova linha em texto

source: too much errors
pt_br: muitos error

source: #ifdef or #ifndef without #endif
pt_br: #ifdef ou #ifndef sem #endif

source: unterminated string constant (possible begin at line %d pos %d file '%s')
pt_br: constante de texto não terminada (possível começo na linha %d posição %d arquivo '%s')

source: unmatched bracket '%c' (possible begin at line %d pos %d file '%s')
pt_br: chave não conhecida '%c' (possível começo na linha %d posição %d arquivo '%s')

source: unclosed comment (possible begin at line %d pos %d file '%s')
pt_br: comentário não fechado (possível começo na linha %d posição %d arquivo '%s')

source: no ENDTEXT
pt_br: sem ENDTEXT

source: macro function with 0 count of arguments
pt_br: função macro com 0 argumentos

source: no subst marker '%s' in pattern part of command
pt_br: sem marca de sustituição '%s' na máscara de comando

source: unmatched bracket '%c'
pt_br: chave não conhecida '%c'

source: skip_norm: match delim '%s', return at '%s'
pt_br: skip_norm: coincidencia delim '%s', retorna em '%s'

source: bad command definition: OPTION have only literals
pt_br: má definição de comando: OPTION tem somente literais

source: endless subst loop detected
pt_br: detectado loop sem marca de destino (fim de loop)

source: too many entries in OPTIONAL list: > %d
pt_br: muitas entradas na lista OPTIONAL: > %d

source: bad #include directive
pt_br: diretiva #include inválida

source: cannot open include file '%s': %s
pt_br: não é possível abrir o arquivo include '%s': %s

source: circular loop in macro/command substitution detected
pt_br: loop circular detetado na sustituição de macro/comando

source: set file '%s' charset to '%s'
pt_br: definir arquivo '%s' de caracteres para '%s'

source: push charset '%s' %d
pt_br: definido padrão de caracteres '%s' %d

source: pop charset '%s' %d
pt_br: desmarcado padrão de caracteres '%s' %d

source: too long string
pt_br: texto muito longo

source: cannot create dir '%s': %s
pt_br: não é possível criar o diretório '%s': %s

source: cannot create file '%s': %s
pt_br: não é possível criar o arquivo '%s': %s

source: open locale file '%s'
pt_br: aberto arquivo de regionalização '%s'

source: wrote locale message entry '%s'
pt_br: gravada ensagem de entrada regionalizada '%s'

source: wrote plural locale message '%s' '%s'
pt_br: gravada mensagem regional no plural '%s' '%s'

source: po code too large at line %d
pt_br: código .po muito longa na linha

source: LOCAL after executable statements
pt_br: LOCAL após comandos executáveis

source: STATIC after executable statements
pt_br: STATIC após comandos executáveis

source: only constant expression allowed for static variable initialisation
pt_br: só são permitidas expresiones constantes para inicialização de variables estáticas

source: MEMVAR after executable statements
pt_br: MEMVAR após comandos executáveis

source: FIELD after executable statements
pt_br: FIELD após comandos executáveis

source: PARAMETERS and '(' <paramlist> ')' are incompatible
pt_br: PARAMETERS e '(' <listaparam> ')' são incompativeis

source: init expression not allowed here
pt_br: expresssão de inicio não permitida aquí

source: array declaration not allowed here
pt_br: declaração de matriz não permitida aqui

source: reference to constant
pt_br: referência a constante

source: reference to temporary object
pt_br: referência a objeto temporal

source: reference to undeclared function '%s' near line %d
pt_br: referência a função não declarada '%s' na linha %d

source: reference to macro not allowed
pt_br: referência a macro não permitida

source: reference to non-lvalue object
pt_br: referência a objeto sem valor

source: reference to function with args not allowed
pt_br: referência a função com argumentos não definidos

source: cannot GET constant
pt_br: não se pode usar GET em constantes

source: assign to non-lvalue
pt_br: definido para non-lvalue

source: reference to macro assign not allowed
pt_br: marca de referência a macro não permitida

source: CTEXT in pcode module
pt_br: CTEXT em módulo pcodigo

source: assign to element of local array conflicts with macro
pt_br: conflito entre marca de matriz local e macro

source: INCR with non-lvalue
pt_br: INCR com no-lvalor

source: %s not allowed in CODESTR
pt_br: %s não épermitido em CODESTR

source: CASE label duplication: '%s' at line %d and '%s' at line %d
pt_br: marca CASE duplicada: '%s' na linha %d e '%s' na linha %d
