Repository: amery/clip-angelo
Catalog: clip/locale.po/*.8859-1/sys.po
Languages: pt_br

source: Class TBlock constructor error:Invalid expression
pt_br: Erro do construtor da classe TBlock: Expressão inválida

source: Beginning of file
pt_br: Inicio do arquivo

source: End of file
pt_br: Fim do arquivo

source: Record in use, Please, retry
pt_br: Registro em uso. Por favor, tente novamente

source: Can~t lock dataBase ! Please try again
pt_br: Não pode bloquear a base de dados. Por favor, tente novamente

source: Called Error:
pt_br: Erro de chamada:

source: Field not found in dictonary
pt_br: Campo não encontrado não dicionário

source: Index not found in dictonary
pt_br: Indice não encontrado não dicionário

source: Line
pt_br: Linha

source: String;
pt_br: Texto (string);

source: ;not found!
pt_br: ;não encontrado!

source: &File
pt_br: &Arquivo

source: E&xit
pt_br: &Sair

source: End of application
pt_br: Fim a aplicação

source: &Options
pt_br: &Opções

source: &Find
pt_br: &Buscar

source: Find string
pt_br: Buscar um texto (string)

source: &Resume
pt_br: &Resumir

source: Resume find string
pt_br: Continua a busca do texto (string)

source: &Unmark
pt_br: &Desmarcar

source: Unmark selected block
pt_br: Desmarcar bloco selecionado

source: Can't open file;
pt_br: Não pode abrir o arquivo;

source: File;
pt_br: Arquivo;

source: ;not saved. Save it?
pt_br: ;não foi salvo. Salva?

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Cancel
pt_br: Cancelar

source: Made
pt_br: Feito

source: changes
pt_br: alterações

source: Nothing to find!!!
pt_br: Nada para buscar!!!

source: String
pt_br: Texto (string)

source: not found!
pt_br: não encontrado!

source: There is a change in the file.;
pt_br: Tem alteração não arquivo.;

source: ; Reload?
pt_br: ; Recarrega?

source: Symbol '
pt_br: Símbolo '

source: ' not found!
pt_br: ' não encontrado!

source: Structure not found!
pt_br: Estrutura não encontrada!

source: Block not marked!
pt_br: Bloco não marcado!

source: ;already exists. Overwrite it?
pt_br: ;já existe. Substitui?

source: Windows list
pt_br: Lista de janelas

source: ESC - menu <SINGLE GRAPHIC>
pt_br: ESC - menu <GRÁFICO SIMPLES>

source: ESC - menu <DOUBLE GRAPHIC>
pt_br: ESC - menu <GRÁFICO DUPLO>

source: Can't save file ;
pt_br: Não pode salvar o arquivo ;

source: &New
pt_br: &Novo

source: Create a new file
pt_br: Criar um arquivo novo

source: &Open...
pt_br: &Abrir..

source: Open a file
pt_br: Abrir um arquivo

source: &Save
pt_br: &Salvar

source: Save a file
pt_br: Salvar um arquivo

source: &Save as...
pt_br: Salvar c&omo...

source: Save a file as...
pt_br: Salvar um arquivo como...

source: &Reload file
pt_br: &Recarregar arquivo

source: Reload a file
pt_br: Recarregar um arquivo

source: Read on&ly
pt_br: Somente &leitura

source: Read only options
pt_br: Opções de somente leitura

source: &Print...
pt_br: Im&primir...

source: Print a file
pt_br: Imprimir um arquivo

source: Print &block...
pt_br: Imprimir &bloco

source: Print marked block
pt_br: Imprimir um bloco marcado

source: E&xit with save
pt_br: &Sair salvando

source: End of application and save options
pt_br: Terminar a aplicação e salvar as opções

source: Exit with-out sa&ve
pt_br: Sair sem g&uardar

source: End of application and not save options
pt_br: Terminar a aplicação sem salvar as opções

source: &Window
pt_br: &Janela

source: &List
pt_br: &Listar

source: List of windows
pt_br: Lista de janelas

source: &Next
pt_br: &Seguinte

source: Next window
pt_br: Próxima janela

source: &Prev
pt_br: &Anterior

source: Prevoice window
pt_br: Janela anterior

source: &Close
pt_br: Fe&char

source: Close window
pt_br: Fechar janela

source: &Block
pt_br: &Bloco

source: &Line block marker
pt_br: Marca de &linha de bloco

source: Start/stop line block marker
pt_br: Iniciar/Parar marcador de linha de bloco

source: &Column block marker
pt_br: Marcador de bloco por &colunas

source: Start/stop columns block marker
pt_br: Iniciar/Parar marcador de linha de bloco por colunas

source: &Unmark
pt_br: &Desmarcar

source: Unmark block marker
pt_br: Desmarcar bloco

source: Co&py
pt_br: Co&piar

source: Copy block
pt_br: Copiar bloco

source: &Move
pt_br: &Mover

source: Move block
pt_br: Mover bloco

source: &Delete
pt_br: &Deletar

source: Delete block
pt_br: Apagar bloco

source: Copy to clip&board
pt_br: Copiar para área de transf&erência

source: Copy block to clipboard
pt_br: Copiar bloco para área de transferência

source: Pa&ste from clipboard
pt_br: Pegar &da área de transferência

source: Paste block from clipboard
pt_br: Pegar bloco da área de transferência

source: &Save to file
pt_br: &Gravar para arquivo

source: Save block to file
pt_br: Gravar o bloco em um arquivo

source: &Load from file
pt_br: Carregar a partir de um arqui&vo

source: Load block from file
pt_br: Carrregar um bloco a partir de um arquivo

source: &Service
pt_br: &Serviços

source: &Insert mode
pt_br: Modo &inserir

source: On/off insert mode
pt_br: Liga/Desliga modo inserir

source: Find &string
pt_br: &Buscar texto

source: Find string
pt_br: Buscar um texto (string)

source: Find &next
pt_br: Bu&scar próximo

source: Find next
pt_br: Buscar próxima ocorrência

source: Find pre&vious
pt_br: Buscar &anterior

source: Find previous
pt_br: Buscar ocorrência anterior

source: &Replace
pt_br: Substitui&r

source: Find and replace string
pt_br: Localizar e substituir o texto

source: &Match symbol forward
pt_br: Encontrar o próximo &símbolo

source: Match identity symbol in forward
pt_br: Encontrar o próximo símbolo

source: Match symbol &backward
pt_br: Encontrar símbolo &anterior

source: Match identity symbol in backward
pt_br: Encontrar o símbolo anterior

source: Match structure forward
pt_br: Encontrar a próxima &estrutura

source: Match Clipper structure to forward
pt_br: Encontrar a próxima estrutura Clipper

source: Match structure backward
pt_br: Encontrar estrutura an&terior

source: Match Clipper structure to backward
pt_br: Encontrar estrutura Clipper anterior

source: &Undo
pt_br: &Desfazer

source: Undo operation
pt_br: Desfazer operação

source: Forma&t
pt_br: Forma&tar

source: Format &line
pt_br: Dar formato à &linha

source: Format line
pt_br: Dar formato para a linha

source: Format &part
pt_br: Dar formato à &parte

source: Format part
pt_br: Dar formato para a parte

source: O&therwise
pt_br: &Outros

source: Template &macro
pt_br: Template de &macro

source: Template macro
pt_br: Template de macro

source: &Single graphic
pt_br: Gráfico &simples

source: On/Off single graphic mode
pt_br: Liga/Desliga modo de gráfico simples

source: &Double graphic
pt_br: Gráfico &duplo

source: On/Off double graphic mode
pt_br: Liga/Desliga modo de gráfico duplo

source: &Choose code page
pt_br: Tro&car página de códigos

source: Choose code page
pt_br: Trocar página de códigos

source: &Options...
pt_br: &Opções...

source: Set options
pt_br: Define opções

source: ; not saved. Save?
pt_br: ; não foi salvo. Grava?

source: Options
pt_br: Opções

source: Create .bak files
pt_br: Criar arquivos .bak

source: Tabulation size
pt_br: Tamanho de tabulação

source: Tabulation packing
pt_br: Formato da tabulação

source: Autosave files
pt_br: Autogravar arquivos

source: Autosave time
pt_br: Tempo de autogravação

source: Save status
pt_br: Status de gravação

source: Hypen in word
pt_br: Hyfenação

source: Auto wrap
pt_br: Wrap automático

source: Auto margin left
pt_br: Margem esquerda automática

source: Margin left
pt_br: Margem esquerda

source: Margin right
pt_br: Margem direita

source: Max strings
pt_br: Tamanho máximo de texto (string)

source: Line
pt_br: Linha

source: Bad line number!
pt_br: Número de linha inválido!

source: New
pt_br: Novo

source: Source charset
pt_br: Caracteres de origem

source: Y
pt_br: S

source: array
pt_br: matriz

source: Block
pt_br: Bloco

source: No
pt_br: Não

source: Object
pt_br: Objeto

source: Connect not activated
pt_br: Conexão não ativada

source: Find & replace
pt_br: Buscar e substituir

source: Find:
pt_br: Buscar:

source: Replace:
pt_br: Substituir:

source: Find
pt_br: Buscar

source: Options
pt_br: Opções

source: Case-sensitive
pt_br: Sensitivo a caracteres Maiúsculo/Minúsculo

source: Word only
pt_br: Somente palavra

source: Reg. expression
pt_br: Expressão reg.

source: All windows
pt_br: Todas as janelas

source: Forward
pt_br: Avança

source: Backward
pt_br: Volta

source: From begin
pt_br: Desde o começo

source: Direction
pt_br: Direção

source: In block
pt_br: Em bloco

source: Where
pt_br: Onde

source: Load file...
pt_br: Carrega arquivo...

source: The size of file ;
pt_br: O tamanho do arquivo;

source: ; most maximum size!;Last strings may be lost
pt_br: ; tamanho exagerado!;Últimas strings podem se perder

source: The size of file is a most maximum size!;Last strings may be lost; Please check MAXSTRINGS options
pt_br: O tamanho do arquivo é exagerado!; Últimas strings podem se perder; Por favor, cheque as opções MAXSTRINGS

source: Save file...
pt_br: Salvar arquivo...

source: Can't create ;
pt_br: Não pode criar ;

source: .bak file
pt_br: arquivo .bak

source: Save block to file...
pt_br: Salvar bloco para arquivo...

source: Out from bound in sorted array
pt_br: Fora de límite em matriz ordenada

source: Unknown values for key or data
pt_br: Valor desconheido para dados de chave

source: Out bounds in sorted array
pt_br: Fora de límite em matriz ordenada

source: Key value not found in sorted array
pt_br: Valor de chave não encontrado em matriz ordenada

source: Unknown values for key
pt_br: Valores desconhecidos para clave

source: : create error:
pt_br: : erro de criação:

source: Bad file name: name is not specified
pt_br: Nome do arquivo inválido: nome não especificado

source: : open error:
pt_br: : erro de abertura:

source: Bad string in .ini file:
pt_br: Cadeia de texto inválida no arquivo .ini:

source: TCP connection error:
pt_br: TCP erro de conecção:

source: Bad cobraQuery object
pt_br: Objeto cobraQuery ruim

source: Bad cobraAnswer object
pt_br: Objeto cobraAnswer ruim

source: Answer ID not found
pt_br: Resposta ID não encontrada!

source: CODB library not linked
pt_br: biblioteca CODB não lincada

source: Bad depository ID:
pt_br: ID de armazenagem ruim:

source: Bad class name or ID:
pt_br: nome de clasee ou ID ruim:

source: File not found:
pt_br: Arquivo não encontrado!

source: Need updating client
pt_br: Precisa atualizar cliente

source: Client LANG value not supported
pt_br: Valor de LANG do cliente não suportado

source: Client CHARSET value not supported
pt_br: Valor de CHARSET do cliente não suportado

source: Client CRYPTO value not supported
pt_br: Valor de CRYPTO do cliente não suportado

source: Error A2EDIT; What~s Edit ?
pt_br: Erro em A2EDIT; Quer Editar?

source: cannot open file:
pt_br: Não pode abrir o arquivo;

source: Record N
pt_br: Registro N

source: January
pt_br: Janeiro

source: February
pt_br: Fevereiro

source: March
pt_br: Março

source: April
pt_br: Abril

source: May
pt_br: Maio

source: June
pt_br: Junho

source: July
pt_br: Julho

source: August
pt_br: Agosto

source: September
pt_br: Setembro

source: October
pt_br: Outubro

source: November
pt_br: Novembro

source: December
pt_br: Dezembro

source: Sunday
pt_br: Domingo

source: Monday
pt_br: Segunda

source: Tuesday
pt_br: Terça

source: Wednesday
pt_br: Quarta

source: Thursday
pt_br: Quinta

source: Friday
pt_br: Sexta

source: Saturday
pt_br: Sábado

source: Error
pt_br: Erro

source: Can't open;
pt_br: Não pode abrir;

source: Database files
pt_br: Arquivos de base de dados

source: # records
pt_br: # registros

source: last update
pt_br: última atualização

source: size
pt_br: tamanho

source: Esc: Cancel
pt_br: Esc: Cancela

source: Invalid argument
pt_br: Argumento inválido

source: Database Files # Records Last Update Size
pt_br: Base de dados # Registros Ult. Atualiz. Tamanho

source: Do you want more samples?
pt_br: Quer mais exemplos?

source: Page No.
pt_br: Pág. No.

source: Invalid date
pt_br: Data inválida

source: YyTtYy1
pt_br: SsVvSs1

source: Plugin not found:
pt_br: Plugin não encontrado:

source: Error compiling plugin file:
pt_br: Erro compilando arquivo plugin:

source: Error loading plugin block from file:
pt_br: Erro carregando bloco de plugin a partir do arquivo:

source: Unknown
pt_br: Desconhecido

source: Undef
pt_br: Indef

source: < >-go next item i-info <F5>-go line <F6>-find <F9>-menu <ESC>,<F10>-exit
pt_br: < >-ir prox. item i-info <F5>-ir línha <F6>-buscar <F9>-menu <ESC>,<F10>-sair

source: Where are you going?
pt_br: Para onde está indo?

source: &Charset
pt_br: &Jogo de caracteres

source: &Control
pt_br: &Controle

source: &Next
pt_br: &Seguir

source: Go next item
pt_br: Ir para o item seguinte

source: &Prev
pt_br: &Anterior

source: Go previous item
pt_br: Ir para o item anterior

source: P&revUrl
pt_br: URL An&t.

source: Go previous URL document
pt_br: Ir para o documento URL anterior

source: Nex&tUrl
pt_br: URL Se&g.

source: Go next URL document
pt_br: Ir para o documento URL seguinte

source: Get information about URL document
pt_br: Informação a respeito do documento URL

source: Press any key to continue
pt_br: Pressione uma tecla para continuar

source: View printer output in text editor
pt_br: Ver saida de impressora em editor de texto

source: Printing to main printer on your host
pt_br: Imprimindo para a impresora principal em seu servidor

source: choice printer
pt_br: escolha impressora

source: : Printing pages range: from XXXX to YYYY
pt_br: : Imprimindo páginas: de XXXX a YYYY

source: : Printing copies: XXXX
pt_br: : Imprimindo copias: XXXX

source: Printbegin(): printing already in process
pt_br: Printbegin(): impressão atualmente em andamento

source: PrintEnd(): printing process not actived
pt_br: PrintEnd(): processo de impressão não ativado

source: Press any key
pt_br: Pressione qualquer tecla
