Repository: amery/clip-angelo
Catalog: doc/po/doc/rdd.sgml/*.po
Languages: ru

source: Replaceable Database Drivers (RDD)
ru: Заменяемые Драйвера Баз данных (RDD - Replaceable Database Drivers)

source: Overview
ru: Введение

source: RDD is an abbreviation for Replaceable Database Drivers, that are used for processing a particular database format. RDD is an intermediate layer, that translates CLIP API calls to the low level file operations.
ru: RDD - сокращение от Replaceable Database Drivers (Заменяемые Драйвера Баз данных), которые используются для работы с определенным форматом базы данных. RDD является посредником между приложением CLIP и ОС, преобразующим вызовы функций CLIP в низкоуровневые операции с файлами.

source: RDD architecture used in CLIP differs from those used in Clipper. CLIP RDD (in conception of Clipper) consist of three different <emphasis>subdrivers</emphasis>: table driver, index driver and memo driver. These drivers can be easily combined in any way.
ru: Архитектура RDD используемая в CLIP отличается от используемой в Clipper. CLIP RDD состоит из трех разных <emphasis>поддрайверов</emphasis>: драйвера таблиц, драйвера индексов и драйвера мемо-файлов. Эти поддрайвера легко могут комбинироваться в разных сочетаниях.

source: Besides, CLIP have additional developer interface - a set of RDD*() functions, that operate with the database <emphasis>descriptors</emphasis>, instead of <emphasis>work areas</emphasis>.
ru: Кроме того, в CLIP есть еще один интерфейс разработчика - набор функций RDD*(), которые оперируют <emphasis>дескрипторами</emphasis> баз данных, а не <emphasis>рабочими областями</emphasis>.

source: Some of the most interesting features of CLIP RDD subsystem are listed below:
ru: Ниже перечислены некоторые возможности подсистемы RDD в CLIP:

source: query optimizer (Rushmore/MachSIx like technology)
ru: оптимизатор запросов (технология Rushmore/MachSIx)

source: VARCHAR fields (compact storing of strings with length up to 64K)
ru: поля VARCHAR (компактное хранение строк с длиной до 64К)

source: VARIANT fields, allowing to store data of any basic XBase type (CHARACTER, NUMERIC, DATE, DATETIME or LOGIC)
ru: поля VARIANT, позволяющий хранить данные любого примитивного типа XBase (CHARACTER, NUMERIC, DATE, DATETIME или LOGIC)

source: storing data of any type (including objects) in memo-fields
ru: хранение данных любого типа (включая объекты) в мемо-полях

source: Roll-Your-Own filters
ru: "ручные" фильтры

source: MEMOPACK and Flexible FPT (reusing discarded blocks, that reduces memo bloat)
ru: MEMOPACK и Flexible FPT (повторное использование свободных блоков, что уменьшает рост мемо-файла)

source: support of "scoped" SET RELATION (only "right" child table records are visible)
ru: поддержка "scoped" SET RELATION (видны только "правильные" записи дочерней таблицы)

source: Roll-Your-Own indexes
ru: "ручные" индексы

source: multiple record locking
ru: блокировка нескольких записей

source: database event triggers
ru: триггеры событий базы данных

source: record edit rollbacks
ru: откат редактирования записи

source: "temporary" tables (that are deleted on CLOSE automatically)
ru: "временные" таблицы (автоматически удаляются при закрытии)

source: RDDs peculiarities
ru: Отличия разных RDD

source: There are following subdrivers:
ru: В CLIP имеются следующие поддрайвера:

source: table drivers: DBF, FOX and VFP
ru: драйвера таблиц: DBF, FOX и VFP

source: index drivers: NTX, CTX, CDX, IDX
ru: драйвера индексов: NTX, CTX, CDX, IDX

source: memo drivers: DBT, FPT
ru: драйвера мемо-файлов: DBT, FPT

source: The following RDDs (in conception of Clipper) consist of these subdrivers:
ru: Следующие RDD (в понятиях Clipper) состоят из следующих поддрайверов:

source: synonym for DBFCDX
ru: синоним для DBFCDX

source: Table drivers
ru: Драйвера таблиц

source: CLIP discerns the type of table to be opened using file signature, i.e. the table is opened successfully even if specified table RDD is different. But that does not apply to memo files and indexes.
ru: CLIP распознает тип открываемой таблицы по его сигнатуре, т.е. таблица успешно открывается даже если его сигнатура не соответствует заданной. Но это не относится к мемо-файлам и индексам.

source: DBF and FOX drivers are mostly the same. The only difference is file signature for tables with memo (0xF5 with FOX, 0x83 with DBF). VFP driver operates with Visual FoxPro tables. VFP table have different header, and provides some possibilities that are missing in usual DBF format, e.g. possibility of creating binary fields and nullable fields (5th and 6th elements in the field description, used in DBCREATE() and DBSTRUCT()).
ru: Драйвера DBF и FOX практически одинаковые. Единственная разница - это сигнатура таблиц с мемо-полями (0xF5 в FOX, 0x83 в DBF). Драйвер VFP оперирует таблицами Visual FoxPro. Таблица VFP имеет видоизмененный заголовок и предоставляет некоторые возможности, недоступные в обычном формате DBF, например возможность создания бинарных полей, <emphasis>nullable</emphasis> полей (5-й и 6-й элементы в описании поля, используемого функциями DBCREATE() и DBSTRUCT()).

source: All table drivers support all field types, described below.
ru: Все драйвера таблиц поддерживают все типы полей, описанных ниже.

source: Field types
ru: Типы полей

source: Field type
ru: Тип поля

source: Identifier(s)
ru: Идентификатор(ы)

source: Size in table
ru: Размер в таблице

source: Description
ru: Описание

source: Character strings
ru: Строки символов

source: VARCHAR type allows to store character data of any size. At that, the first <![CDATA[<size_of_field>]]> - 6 bytes are stored in .DBF file itself, remaining are stored in MEMO file. In the time of indexing, only those bytes stored in .DBF are used.
ru: Тип VARCHAR позволяет хранить строки разной длины. При этом первые <![CDATA[<size_of_field>]]> -6 байт хранятся непосредственно в .DBF файле, а остальные помещаются в мемо-файле. При индексации такого поля используются только байты, хранящиеся в .DBF.

source: Borrowed from SIx library
ru: Заимствовано из библиотеки SIx

source: Variable length character strings
ru: Строки разной длины

source: Borrowed from VFP
ru: Заимствовано из VFP

source: Integers or fractions
ru: Целые или дробные

source: Monetary amounts
ru: Денежные суммы

source: Double precision floating point numbers
ru: Числа с плавающей точкой двойной точности

source: Integer values
ru: Целые числа

source: 8 (3 bytes with V(3))
ru: 8 (3 байта при V(3))

source: Chronological data consisting of year, month, day
ru: Хронологические данные состоящие из года, месяца, дня

source: Chronological data consisting of year, month, day and time
ru: Хронологические данные состоящие из года, месяца, дня и времени

source: Boolean values of true or false
ru: Логическое значение "истина" или "ложь"

source: Data of any type
ru: Данные любого типа

source: Available with FPT memo driver, only CHARACTER with DBT
ru: Доступно при использовании мемо-драйвера FPT, в DBT - только текст

source: with no size limits
ru: без ограничений по размеру

source: BLOB type is always binary, regardless of binary status in field description, passed to DBCREATE() function.
ru: BLOB поля - всегда бинарные, независимо от соответствующего значения в описании поля, переданному функции DBCREATE().

source: Binary data of any type
ru: Бинарные данные любого типа

source: VARIANT type allows to store the data of any basic xBase type. Character strings can be of size <![CDATA[<size_of_field>]]> - 2 (two bytes are reserved for storing type and length). VARIANT fields can be indexed. The order of values of various types in index is as the following: CHARACTER, LOGICAL, DATE, DATETIME, NUMERIC.
ru: Тип VARIANT позволяет хранить данные любого примитивного типа xBase. Строки могут быть длиной до <![CDATA[<размер_поля>]]> - 2 (два байта отводятся для хранения типа данных и длины). Поля VARIANT могут индексироваться. Последовательность данных разных типов в индексе такова: CHARACTER, LOGICAL, DATE, DATETIME, NUMERIC.

source: Data of any xBase type (CHARACTER, NUMERIC, DATE, DATETIME or LOGICAL)
ru: Данные любого типа xBase (CHARACTER, NUMERIC, DATE, DATETIME или LOGICAL)

source: Index drivers
ru: Драйвера индексов

source: The following table summarizes the availability of key features across index drivers.
ru: В следующей таблица показывается доступность основных свойств драйверов индексов.

source: Index features summary
ru: Возможности индексов

source: Item
ru: Свойство

source: Order management (tag support)
ru: Поддержка тегов

source: No
ru: Нет

source: Yes
ru: Да

source: Number of orders (tags) per file
ru: Количество тегов на файл

source: Number of order bags (files) per work area
ru: Количество индексных файлов на рабочую область

source: No limit
ru: Не ограничено

source: Conditional indexes (FOR clause)
ru: Условные индексы (INDEX ... FOR)

source: Temporary (partial) indexes (WHILE clause)
ru: Временные (частичные) индексы (INDEX ... WHILE)

source: Descending via DESCENDING clause
ru: Обратный порядок ключей (INDEX ... DESCENDING)

source: Unique via the UNIQUE clause
ru: Уникальные ключи (INDEX ... UNIQUE)

source: EVAL and EVERY clause support
ru: Интерактивная индексация (INDEX ... EVAL ... EVERY)

source: Structural indexes
ru: Структурные индексы

source: Maximum key expression length (bytes)
ru: Максимальная длина ключевого выражения (байт)

source: Maximum FOR condition length (bytes)
ru: Максимальная длина выражения условия FOR (байт)

source: Scoped relations support
ru: Поддержка ограниченных отношений (scoped relations)

source: Filter and FOR clause optimization (MachSIx/Rushmore technology)
ru: Оптимизация фильтров и FOR условий (технология MachSIx/Rushmore)

source: Memo drivers
ru: Драйвера мемо-файлов

source: There are two memo drivers DBT and FPT. DBT memo files are used with DBFNTX and DBFCTX RDDs. DBT file format is fully compatible with Clipper. FPT memo files used with DBFCDX and DBFIDX RDDs have more powerful format, that can store not only textual data, but any other data. FPT file can store any CLIP data type, including objects, binary data (e.g. images), etc.
ru: Имеется два драйвера мемо-файлов: DBT и FPT. Мемо-файлы DBT используются в DBFNTX и DBFCTX. Формат DBT файла полностью совместим с Clipper. Мемо-файлы FPT, используемые с DBFCDX и DBFIDX, имеют более мощный формат, который может быть использован не только для хранения текстовых данных, но и других данных (любой тип CLIP, включая объекты, бинарные данные (например, картинки), и т.д.
